{
 "nodes":[
	  {
		"id": "I.1",
		"bookNumber": 1,
		"propositionNum": 1,
		"type": "construction",
		"label_en": "To construct an equilateral triangle on a given finite straight line.",
		"label_uk": "Побудувати рівносторонній трикутник на даному скінченному відрізку."
	  },
	  {
		"id": "I.2",
		"bookNumber": 1,
		"propositionNum": 2,
		"type": "construction",
		"label_en": "To place a straight line equal to a given straight line with one end at a given point.",
		"label_uk": "Відкласти прямолінійний відрізок, рівний даному, від даної точки."
	  },
	  {
		"id": "I.3",
		"bookNumber": 1,
		"propositionNum": 3,
		"type": "construction",
		"label_en": "Given two unequal straight lines, to cut off from the greater a straight line equal to the less.",
		"label_uk": "Від більшого з двох нерівних відрізків відкласти частину, рівну меншому."
	  },
	  {
		"id": "I.4",
		"bookNumber": 1,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "If two triangles have two sides and the included angle equal, they are congruent.",
		"label_uk": "Якщо у двох трикутниках по дві сторони і кут між ними відповідно рівні, то такі трикутники рівні."
	  },
	  {
		"id": "I.5",
		"bookNumber": 1,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "The base angles of an isosceles triangle are equal.",
		"label_uk": "Кути при основі рівнобедреного трикутника рівні."
	  },
	  {
		"id": "I.6",
		"bookNumber": 1,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "If in a triangle two angles are equal, the sides opposite them are also equal.",
		"label_uk": "Якщо в трикутнику два кути рівні, то і сторони, протилежні їм, також рівні."
	  },
	  {
		"id": "I.7",
		"bookNumber": 1,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "Given two lines and a base, only one triangle can be constructed.",
		"label_uk": "Через дану основу і дві задані сторони можна побудувати лише один трикутник."
	  },
	  {
		"id": "I.8",
		"bookNumber": 1,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "If two triangles have three sides equal, the triangles are congruent.",
		"label_uk": "Якщо в двох трикутниках усі три сторони відповідно рівні, то такі трикутники рівні."
	  },
	  {
		"id": "I.9",
		"bookNumber": 1,
		"propositionNum": 9,
		"type": "construction",
		"label_en": "To bisect a given angle.",
		"label_uk": "Бісектриса даного кута."
	  },
	  {
		"id": "I.10",
		"bookNumber": 1,
		"propositionNum": 10,
		"type": "construction",
		"label_en": "To bisect a given finite straight line.",
		"label_uk": "Розділити даний скінченний відрізок навпіл."
	  },
	  {
		"id": "I.11",
		"bookNumber": 1,
		"propositionNum": 11,
		"type": "construction",
		"label_en": "To draw a straight line at right angles to a given line from a given point on it.",
		"label_uk": "Провести перпендикуляр до даної прямої з точки на ній."
	  },
	  {
		"id": "I.12",
		"bookNumber": 1,
		"propositionNum": 12,
		"type": "construction",
		"label_en": "To draw a perpendicular to a given straight line from a point outside it.",
		"label_uk": "Провести перпендикуляр до прямої з точки поза нею."
	  },
	  {
		"id": "I.13",
		"bookNumber": 1,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "Angles on a straight line add up to two right angles.",
		"label_uk": "Суміжні кути на прямій дорівнюють двом прямим кутам."
	  },
	  {
		"id": "I.14",
		"bookNumber": 1,
		"propositionNum": 14,
		"type": "theorem",
		"label_en": "If two lines form equal angles with a third, they are in a straight line.",
		"label_uk": "Якщо дві прямі утворюють рівні кути з третьою, то вони утворюють пряму."
	  },
	  {
		"id": "I.15",
		"bookNumber": 1,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "Vertical angles are equal.",
		"label_uk": "Вертикальні кути рівні."
	  },
	  {
		"id": "I.16",
		"bookNumber": 1,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "In a triangle, if one side is extended, the exterior angle is greater than either of the opposite interior angles.",
		"label_uk": "Зовнішній кут трикутника більший за будь-який з протилежних внутрішніх."
	  },
	  {
		"id": "I.17",
		"bookNumber": 1,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "In any triangle, the sum of any two angles is less than two right angles.",
		"label_uk": "У трикутнику сума будь-яких двох кутів менша за два прямі."
	  },
	  {
		"id": "I.18",
		"bookNumber": 1,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "In any triangle, the greater side subtends the greater angle.",
		"label_uk": "У трикутнику більша сторона лежить проти більшого кута."
	  },
	  {
		"id": "I.19",
		"bookNumber": 1,
		"propositionNum": 19,
		"type": "theorem",
		"label_en": "In any triangle, the greater angle is subtended by the greater side.",
		"label_uk": "У трикутнику більший кут лежить проти більшої сторони."
	  },
	  {
		"id": "I.20",
		"bookNumber": 1,
		"propositionNum": 20,
		"type": "theorem",
		"label_en": "In any triangle, the sum of any two sides is greater than the remaining one.",
		"label_uk": "У трикутнику сума будь-яких двох сторін більша за третю."
	  },
	  {
		"id": "I.21",
		"bookNumber": 1,
		"propositionNum": 21,
		"type": "theorem",
		"label_en": "If two straight lines are drawn from the ends of a line and meet inside, the angle formed is less than two right angles.",
		"label_uk": "Якщо з кінців відрізка проведено дві прямі, що перетинаються всередині, то утворений кут менший за два прямі."
	  },
	  {
		"id": "I.22",
		"bookNumber": 1,
		"propositionNum": 22,
		"type": "construction",
		"label_en": "To construct a triangle from three given lines, any two of which sum to more than the third.",
		"label_uk": "Побудувати трикутник за трьома відрізками, сума будь-яких двох з яких більша за третій."
	  },
	  {
		"id": "I.23",
		"bookNumber": 1,
		"propositionNum": 23,
		"type": "construction",
		"label_en": "On a given line and at a given point, to construct an angle equal to a given angle.",
		"label_uk": "На даному відрізку і з даної точки побудувати кут, рівний даному."
	  },
	  {
		"id": "I.24",
		"bookNumber": 1,
		"propositionNum": 24,
		"type": "theorem",
		"label_en": "If two triangles have two sides equal and one angle greater, the third side is greater.",
		"label_uk": "Якщо у двох трикутниках по дві сторони рівні, але кут між ними більший в одному, то і третя сторона в ньому більша."
	  },
	  {
		"id": "I.25",
		"bookNumber": 1,
		"propositionNum": 25,
		"type": "theorem",
		"label_en": "If two triangles have two sides equal and the third side greater, the included angle is greater.",
		"label_uk": "Якщо у двох трикутниках по дві сторони рівні, але третя більша в одному, то і кут між рівними сторонами більший у ньому."
	  },
	  {
		"id": "I.26",
		"bookNumber": 1,
		"propositionNum": 26,
		"type": "theorem",
		"label_en": "If two triangles have two angles and one side equal, the triangles are congruent.",
		"label_uk": "Якщо у двох трикутниках по дві пари кутів і сторона між ними відповідно рівні, то такі трикутники рівні."
	  },
	  {
		"id": "I.27",
		"bookNumber": 1,
		"propositionNum": 27,
		"type": "theorem",
		"label_en": "If a straight line falling on two other lines makes alternate angles equal, the lines are parallel.",
		"label_uk": "Якщо пряма, що перетинає дві інші, утворює рівні внутрішні кути при перетині, то ці дві прямі паралельні."
	  },
	  {
		"id": "I.28",
		"bookNumber": 1,
		"propositionNum": 28,
		"type": "theorem",
		"label_en": "If corresponding or interior angles are equal, the lines are parallel.",
		"label_uk": "Якщо пряма утворює рівні відповідні або внутрішні кути з двома іншими, то ті паралельні."
	  },
	  {
		"id": "I.29",
		"bookNumber": 1,
		"propositionNum": 29,
		"type": "theorem",
		"label_en": "A straight line falling on two parallel lines makes alternate angles equal and interior angles supplementary.",
		"label_uk": "Пряма, що перетинає дві паралельні, утворює рівні внутрішні кути і суму внутрішніх кутів, що дорівнює двом прямим."
	  },
	  {
		"id": "I.30",
		"bookNumber": 1,
		"propositionNum": 30,
		"type": "theorem",
		"label_en": "Lines parallel to the same line are parallel to each other.",
		"label_uk": "Прямі, паралельні одній і тій самій прямій, паралельні між собою."
	  },
	  {
		"id": "I.31",
		"bookNumber": 1,
		"propositionNum": 31,
		"type": "construction",
		"label_en": "To draw a straight line through a given point parallel to a given straight line.",
		"label_uk": "Через дану точку провести пряму, паралельну даній прямій."
	  },
	  {
		"id": "I.32",
		"bookNumber": 1,
		"propositionNum": 32,
		"type": "theorem",
		"label_en": "In any triangle, the exterior angle equals the sum of the two opposite interior angles.",
		"label_uk": "У трикутнику зовнішній кут дорівнює сумі двох протилежних внутрішніх."
	  },
	  {
		"id": "I.33",
		"bookNumber": 1,
		"propositionNum": 33,
		"type": "theorem",
		"label_en": "Straight lines joining equal and parallel lines are themselves equal and parallel.",
		"label_uk": "Відрізки, що з’єднують рівні та паралельні прямі, самі рівні й паралельні."
	  },
	  {
		"id": "I.34",
		"bookNumber": 1,
		"propositionNum": 34,
		"type": "theorem",
		"label_en": "Opposite sides and angles of parallelograms are equal, and the diagonals bisect each other.",
		"label_uk": "Протилежні сторони та кути паралелограма рівні, а діагоналі перетинаються навпіл."
	  },
	  {
		"id": "I.35",
		"bookNumber": 1,
		"propositionNum": 35,
		"type": "theorem",
		"label_en": "Parallelograms on the same base and between the same parallels are equal.",
		"label_uk": "Паралелограми на одній основі між одними й тими самими паралелями рівні."
	  },
	  {
		"id": "I.36",
		"bookNumber": 1,
		"propositionNum": 36,
		"type": "theorem",
		"label_en": "Parallelograms on equal bases and between the same parallels are equal.",
		"label_uk": "Паралелограми на рівних основах між одними й тими самими паралелями рівні."
	  },
	  {
		"id": "I.37",
		"bookNumber": 1,
		"propositionNum": 37,
		"type": "theorem",
		"label_en": "Triangles on the same base and between the same parallels are equal.",
		"label_uk": "Трикутники на одній основі між одними й тими самими паралелями рівні."
	  },
	  {
		"id": "I.38",
		"bookNumber": 1,
		"propositionNum": 38,
		"type": "theorem",
		"label_en": "Triangles on equal bases and between the same parallels are equal.",
		"label_uk": "Трикутники на рівних основах між одними й тими самими паралелями рівні."
	  },
	  {
		"id": "I.39",
		"bookNumber": 1,
		"propositionNum": 39,
		"type": "theorem",
		"label_en": "Equal triangles on the same base and same side are between the same parallels.",
		"label_uk": "Рівні трикутники на одній основі й по один бік лежать між одними й тими самими паралелями."
	  },
	  {
		"id": "I.40",
		"bookNumber": 1,
		"propositionNum": 40,
		"type": "theorem",
		"label_en": "Equal triangles on equal bases and on the same side are between the same parallels.",
		"label_uk": "Рівні трикутники на рівних основах і по один бік лежать між одними й тими самими паралелями."
	  },
	  {
		"id": "I.41",
		"bookNumber": 1,
		"propositionNum": 41,
		"type": "theorem",
		"label_en": "If a parallelogram and a triangle are on the same base and between the same parallels, the triangle is half the parallelogram.",
		"label_uk": "Трикутник на тій самій основі й між тими ж паралелями, що й паралелограм, має половину його площі."
	  },
	  {
		"id": "I.42",
		"bookNumber": 1,
		"propositionNum": 42,
		"type": "construction",
		"label_en": "To construct a parallelogram equal to a given triangle in a given angle.",
		"label_uk": "Побудувати паралелограм, рівний даному трикутнику, в заданому куті."
	  },
	  {
		"id": "I.43",
		"bookNumber": 1,
		"propositionNum": 43,
		"type": "theorem",
		"label_en": "In any parallelogram, the complements of the parallelograms about the diagonal are equal.",
		"label_uk": "У паралелограмі паралелограми, доповнення до діагоналі, рівні."
	  },
	  {
		"id": "I.44",
		"bookNumber": 1,
		"propositionNum": 44,
		"type": "construction",
		"label_en": "To construct a parallelogram equal to a given triangle and having one angle equal to a given angle.",
		"label_uk": "Побудувати паралелограм, рівний даному трикутнику, з одним заданим кутом."
	  },
	  {
		"id": "I.45",
		"bookNumber": 1,
		"propositionNum": 45,
		"type": "construction",
		"label_en": "To construct a parallelogram equal to a given rectilinear figure.",
		"label_uk": "Побудувати паралелограм, рівний даній багатокутній фігурі."
	  },
	  {
		"id": "I.46",
		"bookNumber": 1,
		"propositionNum": 46,
		"type": "construction",
		"label_en": "To describe a square on a given straight line.",
		"label_uk": "Описати квадрат на даному відрізку."
	  },
	  {
		"id": "I.47",
		"bookNumber": 1,
		"propositionNum": 47,
		"type": "theorem",
		"label_en": "In right-angled triangles, the square on the hypotenuse equals the sum of the squares on the legs.",
		"label_uk": "У прямокутному трикутнику квадрат гіпотенузи дорівнює сумі квадратів катетів."
	  },
	  {
		"id": "I.48",
		"bookNumber": 1,
		"propositionNum": 48,
		"type": "theorem",
		"label_en": "If the square on one side equals the sum of squares on the other two, the angle is right.",
		"label_uk": "Якщо квадрат однієї сторони дорівнює сумі квадратів двох інших, то кут між ними прямий."
	  },
	  {
		"id": "II.1",
		"bookNumber": 2,
		"propositionNum": 1,
		"type": "theorem",
		"label_en": "If there be two straight lines, and one is cut into any number of segments, the rectangle contained by the two lines is equal to the sum of the rectangles contained by the uncut line and each segment.",
		"label_uk": "Якщо пряму лінію поділити на кілька частин, то добуток її на іншу лінію дорівнює сумі добутків кожної частини на іншу лінію."
	  },
	  {
		"id": "II.2",
		"bookNumber": 2,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "If a straight line be cut into equal and unequal parts, the rectangle contained by the unequal parts, together with the square on the line between the cuts, equals the square on the half.",
		"label_uk": "Якщо пряму поділити навпіл і нерівномірно, то добуток частин плюс квадрат середньої частини дорівнює квадрату половини."
	  },
	  {
		"id": "II.3",
		"bookNumber": 2,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "If a straight line be cut into equal and unequal parts, the sum of the squares on the unequal parts is double the square on the half plus twice the square on the line between the cuts.",
		"label_uk": "Сума квадратів нерівних частин дорівнює подвоєному квадрату половини плюс удвічі квадрат відстані між точками поділу."
	  },
	  {
		"id": "II.4",
		"bookNumber": 2,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "If a straight line be divided at any point, the square on the whole line equals the sum of the squares on the segments plus twice the rectangle contained by them.",
		"label_uk": "Квадрат відрізка дорівнює сумі квадратів його частин плюс подвійний добуток частин."
	  },
	  {
		"id": "II.5",
		"bookNumber": 2,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "If a straight line be cut equally and unequally, the squares on the unequal parts equal twice the square on the half plus twice the square on the difference.",
		"label_uk": "При рівному й нерівному поділі відрізка сума квадратів частин дорівнює подвоєному квадрату половини плюс подвоєний квадрат різниці."
	  },
	  {
		"id": "II.6",
		"bookNumber": 2,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "If a straight line be divided equally and unequally, the rectangle contained by the unequal parts equals the square on the difference between the cuts.",
		"label_uk": "Добуток нерівних частин відрізка дорівнює квадрату різниці між точками поділу."
	  },
	  {
		"id": "II.7",
		"bookNumber": 2,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "If a straight line be cut at random, the square on the whole is equal to the sum of the squares on the parts plus twice the rectangle under the parts.",
		"label_uk": "Якщо пряму розділити довільно, то квадрат її довжини дорівнює сумі квадратів частин плюс подвійний добуток частин."
	  },
	  {
		"id": "II.8",
		"bookNumber": 2,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "If from the ends of a line equal segments be cut on the same side and joined, the square on the connecting line equals the sum of squares on the remaining segments plus twice the rectangle between them.",
		"label_uk": "Якщо на однакових відстанях від кінців відрізка з’єднати точки, то квадрат з’єднувального відрізка дорівнює сумі квадратів залишкових частин плюс подвійний добуток між ними."
	  },
	  {
		"id": "II.9",
		"bookNumber": 2,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "If a right angle triangle has the right angle at the base, the square on the altitude equals the rectangle under the segments into which the base is divided.",
		"label_uk": "У прямокутному трикутнику квадрат висоти дорівнює добутку відрізків, на які вона ділить основу."
	  },
	  {
		"id": "II.10",
		"bookNumber": 2,
		"propositionNum": 10,
		"type": "construction",
		"label_en": "To divide a given straight line so that the rectangle under the whole and one part equals the square on the other part (golden section).",
		"label_uk": "Розділити пряму так, щоб добуток усього відрізка на одну частину дорівнював квадрату іншої (золота пропорція)."
	  },
	  {
		"id": "II.11",
		"bookNumber": 2,
		"propositionNum": 11,
		"type": "construction",
		"label_en": "To cut a given straight line in extreme and mean ratio.",
		"label_uk": "Розділити відрізок у крайній і середній пропорції."
	  },
	  {
		"id": "II.12",
		"bookNumber": 2,
		"propositionNum": 12,
		"type": "theorem",
		"label_en": "If a straight line be cut so that the rectangle under the whole and one part equals the square on the other part, it is divided in extreme and mean ratio.",
		"label_uk": "Якщо добуток усього відрізка на одну частину дорівнює квадрату іншої, то поділ — у крайній і середній пропорції."
	  },
	  {
		"id": "II.13",
		"bookNumber": 2,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "If three straight lines be in continued proportion, the rectangle under the extremes equals the square on the mean.",
		"label_uk": "Якщо три відрізки — у безперервній пропорції, то добуток крайніх дорівнює квадрату середнього."
	  },
	  {
		"id": "II.14",
		"bookNumber": 2,
		"propositionNum": 14,
		"type": "construction",
		"label_en": "To construct a square equal to a given rectilinear figure.",
		"label_uk": "Побудувати квадрат, рівний заданій багатокутній фігурі."
	  },
	  {
		"id": "III.1",
		"bookNumber": 3,
		"propositionNum": 1,
		"type": "theorem",
		"label_en": "A straight line drawn from the center of a circle to bisect a chord not through the center is perpendicular to the chord.",
		"label_uk": "Пряма, проведена з центра кола і яка ділить хорду, що не проходить через центр, навпіл — перпендикулярна до цієї хорди."
	  },
	  {
		"id": "III.2",
		"bookNumber": 3,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "If a straight line drawn through the center of a circle is perpendicular to a chord, it bisects the chord.",
		"label_uk": "Якщо пряма, проведена через центр кола, перпендикулярна до хорди, то вона ділить її навпіл."
	  },
	  {
		"id": "III.3",
		"bookNumber": 3,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "If two chords in a circle are unequal, the greater is nearer the center.",
		"label_uk": "У колі більша хорда розташована ближче до центра."
	  },
	  {
		"id": "III.4",
		"bookNumber": 3,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "If two chords are unequally distant from the center, the chord nearer the center is greater.",
		"label_uk": "Хорда, ближча до центра, більша за ту, що далі від центра."
	  },
	  {
		"id": "III.5",
		"bookNumber": 3,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "Equal chords in a circle are equally distant from the center.",
		"label_uk": "У колі рівні хорди однаково віддалені від центра."
	  },
	  {
		"id": "III.6",
		"bookNumber": 3,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "Chords equally distant from the center are equal.",
		"label_uk": "Хорди, що однаково віддалені від центра, рівні."
	  },
	  {
		"id": "III.7",
		"bookNumber": 3,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "If a point is within a circle, the straight line drawn to the circumference is less than the diameter.",
		"label_uk": "Від будь-якої точки всередині кола відстань до кола менша за діаметр."
	  },
	  {
		"id": "III.8",
		"bookNumber": 3,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "If a point is outside a circle, the straight lines drawn from it that cut the circle are longer than those that do not.",
		"label_uk": "Від точки поза колом хорди більші, ніж дотичні до кола з тієї ж точки."
	  },
	  {
		"id": "III.9",
		"bookNumber": 3,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "If a point is outside a circle, the straight line drawn from it that cuts the circle and passes through the center is the greatest.",
		"label_uk": "Із точки поза колом найдовша хорда — та, що проходить через центр кола."
	  },
	  {
		"id": "III.10",
		"bookNumber": 3,
		"propositionNum": 10,
		"type": "theorem",
		"label_en": "A circle is bisected by the diameter.",
		"label_uk": "Коло ділиться навпіл діаметром."
	  },
	  {
		"id": "III.11",
		"bookNumber": 3,
		"propositionNum": 11,
		"type": "theorem",
		"label_en": "In a circle, equal angles stand on equal arcs, whether at the center or the circumference.",
		"label_uk": "У колі рівні кути спираються на рівні дуги — і в центрі, і на колі."
	  },
	  {
		"id": "III.12",
		"bookNumber": 3,
		"propositionNum": 12,
		"type": "theorem",
		"label_en": "In a circle, equal arcs subtend equal angles at the center.",
		"label_uk": "У колі рівні дуги відповідають рівним центральним кутам."
	  },
	  {
		"id": "III.13",
		"bookNumber": 3,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "The angle in a semicircle is a right angle.",
		"label_uk": "Кут, вписаний у півколо, — прямий."
	  },
	  {
		"id": "III.14",
		"bookNumber": 3,
		"propositionNum": 14,
		"type": "theorem",
		"label_en": "The angles in the same segment of a circle are equal.",
		"label_uk": "Кути, вписані в одну й ту саму дугу кола, рівні."
	  },
	  {
		"id": "III.15",
		"bookNumber": 3,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "The opposite angles of quadrilaterals in circles sum to two right angles.",
		"label_uk": "Сума протилежних кутів вписаного чотирикутника дорівнює двом прямим кутам."
	  },
	  {
		"id": "III.16",
		"bookNumber": 3,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "The angle between the tangent and chord through the point of contact equals the angle in the alternate segment.",
		"label_uk": "Кут між дотичною і хордою дорівнює куту в протилежному сегменті."
	  },
	  {
		"id": "III.17",
		"bookNumber": 3,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "If two chords intersect in a circle, the rectangle under their segments are equal.",
		"label_uk": "Якщо хорди перетинаються всередині кола, добутки відрізків рівні."
	  },
	  {
		"id": "III.18",
		"bookNumber": 3,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "A tangent to a circle is perpendicular to the radius at the point of contact.",
		"label_uk": "Дотична до кола перпендикулярна до радіуса в точці дотику."
	  },
	  {
		"id": "III.19",
		"bookNumber": 3,
		"propositionNum": 19,
		"type": "theorem",
		"label_en": "If a straight line touches a circle and from the point of contact a line is drawn cutting the circle, then the angle between the line and the chord equals the angle in the alternate segment.",
		"label_uk": "Якщо пряма дотикається до кола, а з точки дотику проведено хорду, то утворений кут дорівнює куту в протилежному сегменті."
	  },
	  {
		"id": "III.20",
		"bookNumber": 3,
		"propositionNum": 20,
		"type": "theorem",
		"label_en": "The center of a circle lies on the perpendicular bisector of any chord.",
		"label_uk": "Центр кола лежить на серединному перпендикулярі до будь-якої хорди."
	  },
	  {
		"id": "III.21",
		"bookNumber": 3,
		"propositionNum": 21,
		"type": "construction",
		"label_en": "To draw a circle through three given non-collinear points.",
		"label_uk": "Провести коло через три дані точки, що не лежать на одній прямій."
	  },
	  {
		"id": "III.22",
		"bookNumber": 3,
		"propositionNum": 22,
		"type": "theorem",
		"label_en": "If two circles touch externally, the straight line through their centers passes through the point of contact.",
		"label_uk": "Якщо два кола дотикаються зовні, пряма через їх центри проходить через точку дотику."
	  },
	  {
		"id": "III.23",
		"bookNumber": 3,
		"propositionNum": 23,
		"type": "theorem",
		"label_en": "In circles that touch internally, the line through centers passes through point of contact.",
		"label_uk": "Для внутрішнього дотику двох кіл пряма центрів проходить через точку дотику."
	  },
	  {
		"id": "III.24" ,
		"bookNumber": 3,
		"propositionNum": 24,
		"type": "construction",
		"label_en": "To construct a circle tangent to three given circles.",
		"label_uk": "Побудувати коло, що дотикається до трьох заданих кіл."
	  },
	  {
		"id": "III.25",
		"bookNumber": 3,
		"propositionNum": 25,
		"type": "theorem",
		"label_en": "A circle cannot intersect a straight line in more than two points.",
		"label_uk": "Коло не може перетинати пряму більш ніж у двох точках."
	  },
	  {
		"id": "III.26",
		"bookNumber": 3,
		"propositionNum": 26,
		"type": "theorem",
		"label_en": "A circle cannot intersect another circle in more than two points.",
		"label_uk": "Коло не може перетинати інше коло більш ніж у двох точках."
	  },
	  {
		"id": "III.27",
		"bookNumber": 3,
		"propositionNum": 27,
		"type": "theorem",
		"label_en": "If two circles intersect, the straight line joining their centers bisects their common chord at right angles.",
		"label_uk": "Пряма, що з'єднує центри двох коліс, які перетинаються, перпендикулярно ділить спільну хорду навпіл."
	  },
	  {
		"id": "III.28",
		"bookNumber": 3,
		"propositionNum": 28,
		"type": "theorem",
		"label_en": "On a given line segment, to describe a segment of a circle containing an angle equal to a given angle.",
		"label_uk": "На даному відрізку описати дугу, яка містить заданий кут."
	  },
	  {
		"id": "III.29",
		"bookNumber": 3,
		"propositionNum": 29,
		"type": "theorem",
		"label_en": "To describe a segment of a circle on a given line which shall contain an angle equal to a given angle.",
		"label_uk": "Описати сегмент кола на відрізку, що містить заданий кут."
	  },
	  {
		"id": "III.30",
		"bookNumber": 3,
		"propositionNum": 30,
		"type": "theorem",
		"label_en": "To bisect a given circular arc.",
		"label_uk": "Поділити дану дугу кола навпіл."
	  },
	  {
		"id": "III.31",
		"bookNumber": 3,
		"propositionNum": 31,
		"type": "construction",
		"label_en": "To draw a tangent to a given circle from a point outside it.",
		"label_uk": "Провести дотичну до кола з точки поза ним."
	  },
	  {
		"id": "III.32",
		"bookNumber": 3,
		"propositionNum": 32,
		"type": "theorem",
		"label_en": "If a line touches a circle and a straight line be drawn from the center to the point of contact, it is perpendicular.",
		"label_uk": "Дотична до кола перпендикулярна до прямої, що з'єднує точку дотику з центром."
	  },
	  {
		"id": "III.33",
		"bookNumber": 3,
		"propositionNum": 33,
		"type": "theorem",
		"label_en": "Two tangents drawn to a circle from the same point outside are equal in length.",
		"label_uk": "Дві дотичні до кола з однієї точки поза ним рівні."
	  },
	  {
		"id": "III.34",
		"bookNumber": 3,
		"propositionNum": 34,
		"type": "theorem",
		"label_en": "If from a point a straight line cuts a circle and a tangent is drawn, the rectangle under the full line and its external segment equals the square on the tangent.",
		"label_uk": "Якщо пряма перетинає коло і проведено дотичну з тієї ж точки, то добуток всієї січної і зовнішньої частини дорівнює квадрату дотичної."
	  },
	  {
		"id": "III.35",
		"bookNumber": 3,
		"propositionNum": 35,
		"type": "theorem",
		"label_en": "If two chords cut one another, the rectangle contained by the segments of one equals the rectangle contained by the segments of the other.",
		"label_uk": "Добутки частин хорд, що перетинаються, рівні."
	  },
	  {
		"id": "III.36",
		"bookNumber": 3,
		"propositionNum": 36,
		"type": "theorem",
		"label_en": "If from a point outside a circle, two lines are drawn, one cutting and one touching, the rectangle under the full secant and external part equals the square on the tangent.",
		"label_uk": "Зовнішній добуток січної дорівнює квадрату дотичної, проведених з однієї точки."
	  },
	  {
		"id": "III.37",
		"bookNumber": 3,
		"propositionNum": 37,
		"type": "theorem",
		"label_en": "If a point be taken outside a circle and a line be drawn from it to meet the circle in two points, the rectangle under the whole and external segment equals the square on the tangent drawn from the point.",
		"label_uk": "Добуток всієї січної і її зовнішньої частини дорівнює квадрату дотичної."
	  },
	  {
		"id": "IV.1",
		"bookNumber": 4,
		"propositionNum": 1,
		"type": "construction",
		"label_en": "In a given circle, to place a straight line equal to a given straight line which is not greater than the diameter.",
		"label_uk": "У даному колі відкласти відрізок, рівний даному, що не перевищує діаметр."
	  },
	  {
		"id": "IV.2",
		"bookNumber": 4,
		"propositionNum": 2,
		"type": "construction",
		"label_en": "In a given circle, to inscribe a triangle equiangular to a given triangle.",
		"label_uk": "Уписати в дане коло трикутник, подібний до даного."
	  },
	  {
		"id": "IV.3",
		"bookNumber": 4,
		"propositionNum": 3,
		"type": "construction",
		"label_en": "About a given circle, to circumscribe a triangle equiangular to a given triangle.",
		"label_uk": "Описати навколо даного кола трикутник, подібний до даного."
	  },
	  {
		"id": "IV.4",
		"bookNumber": 4,
		"propositionNum": 4,
		"type": "construction",
		"label_en": "To inscribe a circle in a given triangle.",
		"label_uk": "Уписати коло в даний трикутник."
	  },
	  {
		"id": "IV.5",
		"bookNumber": 4,
		"propositionNum": 5,
		"type": "construction",
		"label_en": "To circumscribe a circle about a given triangle.",
		"label_uk": "Описати коло навколо даного трикутника."
	  },
	  {
		"id": "IV.6",
		"bookNumber": 4,
		"propositionNum": 6,
		"type": "construction",
		"label_en": "To inscribe a square in a given circle.",
		"label_uk": "Уписати квадрат у дане коло."
	  },
	  {
		"id": "IV.7",
		"bookNumber": 4,
		"propositionNum": 7,
		"type": "construction",
		"label_en": "To circumscribe a square about a given circle.",
		"label_uk": "Описати квадрат навколо даного кола."
	  },
	  {
		"id": "IV.8",
		"bookNumber": 4,
		"propositionNum": 8,
		"type": "construction",
		"label_en": "To inscribe a regular hexagon in a given circle.",
		"label_uk": "Уписати правильний шестикутник у дане коло."
	  },
	  {
		"id": "IV.9",
		"bookNumber": 4,
		"propositionNum": 9,
		"type": "construction",
		"label_en": "To circumscribe a regular hexagon about a given circle.",
		"label_uk": "Описати правильний шестикутник навколо даного кола."
	  },
	  {
		"id": "IV.10",
		"bookNumber": 4,
		"propositionNum": 10,
		"type": "construction",
		"label_en": "To inscribe an equilateral and equiangular pentagon in a given circle.",
		"label_uk": "Уписати правильний п’ятикутник у дане коло."
	  },
	  {
		"id": "IV.11",
		"bookNumber": 4,
		"propositionNum": 11,
		"type": "construction",
		"label_en": "To circumscribe an equilateral and equiangular pentagon about a given circle.",
		"label_uk": "Описати правильний п’ятикутник навколо даного кола."
	  },
	  {
		"id": "IV.12",
		"bookNumber": 4,
		"propositionNum": 12,
		"type": "construction",
		"label_en": "To inscribe an equilateral and equiangular hexagon in a given circle.",
		"label_uk": "Уписати правильний шестикутник у дане коло."
	  },
	  {
		"id": "IV.13",
		"bookNumber": 4,
		"propositionNum": 13,
		"type": "construction",
		"label_en": "To inscribe a circle in a given equilateral and equiangular pentagon.",
		"label_uk": "Уписати коло в правильний п’ятикутник."
	  },
	  {
		"id": "IV.14",
		"bookNumber": 4,
		"propositionNum": 14,
		"type": "construction",
		"label_en": "To circumscribe a circle about a given equilateral and equiangular pentagon.",
		"label_uk": "Описати коло навколо правильного п’ятикутника."
	  },
	  {
		"id": "IV.15",
		"bookNumber": 4,
		"propositionNum": 15,
		"type": "construction",
		"label_en": "To inscribe an equilateral and equiangular fifteen-angled figure in a given circle.",
		"label_uk": "Уписати правильний п’ятнадцятикутник у дане коло."
	  },
	  {
		"id": "IV.16",
		"bookNumber": 4,
		"propositionNum": 16,
		"type": "construction",
		"label_en": "To inscribe an equilateral and equiangular polygon of any number of sides in a given circle.",
		"label_uk": "Уписати в дане коло правильний багатокутник із будь-якою кількістю сторін."
	  },
	  {
		"id": "V.1",
		"bookNumber": 5,
		"propositionNum": 1,
		"type": "theorem",
		"label_en": "If two magnitudes be each equal to a third, they are equal to one another.",
		"label_uk": "Якщо дві величини дорівнюють третій, то вони рівні між собою."
	  },
	  {
		"id": "V.2",
		"bookNumber": 5,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "If equals be added to equals, the wholes are equal.",
		"label_uk": "Якщо до рівних додати рівні, то й суми будуть рівні."
	  },
	  {
		"id": "V.3",
		"bookNumber": 5,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "If equals be taken from equals, the remainders are equal.",
		"label_uk": "Якщо від рівних відняти рівні, то залишки рівні."
	  },
	  {
		"id": "V.4",
		"bookNumber": 5,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "If equals be added to unequals, the wholes are unequal.",
		"label_uk": "Якщо до нерівних додати рівні, то суми будуть нерівні."
	  },
	  {
		"id": "V.5",
		"bookNumber": 5,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "If equals be taken from unequals, the remainders are unequal.",
		"label_uk": "Якщо від нерівних відняти рівні, то залишки будуть нерівні."
	  },
	  {
		"id": "V.6",
		"bookNumber": 5,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "Magnitudes which have the same ratio to the same magnitude are equal.",
		"label_uk": "Величини, які мають однакове відношення до однієї й тієї самої величини, рівні."
	  },
	  {
		"id": "V.7",
		"bookNumber": 5,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "If a magnitude have the same ratio to two magnitudes, these are equal.",
		"label_uk": "Якщо одна величина має однакове відношення до двох інших, то ті дві величини рівні."
	  },
	  {
		"id": "V.8",
		"bookNumber": 5,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "If equals be multiplied by equals, the results are equal.",
		"label_uk": "Добутки рівних величин дорівнюють один одному."
	  },
	  {
		"id": "V.9",
		"bookNumber": 5,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "Magnitudes which are equimultiples of the same are equal to one another.",
		"label_uk": "Величини, що є однаковими кратами однієї й тієї самої, рівні між собою."
	  },
	  {
		"id": "V.10",
		"bookNumber": 5,
		"propositionNum": 10,
		"type": "theorem",
		"label_en": "That magnitude which is the greater when compared to another is the greater of the two.",
		"label_uk": "Яка з величин більша за іншу, та більша."
	  },
	  {
		"id": "V.11",
		"bookNumber": 5,
		"propositionNum": 11,
		"type": "theorem",
		"label_en": "Magnitudes which have the same ratio are proportional.",
		"label_uk": "Величини, які мають однакове відношення, пропорційні."
	  },
	  {
		"id": "V.12",
		"bookNumber": 5,
		"propositionNum": 12,
		"type": "theorem",
		"label_en": "If four magnitudes be proportional, they are also proportional alternately.",
		"label_uk": "Якщо чотири величини пропорційні, то вони пропорційні і поперемінно."
	  },
	  {
		"id": "V.13",
		"bookNumber": 5,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "If four magnitudes be proportional, they are proportional also by permutation.",
		"label_uk": "Пропорційні величини залишаються пропорційними при переставленні."
	  },
	  {
		"id": "V.14",
		"bookNumber": 5,
		"propositionNum": 14,
		"type": "theorem",
		"label_en": "If four magnitudes be proportional, they are also proportional by inversion.",
		"label_uk": "Пропорції зберігаються при обертанні відношень."
	  },
	  {
		"id": "V.15",
		"bookNumber": 5,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "If four magnitudes be proportional, they are also proportional componendo.",
		"label_uk": "Пропорції зберігаються при складанні чисельників і знаменників."
	  },
	  {
		"id": "V.16",
		"bookNumber": 5,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "If four magnitudes be proportional, they are also proportional dividendo.",
		"label_uk": "Пропорції зберігаються при відніманні знаменника з чисельника."
	  },
	  {
		"id": "V.17",
		"bookNumber": 5,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "If four magnitudes be proportional, they are also proportional convertendo.",
		"label_uk": "Пропорції зберігаються при переставленні частин у зворотному порядку."
	  },
	  {
		"id": "V.18",
		"bookNumber": 5,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "If four magnitudes be proportional, they are also proportional ex aequali.",
		"label_uk": "Пропорційність зберігається при сполученні послідовних відношень."
	  },
	  {
		"id": "V.19",
		"bookNumber": 5,
		"propositionNum": 19,
		"type": "theorem",
		"label_en": "If four magnitudes are such that the first has to the second the same ratio as the third has to the fourth, and so on, then the compound ratio of the first to the last is the ratio compounded of all the intermediate ratios.",
		"label_uk": "Складене відношення кількох величин дорівнює добутку окремих відношень між ними."
	  },
	  {
		"id": "V.20",
		"bookNumber": 5,
		"propositionNum": 20,
		"type": "theorem",
		"label_en": "If two magnitudes have to two others the same ratio respectively, then the sum of the first and third has to the sum of the second and fourth the same ratio.",
		"label_uk": "Якщо дві величини мають однакові відношення до інших двох, то сума перших має те ж відношення до суми других."
	  },
	  {
		"id": "V.21",
		"bookNumber": 5,
		"propositionNum": 21,
		"type": "theorem",
		"label_en": "If three magnitudes be proportional, the first is to the third as the square on the first is to the square on the second.",
		"label_uk": "Якщо три величини пропорційні, то перша до третьої як квадрат першої до квадрата другої."
	  },
	  {
		"id": "V.22",
		"bookNumber": 5,
		"propositionNum": 22,
		"type": "theorem",
		"label_en": "The ratio of the first magnitude to the last of three is equal to the product of the ratios of the first to the second and of the second to the third.",
		"label_uk": "Відношення першої величини до третьої дорівнює добутку відношень першої до другої і другої до третьої."
	  },
	  {
		"id": "V.23",
		"bookNumber": 5,
		"propositionNum": 23,
		"type": "theorem",
		"label_en": "The same ratio holds between magnitudes that are equimultiples of others having the same ratio.",
		"label_uk": "Якщо величини мають однакове кратне до інших, то й відношення зберігається."
	  },
	  {
		"id": "V.24",
		"bookNumber": 5,
		"propositionNum": 24,
		"type": "theorem",
		"label_en": "If four magnitudes be proportional, the like powers or roots are also proportional.",
		"label_uk": "Якщо чотири величини пропорційні, то й однакові ступені чи корені цих величин пропорційні."
	  },
	  {
		"id": "V.25",
		"bookNumber": 5,
		"propositionNum": 25,
		"type": "theorem",
		"label_en": "If four magnitudes be proportional, their inverses are also proportional.",
		"label_uk": "Якщо чотири величини пропорційні, то й їх обернені пропорційні."
	  },
	  {
		"id": "VI.1",
		"bookNumber": 6,
		"propositionNum": 1,
		"type": "theorem",
		"label_en": "Triangles and parallelograms under the same height are to one another as their bases.",
		"label_uk": "Трикутники й паралелограми на одній висоті відносяться один до одного як їх основи."
	  },
	  {
		"id": "VI.2",
		"bookNumber": 6,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "If a straight line is drawn parallel to one side of a triangle, it cuts the other two sides proportionally.",
		"label_uk": "Якщо в трикутнику провести пряму, паралельну одній зі сторін, то вона поділить дві інші пропорційно."
	  },
	  {
		"id": "VI.3",
		"bookNumber": 6,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "If two triangles have one angle equal and the sides about the equal angles proportional, they are equiangular.",
		"label_uk": "Якщо два трикутники мають рівний кут, і прилеглі сторони пропорційні, то трикутники подібні."
	  },
	  {
		"id": "VI.4",
		"bookNumber": 6,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "In equiangular triangles, the sides about the equal angles are proportional, and those triangles are similar.",
		"label_uk": "У рівнокутних трикутниках сторони при рівних кутах пропорційні — такі трикутники подібні."
	  },
	  {
		"id": "VI.5",
		"bookNumber": 6,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "If two triangles have their sides proportional, they are equiangular and similar.",
		"label_uk": "Якщо сторони двох трикутників пропорційні, то трикутники рівнокутні і подібні."
	  },
	  {
		"id": "VI.6",
		"bookNumber": 6,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "If two triangles have one angle equal and the sides about the angles proportional, they are similar.",
		"label_uk": "Якщо два трикутники мають рівний кут і прилеглі сторони пропорційні — вони подібні."
	  },
	  {
		"id": "VI.7",
		"bookNumber": 6,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "If two triangles are equiangular, their corresponding sides are proportional.",
		"label_uk": "У рівнокутних трикутниках відповідні сторони пропорційні."
	  },
	  {
		"id": "VI.8",
		"bookNumber": 6,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "In equiangular triangles, the areas are in the ratio of the squares on corresponding sides.",
		"label_uk": "Площі рівнокутних трикутників відносяться як квадрати відповідних сторін."
	  },
	  {
		"id": "VI.9",
		"bookNumber": 6,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "If a triangle has a right angle and another triangle is equiangular with it, their sides are in proportion and areas in the ratio of squares.",
		"label_uk": "Якщо прямокутний трикутник подібний до іншого, то їх площі — як квадрати відповідних сторін."
	  },
	  {
		"id": "VI.10",
		"bookNumber": 6,
		"propositionNum": 10,
		"type": "theorem",
		"label_en": "To divide a given straight line in a given ratio.",
		"label_uk": "Розділити даний відрізок у заданому відношенні."
	  },
	  {
		"id": "VI.11",
		"bookNumber": 6,
		"propositionNum": 11,
		"type": "construction",
		"label_en": "To cut off from a given straight line a part proportional to a given line.",
		"label_uk": "Відкласти на даному відрізку частину, пропорційну іншому відрізку."
	  },
	  {
		"id": "VI.12",
		"bookNumber": 6,
		"propositionNum": 12,
		"type": "construction",
		"label_en": "To apply to a given straight line a parallelogram equal to a given triangle and falling short by a parallelogram similar to a given one.",
		"label_uk": "На даному відрізку побудувати паралелограм, рівний даному трикутнику, зі зменшенням на подібний паралелограм."
	  },
	  {
		"id": "VI.13",
		"bookNumber": 6,
		"propositionNum": 13,
		"type": "construction",
		"label_en": "To apply to a given straight line a parallelogram equal to a given triangle and exceeding by one similar to a given.",
		"label_uk": "На даному відрізку побудувати паралелограм, більший за даний трикутник на подібну фігуру."
	  },
	  {
		"id": "VI.14",
		"bookNumber": 6,
		"propositionNum": 14,
		"type": "construction",
		"label_en": "To construct a square equal to a given rectilinear figure.",
		"label_uk": "Побудувати квадрат, рівний даній фігурі."
	  },
	  {
		"id": "VI.15",
		"bookNumber": 6,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "In right-angled triangles, the altitude to the hypotenuse divides the triangle into two similar triangles.",
		"label_uk": "У прямокутному трикутнику висота на гіпотенузу розбиває його на два подібні трикутники."
	  },
	  {
		"id": "VI.16",
		"bookNumber": 6,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "The perpendicular drawn from the right angle to the hypotenuse in a right triangle is mean proportional between the segments of the hypotenuse.",
		"label_uk": "Перпендикуляр з прямого кута до гіпотенузи — середнє пропорційне між частинами гіпотенузи."
	  },
	  {
		"id": "VI.17",
		"bookNumber": 6,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "The altitude from the right angle divides the triangle into two similar triangles, and each is similar to the original.",
		"label_uk": "Висота з прямого кута ділить трикутник на два трикутники, подібні до початкового."
	  },
	  {
		"id": "VI.18",
		"bookNumber": 6,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "The square on a line drawn perpendicular from a right angle equals the product of the two segments of the hypotenuse.",
		"label_uk": "Квадрат висоти з прямого кута дорівнює добутку частин гіпотенузи."
	  },
	  {
		"id": "VI.19",
		"bookNumber": 6,
		"propositionNum": 19,
		"type": "theorem",
		"label_en": "In a right-angled triangle, the altitude is mean proportional between the projections of the legs.",
		"label_uk": "У прямокутному трикутнику висота — середнє пропорційне між проекціями катетів."
	  },
	  {
		"id": "VI.20",
		"bookNumber": 6,
		"propositionNum": 20,
		"type": "theorem",
		"label_en": "To construct a rectangle equal to a given square and having one side equal to a given line.",
		"label_uk": "Побудувати прямокутник, рівний даному квадрату, з однією заданою стороною."
	  },
	  {
		"id": "VI.21",
		"bookNumber": 6,
		"propositionNum": 21,
		"type": "theorem",
		"label_en": "To divide a given line so that the rectangle under its parts equals a given rectangle.",
		"label_uk": "Розділити відрізок так, щоб добуток частин дорівнював даному прямокутнику."
	  },
	  {
		"id": "VI.22",
		"bookNumber": 6,
		"propositionNum": 22,
		"type": "construction",
		"label_en": "To construct a square equal to the sum of two given squares.",
		"label_uk": "Побудувати квадрат, рівний сумі двох даних квадратів."
	  },
	  {
		"id": "VI.23",
		"bookNumber": 6,
		"propositionNum": 23,
		"type": "construction",
		"label_en": "To construct a square equal to the difference of two given squares.",
		"label_uk": "Побудувати квадрат, рівний різниці двох даних квадратів."
	  },
	  {
		"id": "VI.24",
		"bookNumber": 6,
		"propositionNum": 24,
		"type": "construction",
		"label_en": "To construct a square equal to a given rectangle.",
		"label_uk": "Побудувати квадрат, рівний даному прямокутнику."
	  },
	  {
		"id": "VI.25",
		"bookNumber": 6,
		"propositionNum": 25,
		"type": "construction",
		"label_en": "To construct a rectangle equal to the difference of two given rectangles.",
		"label_uk": "Побудувати прямокутник, рівний різниці двох даних прямокутників."
	  },
	  {
		"id": "VI.26",
		"bookNumber": 6,
		"propositionNum": 26,
		"type": "construction",
		"label_en": "To apply to a given line a rectangle equal to a given square, exceeding by a rectangle similar to a given one.",
		"label_uk": "На даному відрізку побудувати прямокутник, рівний квадрату, з перевищенням на подібний прямокутник."
	  },
	  {
		"id": "VI.27",
		"bookNumber": 6,
		"propositionNum": 27,
		"type": "construction",
		"label_en": "To apply to a given line a rectangle equal to a given square, falling short by a rectangle similar to a given one.",
		"label_uk": "На відрізку побудувати прямокутник, менший від даного квадрата на подібну фігуру."
	  },
	  {
		"id": "VI.28",
		"bookNumber": 6,
		"propositionNum": 28,
		"type": "construction",
		"label_en": "To construct a square equal to a given rectangle, with a side equal to a given line.",
		"label_uk": "Побудувати квадрат, рівний прямокутнику, з заданою стороною."
	  },
	  {
		"id": "VI.29",
		"bookNumber": 6,
		"propositionNum": 29,
		"type": "theorem",
		"label_en": "In any triangle, if a line is drawn parallel to one side, the triangle is divided into two similar triangles.",
		"label_uk": "У трикутнику, якщо провести пряму, паралельну стороні, отримуємо два подібні трикутники."
	  },
	  {
		"id": "VI.30",
		"bookNumber": 6,
		"propositionNum": 30,
		"type": "theorem",
		"label_en": "To cut a given straight line in extreme and mean ratio.",
		"label_uk": "Розділити відрізок у крайній і середній пропорції."
	  },
	  {
		"id": "VI.31",
		"bookNumber": 6,
		"propositionNum": 31,
		"type": "theorem",
		"label_en": "In a right-angled triangle, the rectangle under the legs equals the rectangle under the hypotenuse and the altitude.",
		"label_uk": "У прямокутному трикутнику добуток катетів дорівнює добутку гіпотенузи й висоти."
	  },
	  {
		"id": "VI.32",
		"bookNumber": 6,
		"propositionNum": 32,
		"type": "theorem",
		"label_en": "In a triangle, the square on a side equals the rectangle under the projections plus the square on the altitude.",
		"label_uk": "Квадрат сторони трикутника дорівнює сумі добутку проєкцій та квадрату висоти."
	  },
	  {
		"id": "VI.33",
		"bookNumber": 6,
		"propositionNum": 33,
		"type": "theorem",
		"label_en": "To describe a figure similar and similarly situated to a given rectilinear figure on a given straight line.",
		"label_uk": "Описати на даному відрізку фігуру, подібну й подібно розташовану до даної."
	  },
	  {
		"id": "VII.1",
		"bookNumber": 7,
		"propositionNum": 1,
		"type": "definition",
		"label_en": "Two numbers are said to measure one another if the greater is a multiple of the lesser.",
		"label_uk": "Два числа ділять одне одного, якщо більше є кратним меншому."
	  },
	  {
		"id": "VII.2",
		"bookNumber": 7,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "If a number is a part of another, then the smaller measures the greater.",
		"label_uk": "Якщо число є частиною іншого, то менше ділить більше."
	  },
	  {
		"id": "VII.3",
		"bookNumber": 7,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "If the same number measures two numbers, it also measures their sum.",
		"label_uk": "Якщо те саме число ділить два числа, то воно ділить і їх суму."
	  },
	  {
		"id": "VII.4",
		"bookNumber": 7,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "If a number measures two numbers, it also measures their difference.",
		"label_uk": "Якщо число ділить два числа, то воно ділить і їх різницю."
	  },
	  {
		"id": "VII.5",
		"bookNumber": 7,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "If two numbers are each measured by a number, then their sum is also measured by it.",
		"label_uk": "Якщо обидва числа ділить певне число, то воно ділить і їхню суму."
	  },
	  {
		"id": "VII.6",
		"bookNumber": 7,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "If a number is a part of a second and the second of a third, then the first is a part of the third.",
		"label_uk": "Якщо одне число є частиною другого, а друге — третього, то перше є частиною третього."
	  },
	  {
		"id": "VII.7",
		"bookNumber": 7,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "If two numbers have no common measure, they are called relatively prime.",
		"label_uk": "Якщо два числа не мають спільного дільника, вони називаються взаємно простими."
	  },
	  {
		"id": "VII.8",
		"bookNumber": 7,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "If two numbers are both divisible by a third number, then the greatest common measure can be found by subtraction.",
		"label_uk": "Якщо два числа діляться на третє, то найбільший спільний дільник можна знайти через віднімання."
	  },
	  {
		"id": "VII.9",
		"bookNumber": 7,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "If a number is relatively prime to each of two numbers, it is also relatively prime to their sum.",
		"label_uk": "Якщо число є взаємно простим з двома іншими, то воно також взаємно просте з їхньою сумою."
	  },
	  {
		"id": "VII.10",
		"bookNumber": 7,
		"propositionNum": 10,
		"type": "definition",
		"label_en": "A number is said to be prime when it is measured by a unit alone.",
		"label_uk": "Число називається простим, якщо воно ділиться лише на одиницю та на себе."
	  },
	  {
		"id": "VII.11",
		"bookNumber": 7,
		"propositionNum": 11,
		"type": "theorem",
		"label_en": "To find the greatest common measure of two numbers that are not prime to one another.",
		"label_uk": "Знайти найбільший спільний дільник двох чисел, які не є взаємно простими."
	  },
	  {
		"id": "VII.12",
		"bookNumber": 7,
		"propositionNum": 12,
		"type": "theorem",
		"label_en": "To find the least common multiple of two numbers.",
		"label_uk": "Знайти найменше спільне кратне двох чисел."
	  },
	  {
		"id": "VII.13",
		"bookNumber": 7,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "If a number measures two numbers, it also measures their sum and difference.",
		"label_uk": "Якщо число ділить два числа, воно ділить і їх суму та різницю."
	  },
	  {
		"id": "VII.14",
		"bookNumber": 7,
		"propositionNum": 14,
		"type": "theorem",
		"label_en": "If a number be a part of another number, it measures the whole.",
		"label_uk": "Якщо число є частиною іншого, то воно ділить це число."
	  },
	  {
		"id": "VII.15",
		"bookNumber": 7,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "To show that any number is a multiple of a unit.",
		"label_uk": "Показати, що будь-яке число є кратним одиниці."
	  },
	  {
		"id": "VII.16",
		"bookNumber": 7,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "If a number is a multiple of each of two numbers, it is a multiple of their least common multiple.",
		"label_uk": "Якщо число кратне кожному з двох чисел, то воно кратне їх найменшому спільному кратному."
	  },
	  {
		"id": "VII.17",
		"bookNumber": 7,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "If a number divides the product of two numbers and is relatively prime to one of them, it divides the other.",
		"label_uk": "Якщо число ділить добуток двох чисел і взаємно просте з одним з них, то воно ділить інше."
	  },
	  {
		"id": "VII.18",
		"bookNumber": 7,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "If two numbers measure another number, then their least common multiple also measures it.",
		"label_uk": "Якщо два числа ділять третє, то й їх найменше спільне кратне також його ділить."
	  },
	  {
		"id": "VII.19",
		"bookNumber": 7,
		"propositionNum": 19,
		"type": "theorem",
		"label_en": "To find the least number that is divisible by two given numbers.",
		"label_uk": "Знайти найменше число, що ділиться на два заданих."
	  },
	  {
		"id": "VII.20",
		"bookNumber": 7,
		"propositionNum": 20,
		"type": "theorem",
		"label_en": "If a number is a multiple of two numbers, it is also a multiple of their least common multiple.",
		"label_uk": "Якщо число кратне двом іншим, воно кратне і їх найменшому спільному кратному."
	  },
	  {
		"id": "VII.21",
		"bookNumber": 7,
		"propositionNum": 21,
		"type": "theorem",
		"label_en": "Numbers prime to each other are the least in their ratio.",
		"label_uk": "Взаємно прості числа — найменші у своєму відношенні."
	  },
	  {
		"id": "VII.22",
		"bookNumber": 7,
		"propositionNum": 22,
		"type": "theorem",
		"label_en": "The least numbers of the same ratio as given numbers are prime to each other.",
		"label_uk": "Найменші числа в тому ж відношенні — взаємно прості."
	  },
	  {
		"id": "VII.23",
		"bookNumber": 7,
		"propositionNum": 23,
		"type": "theorem",
		"label_en": "If four numbers are proportional, the product of the extremes equals the product of the means.",
		"label_uk": "Якщо чотири числа пропорційні, то добуток крайніх дорівнює добутку середніх."
	  },
	  {
		"id": "VII.24",
		"bookNumber": 7,
		"propositionNum": 24,
		"type": "theorem",
		"label_en": "If the product of the extremes equals the product of the means, the numbers are proportional.",
		"label_uk": "Якщо добутки крайніх і середніх рівні, то числа пропорційні."
	  },
	  {
		"id": "VII.25",
		"bookNumber": 7,
		"propositionNum": 25,
		"type": "theorem",
		"label_en": "To find the least numbers in the same ratio as any given numbers.",
		"label_uk": "Знайти найменші числа, які мають те саме відношення, що й задані."
	  },
	  {
		"id": "VII.26",
		"bookNumber": 7,
		"propositionNum": 26,
		"type": "theorem",
		"label_en": "If two numbers be prime to one another, their least common multiple is their product.",
		"label_uk": "Якщо два числа взаємно прості, то їх найменше спільне кратне — їхній добуток."
	  },
	  {
		"id": "VII.27",
		"bookNumber": 7,
		"propositionNum": 27,
		"type": "theorem",
		"label_en": "If a number divides the sum of two others and is prime to one, it divides the other.",
		"label_uk": "Якщо число ділить суму двох чисел і взаємно просте з одним із них, воно ділить інше."
	  },
	  {
		"id": "VII.28",
		"bookNumber": 7,
		"propositionNum": 28,
		"type": "theorem",
		"label_en": "A prime number does not divide a product unless it divides one of the factors.",
		"label_uk": "Просте число не ділить добуток, якщо не ділить хоча б один із множників."
	  },
	  {
		"id": "VII.29",
		"bookNumber": 7,
		"propositionNum": 29,
		"type": "theorem",
		"label_en": "Any composite number is measured by some prime number.",
		"label_uk": "Будь-яке складене число ділиться на деяке просте число."
	  },
	  {
		"id": "VII.30",
		"bookNumber": 7,
		"propositionNum": 30,
		"type": "theorem",
		"label_en": "Any number is either prime or divisible by some prime.",
		"label_uk": "Кожне число — або просте, або ділиться на просте."
	  },
	  {
		"id": "VII.31",
		"bookNumber": 7,
		"propositionNum": 31,
		"type": "theorem",
		"label_en": "A number which is the least that has given prime numbers as measures is divisible by each of them.",
		"label_uk": "Найменше число, яке ділиться на задані прості числа, ділиться на кожне з них."
	  },
	  {
		"id": "VII.32",
		"bookNumber": 7,
		"propositionNum": 32,
		"type": "theorem",
		"label_en": "If a number is divisible by each of two primes, it is divisible by their product.",
		"label_uk": "Якщо число ділиться на два простих числа, воно ділиться і на їх добуток."
	  },
	  {
		"id": "VII.33",
		"bookNumber": 7,
		"propositionNum": 33,
		"type": "theorem",
		"label_en": "If a number be divisible by a product of primes, it is divisible by each factor.",
		"label_uk": "Якщо число ділиться на добуток простих чисел, воно ділиться на кожен множник."
	  },
	  {
		"id": "VII.34",
		"bookNumber": 7,
		"propositionNum": 34,
		"type": "theorem",
		"label_en": "To show that the number of primes is infinite.",
		"label_uk": "Довести, що кількість простих чисел — нескінченна."
	  },
	  {
		"id": "VII.35",
		"bookNumber": 7,
		"propositionNum": 35,
		"type": "theorem",
		"label_en": "To find the least number divisible by all numbers up to a given number.",
		"label_uk": "Знайти найменше число, що ділиться на всі числа до заданого."
	  },
	  {
		"id": "VII.36",
		"bookNumber": 7,
		"propositionNum": 36,
		"type": "theorem",
		"label_en": "If a number is relatively prime to a set of numbers, it is also relatively prime to their sum.",
		"label_uk": "Якщо число є взаємно простим з кожним із набору чисел, то воно взаємно просте і з їхньою сумою."
	  },
	  {
		"id": "VII.37",
		"bookNumber": 7,
		"propositionNum": 37,
		"type": "theorem",
		"label_en": "Any number greater than 1 is either prime or has a prime divisor.",
		"label_uk": "Кожне число, більше одиниці, — або просте, або має простий дільник."
	  },
	  {
		"id": "VII.38",
		"bookNumber": 7,
		"propositionNum": 38,
		"type": "theorem",
		"label_en": "The product of any two relatively prime numbers is their least common multiple.",
		"label_uk": "Добуток двох взаємно простих чисел — їх найменше спільне кратне."
	  },
	  {
		"id": "VII.39",
		"bookNumber": 7,
		"propositionNum": 39,
		"type": "theorem",
		"label_en": "If two numbers are both divisible by a third, their least common multiple is divisible by the third.",
		"label_uk": "Якщо два числа діляться на третє, то і їх найменше спільне кратне ділиться на нього."
	  },
	  {
		"id": "VIII.1",
		"bookNumber": 8,
		"propositionNum": 1,
		"type": "theorem",
		"label_en": "In a geometric progression, if there are as many means as we please, the terms have the same ratio.",
		"label_uk": "У геометричній прогресії з будь-якою кількістю середніх членів члени мають одне й те саме відношення."
	  },
	  {
		"id": "VIII.2",
		"bookNumber": 8,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "If three numbers are in continued proportion, the square of the mean equals the product of the extremes.",
		"label_uk": "Якщо три числа — у безперервній пропорції, то квадрат середнього дорівнює добутку крайніх."
	  },
	  {
		"id": "VIII.3",
		"bookNumber": 8,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "If four numbers are in continued proportion, the product of the extremes equals the product of the means.",
		"label_uk": "Якщо чотири числа — у безперервній пропорції, то добутки крайніх і середніх рівні."
	  },
	  {
		"id": "VIII.4",
		"bookNumber": 8,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "In continued proportion, the ratio of the first to the last is the product of the intermediate ratios.",
		"label_uk": "У безперервній пропорції відношення першого до останнього — добуток проміжних відношень."
	  },
	  {
		"id": "VIII.5",
		"bookNumber": 8,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "If two numbers are in a ratio of square numbers, they are in the ratio of sides.",
		"label_uk": "Якщо два числа мають відношення квадратів, то вони пропорційні сторонам квадратів."
	  },
	  {
		"id": "VIII.6",
		"bookNumber": 8,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "Numbers that have the same ratio as square numbers are themselves square.",
		"label_uk": "Числа, які мають відношення як квадрати, самі є квадратами."
	  },
	  {
		"id": "VIII.7",
		"bookNumber": 8,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "If numbers are in continued proportion and the first is a square, then all are squares.",
		"label_uk": "Якщо числа в безперервній пропорції і перше — квадрат, то всі є квадратами."
	  },
	  {
		"id": "VIII.8",
		"bookNumber": 8,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "In a geometric progression, the square of any term is equal to the product of its neighbors.",
		"label_uk": "У геометричній прогресії квадрат будь-якого члена дорівнює добутку сусідніх членів."
	  },
	  {
		"id": "VIII.9",
		"bookNumber": 8,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "If numbers are in a continued proportion, then any subset is also in continued proportion.",
		"label_uk": "Якщо числа в безперервній пропорції, то будь-яка підпослідовність — теж."
	  },
	  {
		"id": "VIII.10",
		"bookNumber": 8,
		"propositionNum": 10,
		"type": "theorem",
		"label_en": "If two numbers have a square ratio, the numbers are square.",
		"label_uk": "Якщо два числа мають квадратне відношення, то вони — квадрати."
	  },
	  {
		"id": "VIII.11",
		"bookNumber": 8,
		"propositionNum": 11,
		"type": "theorem",
		"label_en": "If a square measures a square, the side of the former measures the side of the latter.",
		"label_uk": "Якщо один квадрат ділить інший, то його сторона ділить сторону іншого квадрата."
	  },
	  {
		"id": "VIII.12",
		"bookNumber": 8,
		"propositionNum": 12,
		"type": "theorem",
		"label_en": "If a cube measures a cube, the side of the former measures the side of the latter.",
		"label_uk": "Якщо один куб ділить інший, то його сторона ділить сторону іншого куба."
	  },
	  {
		"id": "VIII.13",
		"bookNumber": 8,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "The product of equal numbers is a square.",
		"label_uk": "Добуток рівних чисел — квадрат."
	  },
	  {
		"id": "VIII.14",
		"bookNumber": 8,
		"propositionNum": 14,
		"type": "theorem",
		"label_en": "The product of three equal numbers is a cube.",
		"label_uk": "Добуток трьох однакових чисел — куб."
	  },
	  {
		"id": "VIII.15",
		"bookNumber": 8,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "If a number is the product of two numbers and is square, each factor is square.",
		"label_uk": "Якщо добуток двох чисел — квадрат, то кожне з них — квадрат."
	  },
	  {
		"id": "VIII.16",
		"bookNumber": 8,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "If a number is the product of three numbers and is a cube, each factor is a cube.",
		"label_uk": "Якщо добуток трьох чисел — куб, то кожне з них — куб."
	  },
	  {
		"id": "VIII.17",
		"bookNumber": 8,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "The cube on any number is equal to that number multiplied by its square.",
		"label_uk": "Куб будь-якого числа дорівнює добутку цього числа на його квадрат."
	  },
	  {
		"id": "VIII.18",
		"bookNumber": 8,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "The product of a square and a square is a square; of a cube and a cube is a cube.",
		"label_uk": "Добуток квадратів — квадрат; добуток кубів — куб."
	  },
	  {
		"id": "VIII.19",
		"bookNumber": 8,
		"propositionNum": 19,
		"type": "theorem",
		"label_en": "If a number is a cube and divides another cube, then their sides divide as well.",
		"label_uk": "Якщо куб ділить інший куб, то й їх сторони діляться."
	  },
	  {
		"id": "VIII.20",
		"bookNumber": 8,
		"propositionNum": 20,
		"type": "theorem",
		"label_en": "If a square number divides a square number, their roots are proportional.",
		"label_uk": "Якщо квадрат ділить квадрат, то корені пропорційні."
	  },
	  {
		"id": "VIII.21",
		"bookNumber": 8,
		"propositionNum": 21,
		"type": "theorem",
		"label_en": "Numbers proportional in square are themselves square.",
		"label_uk": "Якщо числа пропорційні в квадраті, то вони — квадрати."
	  },
	  {
		"id": "VIII.22",
		"bookNumber": 8,
		"propositionNum": 22,
		"type": "theorem",
		"label_en": "The sum of squares is not generally a square.",
		"label_uk": "Сума квадратів, як правило, не є квадратом."
	  },
	  {
		"id": "VIII.23",
		"bookNumber": 8,
		"propositionNum": 23,
		"type": "theorem",
		"label_en": "The difference of squares is not generally a square.",
		"label_uk": "Різниця квадратів, як правило, не є квадратом."
	  },
	  {
		"id": "VIII.24",
		"bookNumber": 8,
		"propositionNum": 24,
		"type": "theorem",
		"label_en": "A square number has an odd number of divisors; non-squares have an even number.",
		"label_uk": "Квадрат має непарну кількість дільників; не-квадрат — парну."
	  },
	  {
		"id": "VIII.25",
		"bookNumber": 8,
		"propositionNum": 25,
		"type": "theorem",
		"label_en": "If a number is a cube, its number of divisors is odd.",
		"label_uk": "Якщо число — куб, кількість його дільників — непарна."
	  },
	  {
		"id": "VIII.26",
		"bookNumber": 8,
		"propositionNum": 26,
		"type": "theorem",
		"label_en": "Every cube is triple the sum of the first n numbers squared.",
		"label_uk": "Кожен куб — це потрійна сума квадратів перших n чисел."
	  },
	  {
		"id": "VIII.27",
		"bookNumber": 8,
		"propositionNum": 27,
		"type": "theorem",
		"label_en": "Any cube number is the sum of consecutive odd numbers starting from 1.",
		"label_uk": "Будь-яке кубічне число — це сума послідовних непарних чисел, починаючи з 1."
	  },
	  {
		"id": "IX.1",
		"bookNumber": 9,
		"propositionNum": 1,
		"type": "theorem",
		"label_en": "If two numbers are in ratio and a third has the same ratio to the second, then the first has to the third the duplicate ratio.",
		"label_uk": "Якщо два числа мають певне відношення, і третє має те саме до другого, то перше має до третього подвійне відношення."
	  },
	  {
		"id": "IX.2",
		"bookNumber": 9,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "If several numbers are in continued proportion, the first has to the last a ratio compounded of the intermediate ratios.",
		"label_uk": "Якщо кілька чисел у безперервній пропорції, то перше до останнього має відношення, складене з проміжних."
	  },
	  {
		"id": "IX.3",
		"bookNumber": 9,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "If two numbers have a least common multiple, it is the smallest number divisible by both.",
		"label_uk": "Якщо два числа мають найменше спільне кратне, то це найменше число, що ділиться на обидва."
	  },
	  {
		"id": "IX.4",
		"bookNumber": 9,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "If a least number is measured by two numbers, it is measured by their greatest common measure.",
		"label_uk": "Якщо найменше число ділиться на два інших, то воно ділиться й на їх найбільший спільний дільник."
	  },
	  {
		"id": "IX.5",
		"bookNumber": 9,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "To show how to find the least number measured by given numbers not prime to each other.",
		"label_uk": "Показати, як знайти найменше число, що ділиться на задані числа, які не є взаємно простими."
	  },
	  {
		"id": "IX.6",
		"bookNumber": 9,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "Numbers measured by the same number have the same ratio as their quotients.",
		"label_uk": "Числа, що діляться на одне й те саме число, мають відношення, як їх частки."
	  },
	  {
		"id": "IX.7",
		"bookNumber": 9,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "If a number measures two numbers, it also measures any linear combination of them.",
		"label_uk": "Якщо число ділить два інших, то воно ділить і будь-яку їх лінійну комбінацію."
	  },
	  {
		"id": "IX.8",
		"bookNumber": 9,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "If a number measures two others, it also measures their difference.",
		"label_uk": "Якщо число ділить два інших, то воно ділить і їхню різницю."
	  },
	  {
		"id": "IX.9",
		"bookNumber": 9,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "If a number is prime to another, then their product is also prime to either factor.",
		"label_uk": "Якщо число взаємно просте з іншим, то їх добуток також взаємно простий із множником."
	  },
	  {
		"id": "IX.10",
		"bookNumber": 9,
		"propositionNum": 10,
		"type": "theorem",
		"label_en": "If numbers are proportional, then their sums are also proportional.",
		"label_uk": "Якщо числа пропорційні, то й суми цих чисел — пропорційні."
	  },
	  {
		"id": "IX.11",
		"bookNumber": 9,
		"propositionNum": 11,
		"type": "theorem",
		"label_en": "If numbers are proportional, then their differences are also proportional.",
		"label_uk": "Якщо числа пропорційні, то й їхні різниці пропорційні."
	  },
	  {
		"id": "IX.12",
		"bookNumber": 9,
		"propositionNum": 12,
		"type": "theorem",
		"label_en": "If numbers are proportional, then the ratios of their corresponding parts are equal.",
		"label_uk": "Якщо числа пропорційні, то й відповідні частини мають рівні відношення."
	  },
	  {
		"id": "IX.13",
		"bookNumber": 9,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "If two numbers are prime to one another, the product of each with the same number is also prime to each other.",
		"label_uk": "Якщо два числа взаємно прості, то й їх добутки на одне й те саме число — також взаємно прості."
	  },
	  {
		"id": "IX.14",
		"bookNumber": 9,
		"propositionNum": 14,
		"type": "theorem",
		"label_en": "If numbers are in continued proportion, any equimultiples of them will also be in the same ratio.",
		"label_uk": "Якщо числа в безперервній пропорції, то й кратні їм — також у тому самому відношенні."
	  },
	  {
		"id": "IX.15",
		"bookNumber": 9,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "If three numbers are in continued proportion, then the first is to the third as the square on the first to the square on the second.",
		"label_uk": "Якщо три числа — у безперервній пропорції, то перше до третього — як квадрат першого до квадрата другого."
	  },
	  {
		"id": "IX.16",
		"bookNumber": 9,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "In a geometric sequence, the ratio of terms is preserved through multiplication.",
		"label_uk": "У геометричній прогресії відношення між членами зберігається при множенні."
	  },
	  {
		"id": "IX.17",
		"bookNumber": 9,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "If two ratios are equal, and their antecedents are equal, then the consequents are equal.",
		"label_uk": "Якщо два відношення рівні й перші члени рівні, то й другі рівні."
	  },
	  {
		"id": "IX.18",
		"bookNumber": 9,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "Numbers in continued proportion maintain equality through permutation.",
		"label_uk": "Числа в безперервній пропорції зберігають рівність при перестановці."
	  },
	  {
		"id": "IX.19",
		"bookNumber": 9,
		"propositionNum": 19,
		"type": "theorem",
		"label_en": "If a number is to a number as another is to another, the cross-products are equal.",
		"label_uk": "Якщо відношення чисел однакові, то їх перехресні добутки рівні."
	  },
	  {
		"id": "IX.20",
		"bookNumber": 9,
		"propositionNum": 20,
		"type": "theorem",
		"label_en": "Numbers in geometric progression have a constant ratio.",
		"label_uk": "У геометричній прогресії відношення між сусідніми членами постійне."
	  },
	  {
		"id": "IX.21",
		"bookNumber": 9,
		"propositionNum": 21,
		"type": "theorem",
		"label_en": "The product of an even number of geometric terms equals the square of the mean terms.",
		"label_uk": "Добуток парної кількості геометричних членів дорівнює квадрату середніх."
	  },
	  {
		"id": "IX.22",
		"bookNumber": 9,
		"propositionNum": 22,
		"type": "theorem",
		"label_en": "The sum of a geometric series can be found via proportion.",
		"label_uk": "Сума геометричної прогресії може бути знайдена через пропорцію."
	  },
	  {
		"id": "IX.23",
		"bookNumber": 9,
		"propositionNum": 23,
		"type": "theorem",
		"label_en": "If numbers are in a geometric sequence, their sum relates to their ratio.",
		"label_uk": "Якщо числа в геометричній прогресії, то їх сума залежить від відношення."
	  },
	  {
		"id": "IX.24",
		"bookNumber": 9,
		"propositionNum": 24,
		"type": "theorem",
		"label_en": "The sum of a geometric progression of powers of two is one less than the next power.",
		"label_uk": "Сума степенів двійки до певного порядку — на одиницю менше від наступного степеня."
	  },
	  {
		"id": "IX.25",
		"bookNumber": 9,
		"propositionNum": 25,
		"type": "theorem",
		"label_en": "A number of the form  2^n - 1  is prime only if n is prime.",
		"label_uk": "Число виду  2^n - 1  може бути простим лише якщо  n  — просте."
	  },
	  {
		"id": "IX.26",
		"bookNumber": 9,
		"propositionNum": 26,
		"type": "theorem",
		"label_en": "To construct a perfect number from a Mersenne prime.",
		"label_uk": "Побудова досконалого числа з числа Мерсенна."
	  },
	  {
		"id": "IX.27",
		"bookNumber": 9,
		"propositionNum": 27,
		"type": "theorem",
		"label_en": "Even perfect numbers are of the form 2^{n-1}(2^n - 1), with 2^n - 1 prime.",
		"label_uk": "Парні досконалі числа мають вигляд  2^{n-1}(2^n - 1), де  2^n - 1  — просте."
	  },
	  {
		"id": "IX.28",
		"bookNumber": 9,
		"propositionNum": 28,
		"type": "theorem",
		"label_en": "Perfect numbers end in 6 or 8 and are even.",
		"label_uk": "Досконалі числа закінчуються на 6 або 8 і є парними."
	  },
	  {
		"id": "IX.29",
		"bookNumber": 9,
		"propositionNum": 29,
		"type": "theorem",
		"label_en": "All even perfect numbers are triangular.",
		"label_uk": "Усі парні досконалі числа — трикутні."
	  },
	  {
		"id": "IX.30",
		"bookNumber": 9,
		"propositionNum": 30,
		"type": "theorem",
		"label_en": "Every perfect number is the sum of its proper divisors.",
		"label_uk": "Кожне досконале число дорівнює сумі своїх власних дільників."
	  },
	  {
		"id": "IX.31",
		"bookNumber": 9,
		"propositionNum": 31,
		"type": "theorem",
		"label_en": "Every even perfect number corresponds to a Mersenne prime.",
		"label_uk": "Кожному парному досконалому числу відповідає просте число Мерсенна."
	  },
	  {
		"id": "IX.32",
		"bookNumber": 9,
		"propositionNum": 32,
		"type": "theorem",
		"label_en": "Odd perfect numbers, if they exist, must be greater than 10^1500.",
		"label_uk": "Непарні досконалі числа, якщо існують, мають бути більші за 10^1500."
	  },
	  {
		"id": "IX.33",
		"bookNumber": 9,
		"propositionNum": 33,
		"type": "theorem",
		"label_en": "Every number has a unique prime factorization.",
		"label_uk": "Кожне число має єдину просту розкладову."
	  },
	  {
		"id": "IX.34",
		"bookNumber": 9,
		"propositionNum": 34,
		"type": "theorem",
		"label_en": "The number of divisors of a number is determined by its prime exponents.",
		"label_uk": "Кількість дільників числа визначається степенями його простих множників."
	  },
	  {
		"id": "IX.35",
		"bookNumber": 9,
		"propositionNum": 35,
		"type": "theorem",
		"label_en": "The sum of divisors of a number is a multiplicative function.",
		"label_uk": "Сума дільників числа — мультиплікативна функція."
	  },
	  {
		"id": "IX.36",
		"bookNumber": 9,
		"propositionNum": 36,
		"type": "theorem",
		"label_en": "If a number is prime, then it has exactly two divisors.",
		"label_uk": "Просте число має рівно два дільники."
	  },
	  {
		"id": "X.1",
		"bookNumber": 10,
		"propositionNum": 1,
		"type": "theorem",
		"label_en": "Two unequal magnitudes being set out, if from the greater there be subtracted a magnitude greater than its half, and so on, there will remain some magnitude which will be less than any assigned magnitude.",
		"label_uk": "Якщо з більшої величини постійно віднімати більше половини, то залишиться величина менша за будь-яку задану."
	  },
	  {
		"id": "X.2",
		"bookNumber": 10,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "If from greater of two unequal magnitudes, a part greater than its half be continually subtracted, and the remainder does not measure the lesser, the magnitudes are incommensurable.",
		"label_uk": "Якщо залишок не ділить меншу величину, то величини неспівмірні."
	  },
	  {
		"id": "X.3",
		"bookNumber": 10,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "Magnitudes are said to be commensurable when the same magnitude measures both.",
		"label_uk": "Величини називаються спiвмірними, якщо одна i та ж величина ділить обидві."
	  },
	  {
		"id": "X.4",
		"bookNumber": 10,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "Magnitudes are incommensurable when they have no common measure.",
		"label_uk": "Величини неспівмірні, якщо не мають спільного дільника."
	  },
	  {
		"id": "X.5",
		"bookNumber": 10,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "If a magnitude measures another, it also measures any multiple of it.",
		"label_uk": "Якщо величина ділить іншу, вона ділить будь-яке її кратне."
	  },
	  {
		"id": "X.6",
		"bookNumber": 10,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "If magnitudes are commensurable, they are in a ratio of numbers.",
		"label_uk": "Якщо величини співмірні, вони мають числове відношення."
	  },
	  {
		"id": "X.7",
		"bookNumber": 10,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "If two magnitudes are incommensurable, their squares are also incommensurable.",
		"label_uk": "Якщо дві величини неспівмірні, то й їх квадрати неспівмірні."
	  },
	  {
		"id": "X.8",
		"bookNumber": 10,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "If squares on two magnitudes are commensurable, then the magnitudes are commensurable.",
		"label_uk": "Якщо квадрати величин співмірні, то й самі величини — співмірні."
	  },
	  {
		"id": "X.9",
		"bookNumber": 10,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "To prove that a straight line and its square root are incommensurable.",
		"label_uk": "Пряма і її корінь неспівмірні."
	  },
	  {
		"id": "X.10",
		"bookNumber": 10,
		"propositionNum": 10,
		"type": "theorem",
		"label_en": "A straight line is said to be rational if it is commensurable in length with a given unit.",
		"label_uk": "Пряма називається раціональною, якщо вона співмірна з одиничною прямою."
	  },
	  {
		"id": "X.11",
		"bookNumber": 10,
		"propositionNum": 11,
		"type": "theorem",
		"label_en": "A line commensurable only in square is called irrational.",
		"label_uk": "Пряма, яка співмірна лише в квадраті, називається ірраціональною."
	  },
	  {
		"id": "X.12",
		"bookNumber": 10,
		"propositionNum": 12,
		"type": "theorem",
		"label_en": "To prove that lines commensurable in square only produce irrational results.",
		"label_uk": "Прямі, співмірні лише в квадраті, дають ірраціональні результати при побудовах."
	  },
	  {
		"id": "X.13",
		"bookNumber": 10,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "Irrational lines remain irrational under addition or subtraction with rational lines.",
		"label_uk": "Ірраціональні прямі залишаються ірраціональними при додаванні або відніманні раціональних."
	  },
	  {
		"id": "X.14",
		"bookNumber": 10,
		"propositionNum": 14,
		"type": "theorem",
		"label_en": "Square roots of non-square numbers are irrational.",
		"label_uk": "Корені з несформованих квадратів — ірраціональні."
	  },
	  {
		"id": "X.15",
		"bookNumber": 10,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "To classify irrational lines into types based on properties of their squares.",
		"label_uk": "Класифікація ірраціональних прямих за властивостями їх квадратів."
	  },
	  {
		"id": "X.16",
		"bookNumber": 10,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "To define medial lines (lines whose square is rational but not square of a rational line).",
		"label_uk": "Медіальні прямі — ті, квадрат яких раціональний, але самі не є квадратами раціональних."
	  },
	  {
		"id": "X.17",
		"bookNumber": 10,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "To define binomial lines: sum of two rational lines commensurable only in square.",
		"label_uk": "Біноміальні прямі — сума двох раціональних прямих, співмірних лише в квадраті."
	  },
	  {
		"id": "X.18",
		"bookNumber": 10,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "To define apotome lines: difference of two rational lines commensurable only in square.",
		"label_uk": "Апотомні прямі — різниця двох раціональних, співмірних лише в квадраті."
	  },
	  {
		"id": "X.19",
		"bookNumber": 10,
		"propositionNum": 19,
		"type": "theorem",
		"label_en": "The square on a binomial line is irrational.",
		"label_uk": "Квадрат біноміальної прямої — ірраціональний."
	  },
	  {
		"id": "X.20",
		"bookNumber": 10,
		"propositionNum": 20,
		"type": "theorem",
		"label_en": "The square on an apotome line is also irrational.",
		"label_uk": "Квадрат апотомної прямої — також ірраціональний."
	  },
	  {
		"id": "X.21",
		"bookNumber": 10,
		"propositionNum": 21,
		"type": "theorem",
		"label_en": "The rectangle contained by a rational line and a medial line is irrational.",
		"label_uk": "Прямокутник, побудований на раціональній і медіальній прямих — ірраціональний."
	  },
	  {
		"id": "X.22",
		"bookNumber": 10,
		"propositionNum": 22,
		"type": "theorem",
		"label_en": "The rectangle contained by a rational and binomial line is irrational.",
		"label_uk": "Прямокутник з раціональної і біноміальної прямих — ірраціональний."
	  },
	  {
		"id": "X.23",
		"bookNumber": 10,
		"propositionNum": 23,
		"type": "theorem",
		"label_en": "The square on a medial line is rational, but the line itself is irrational.",
		"label_uk": "Квадрат медіальної прямої — раціональний, але сама пряма — ірраціональна."
	  },
	  {
		"id": "X.24",
		"bookNumber": 10,
		"propositionNum": 24,
		"type": "theorem",
		"label_en": "The square on a binomial line is irrational and medial.",
		"label_uk": "Квадрат біноміальної прямої — ірраціональний та медіальний."
	  },
	  {
		"id": "X.25",
		"bookNumber": 10,
		"propositionNum": 25,
		"type": "theorem",
		"label_en": "The square on an apotome is irrational and medial.",
		"label_uk": "Квадрат апотомної прямої — ірраціональний і медіальний."
	  },
	  {
		"id": "X.26",
		"bookNumber": 10,
		"propositionNum": 26,
		"type": "theorem",
		"label_en": "The sum of a medial line and a rational line is irrational.",
		"label_uk": "Сума медіальної і раціональної прямої — ірраціональна."
	  },
	  {
		"id": "X.27",
		"bookNumber": 10,
		"propositionNum": 27,
		"type": "theorem",
		"label_en": "The difference of a medial and a rational line is irrational.",
		"label_uk": "Різниця між медіальною і раціональною прямою — ірраціональна."
	  },
	  {
		"id": "X.28",
		"bookNumber": 10,
		"propositionNum": 28,
		"type": "theorem",
		"label_en": "A medial line added to or subtracted from another medial yields irrational.",
		"label_uk": "Сума або різниця медіальних прямих — ірраціональна."
	  },
	  {
		"id": "X.29",
		"bookNumber": 10,
		"propositionNum": 29,
		"type": "theorem",
		"label_en": "A medial rectangle is irrational.",
		"label_uk": "Медіальний прямокутник — ірраціональний."
	  },
	  {
		"id": "X.30",
		"bookNumber": 10,
		"propositionNum": 30,
		"type": "theorem",
		"label_en": "A binomial multiplied by itself produces a medial area.",
		"label_uk": "Біноміальна пряма, помножена сама на себе, дає медіальну площу."
	  },
	  {
		"id": "X.31",
		"bookNumber": 10,
		"propositionNum": 31,
		"type": "theorem",
		"label_en": "A binomial line times a rational produces an irrational line.",
		"label_uk": "Біноміальна, помножена на раціональну, дає ірраціональну пряму."
	  },
	  {
		"id": "X.32",
		"bookNumber": 10,
		"propositionNum": 32,
		"type": "theorem",
		"label_en": "An apotome times a rational line produces an irrational line.",
		"label_uk": "Апотомна, помножена на раціональну — також ірраціональна."
	  },
	  {
		"id": "X.33",
		"bookNumber": 10,
		"propositionNum": 33,
		"type": "theorem",
		"label_en": "The sum of a binomial and its conjugate is rational.",
		"label_uk": "Сума біноміальної і спряженої до неї — раціональна."
	  },
	  {
		"id": "X.34",
		"bookNumber": 10,
		"propositionNum": 34,
		"type": "theorem",
		"label_en": "The product of a binomial and its conjugate is rational and medial.",
		"label_uk": "Добуток біноміальної і спряженої до неї — раціональний і медіальний."
	  },
	  {
		"id": "X.35",
		"bookNumber": 10,
		"propositionNum": 35,
		"type": "theorem",
		"label_en": "If a rational area is divided by a rational line, the result is rational.",
		"label_uk": "Якщо раціональну площу поділити на раціональну пряму — результат буде раціональним."
	  },
	  {
		"id": "X.36",
		"bookNumber": 10,
		"propositionNum": 36,
		"type": "theorem",
		"label_en": "If a medial area is divided by a rational line, the result is irrational.",
		"label_uk": "Медіальна площа, поділена на раціональну пряму — ірраціональна."
	  },
	  {
		"id": "X.37",
		"bookNumber": 10,
		"propositionNum": 37,
		"type": "theorem",
		"label_en": "If a binomial area is divided by a rational line, the result is irrational.",
		"label_uk": "Біноміальна площа, поділена на раціональну пряму — ірраціональна."
	  },
	  {
		"id": "X.38",
		"bookNumber": 10,
		"propositionNum": 38,
		"type": "theorem",
		"label_en": "If a rational area is divided by a medial line, the result is irrational.",
		"label_uk": "Розділити раціональну площу на медіальну пряму — отримаємо ірраціональну пряму."
	  },
	  {
		"id": "X.39",
		"bookNumber": 10,
		"propositionNum": 39,
		"type": "theorem",
		"label_en": "A medial area divided by a medial line yields irrational.",
		"label_uk": "Медіальна площа на медіальну пряму — ірраціональна."
	  },
	  {
		"id": "X.40",
		"bookNumber": 10,
		"propositionNum": 40,
		"type": "theorem",
		"label_en": "If the square on a line is rational and the line itself is irrational, then it is medial.",
		"label_uk": "Якщо квадрат прямої раціональний, а сама вона — ірраціональна, то вона медіальна."
	  },
	  {
		"id": "X.41",
		"bookNumber": 10,
		"propositionNum": 41,
		"type": "theorem",
		"label_en": "If the square on a line is irrational and the line is irrational, the line is medial.",
		"label_uk": "Якщо квадрат прямої і сама пряма — ірраціональні, то ця пряма медіальна."
	  },
	  {
		"id": "X.42",
		"bookNumber": 10,
		"propositionNum": 42,
		"type": "theorem",
		"label_en": "If a line is such that its square is medial but the line is not rational, then it is medial.",
		"label_uk": "Якщо квадрат прямої — медіальний, а сама вона не є раціональною — вона медіальна."
	  },
	  {
		"id": "X.43",
		"bookNumber": 10,
		"propositionNum": 43,
		"type": "theorem",
		"label_en": "A binomial line added to a rational gives an irrational line.",
		"label_uk": "Сума біноміальної і раціональної прямих — ірраціональна."
	  },
	  {
		"id": "X.44",
		"bookNumber": 10,
		"propositionNum": 44,
		"type": "theorem",
		"label_en": "The difference of a binomial and a rational line is irrational.",
		"label_uk": "Різниця між біноміальною і раціональною прямою — ірраціональна."
	  },
	  {
		"id": "X.45",
		"bookNumber": 10,
		"propositionNum": 45,
		"type": "theorem",
		"label_en": "A binomial plus a binomial yields an irrational line.",
		"label_uk": "Сума двох біноміальних прямих — ірраціональна."
	  },
	  {
		"id": "X.46",
		"bookNumber": 10,
		"propositionNum": 46,
		"type": "theorem",
		"label_en": "An apotome plus an apotome is irrational.",
		"label_uk": "Сума двох апотомних прямих — ірраціональна."
	  },
	  {
		"id": "X.47",
		"bookNumber": 10,
		"propositionNum": 47,
		"type": "theorem",
		"label_en": "The sum of a binomial and an apotome is irrational.",
		"label_uk": "Сума біноміальної і апотомної — ірраціональна."
	  },
	  {
		"id": "X.48",
		"bookNumber": 10,
		"propositionNum": 48,
		"type": "theorem",
		"label_en": "The difference between a binomial and an apotome is irrational.",
		"label_uk": "Різниця між біноміальною і апотомною прямою — ірраціональна."
	  },
	  {
		"id": "X.49",
		"bookNumber": 10,
		"propositionNum": 49,
		"type": "theorem",
		"label_en": "If the square on a line equals the sum of squares on two rational lines commensurable only in square, then the line is irrational.",
		"label_uk": "Якщо квадрат прямої дорівнює сумі квадратів двох раціональних, співмірних лише в квадраті, то ця пряма — ірраціональна."
	  },
	  {
		"id": "X.50",
		"bookNumber": 10,
		"propositionNum": 50,
		"type": "theorem",
		"label_en": "A line whose square equals the difference of squares on two rational lines commensurable only in square is irrational.",
		"label_uk": "Пряма, квадрат якої дорівнює різниці квадратів двох раціональних, співмірних лише в квадраті, — ірраціональна."
	  },
	  {
		"id": "X.51",
		"bookNumber": 10,
		"propositionNum": 51,
		"type": "theorem",
		"label_en": "If a binomial is divided into its component rational parts, each is irrational to the binomial.",
		"label_uk": "Якщо біноміальну пряму розділити на її частини, кожна з них буде ірраціональною щодо цілої."
	  },
	  {
		"id": "X.52",
		"bookNumber": 10,
		"propositionNum": 52,
		"type": "theorem",
		"label_en": "If an apotome is divided into parts, each part is irrational with respect to the whole.",
		"label_uk": "Частини апотомної прямої — ірраціональні відносно всієї."
	  },
	  {
		"id": "X.53",
		"bookNumber": 10,
		"propositionNum": 53,
		"type": "theorem",
		"label_en": "If two lines are irrational, their product may be rational.",
		"label_uk": "Добуток двох ірраціональних прямих може бути раціональним."
	  },
	  {
		"id": "X.54",
		"bookNumber": 10,
		"propositionNum": 54,
		"type": "theorem",
		"label_en": "The product of an irrational line and its conjugate is rational.",
		"label_uk": "Добуток ірраціональної прямої і спряженої до неї — раціональний."
	  },
	  {
		"id": "X.55",
		"bookNumber": 10,
		"propositionNum": 55,
		"type": "theorem",
		"label_en": "The square on a line composed of a rational and a medial part is irrational.",
		"label_uk": "Квадрат прямої, складеної з раціональної та медіальної частин — ірраціональний."
	  },
	  {
		"id": "X.56",
		"bookNumber": 10,
		"propositionNum": 56,
		"type": "theorem",
		"label_en": "If the square on a line equals twice the rectangle under two rational lines commensurable in square only, the line is irrational.",
		"label_uk": "Якщо квадрат прямої дорівнює подвоєному добутку двох раціональних (співмірних лише в квадраті), то пряма — ірраціональна."
	  },
	  {
		"id": "X.57",
		"bookNumber": 10,
		"propositionNum": 57,
		"type": "theorem",
		"label_en": "A line divided into medial and rational parts yields irrational products.",
		"label_uk": "Пряма, поділена на медіальну і раціональну частини, дає ірраціональні добутки."
	  },
	  {
		"id": "X.58",
		"bookNumber": 10,
		"propositionNum": 58,
		"type": "theorem",
		"label_en": "To show the square of a line composed of a medial and a rational component is irrational.",
		"label_uk": "Квадрат прямої, що складається з медіальної та раціональної частин — ірраціональний."
	  },
	  {
		"id": "X.59",
		"bookNumber": 10,
		"propositionNum": 59,
		"type": "theorem",
		"label_en": "The product of a medial and a rational line is irrational.",
		"label_uk": "Добуток медіальної і раціональної прямої — ірраціональний."
	  },
	  {
		"id": "X.60",
		"bookNumber": 10,
		"propositionNum": 60,
		"type": "theorem",
		"label_en": "A binomial multiplied by an apotome yields an irrational line.",
		"label_uk": "Біноміальна, помножена на апотомну — ірраціональна."
	  },
	  {
		"id": "X.61",
		"bookNumber": 10,
		"propositionNum": 61,
		"type": "theorem",
		"label_en": "The product of two binomials gives an irrational line.",
		"label_uk": "Добуток двох біноміальних прямих — ірраціональний."
	  },
	  {
		"id": "X.62",
		"bookNumber": 10,
		"propositionNum": 62,
		"type": "theorem",
		"label_en": "The product of two apotomes gives an irrational line.",
		"label_uk": "Добуток двох апотомних прямих — ірраціональний."
	  },
	  {
		"id": "X.63",
		"bookNumber": 10,
		"propositionNum": 63,
		"type": "theorem",
		"label_en": "A binomial multiplied by a medial line gives an irrational line.",
		"label_uk": "Біноміальна, помножена на медіальну — ірраціональна."
	  },
	  {
		"id": "X.64",
		"bookNumber": 10,
		"propositionNum": 64,
		"type": "theorem",
		"label_en": "An apotome multiplied by a medial line gives an irrational line.",
		"label_uk": "Апотомна, помножена на медіальну — ірраціональна."
	  },
	  {
		"id": "X.65",
		"bookNumber": 10,
		"propositionNum": 65,
		"type": "theorem",
		"label_en": "If the square on a line is rational, but the line itself is irrational, it is medial.",
		"label_uk": "Якщо квадрат прямої раціональний, а сама пряма — ірраціональна, то вона медіальна."
	  },
	  {
		"id": "X.66",
		"bookNumber": 10,
		"propositionNum": 66,
		"type": "theorem",
		"label_en": "If the square on a line is medial and the line is not rational, it is medial.",
		"label_uk": "Якщо квадрат прямої медіальний, а сама вона нераціональна, то вона також медіальна."
	  },
	  {
		"id": "X.67",
		"bookNumber": 10,
		"propositionNum": 67,
		"type": "theorem",
		"label_en": "If two binomials have the same terms in the same order, they are equal.",
		"label_uk": "Якщо дві біноміальні прямі мають однакові складові в тій же послідовності — вони рівні."
	  },
	  {
		"id": "X.68",
		"bookNumber": 10,
		"propositionNum": 68,
		"type": "theorem",
		"label_en": "If two apotomes have the same terms in the same order, they are equal.",
		"label_uk": "Якщо дві апотомні прямі мають однакові складові в тому ж порядку — вони рівні."
	  },
	  {
		"id": "X.69",
		"bookNumber": 10,
		"propositionNum": 69,
		"type": "theorem",
		"label_en": "If binomial terms are reversed, the result is not equal to the original.",
		"label_uk": "Якщо змінити порядок складових біноміальної прямої — результат буде інший."
	  },
	  {
		"id": "X.70",
		"bookNumber": 10,
		"propositionNum": 70,
		"type": "theorem",
		"label_en": "Two binomials with same terms in reverse order are unequal.",
		"label_uk": "Дві біноміальні прямі з однаковими, але переставленими членами — не рівні."
	  },
	  {
		"id": "X.71",
		"bookNumber": 10,
		"propositionNum": 71,
		"type": "theorem",
		"label_en": "Two apotomes with same terms in reverse order are unequal.",
		"label_uk": "Дві апотомні прямі з переставленими частинами — нерівні."
	  },
	  {
		"id": "X.72",
		"bookNumber": 10,
		"propositionNum": 72,
		"type": "theorem",
		"label_en": "If a binomial and an apotome have same terms, they are unequal.",
		"label_uk": "Біноміальна і апотомна прямі з однаковими частинами — не рівні."
	  },
	  {
		"id": "X.73",
		"bookNumber": 10,
		"propositionNum": 73,
		"type": "theorem",
		"label_en": "To compare types of binomial lines based on commensurability of parts.",
		"label_uk": "Порівняння типів біноміальних прямих за співмірністю частин."
	  },
	  {
		"id": "X.74",
		"bookNumber": 10,
		"propositionNum": 74,
		"type": "theorem",
		"label_en": "To classify apotomes by parts and their commensurability.",
		"label_uk": "Класифікація апотомних прямих за співмірністю частин."
	  },
	  {
		"id": "X.75",
		"bookNumber": 10,
		"propositionNum": 75,
		"type": "theorem",
		"label_en": "To define secondary binomial lines.",
		"label_uk": "Визначення вторинних біноміальних прямих."
	  },
	  {
		"id": "X.76",
		"bookNumber": 10,
		"propositionNum": 76,
		"type": "theorem",
		"label_en": "To define secondary apotome lines.",
		"label_uk": "Визначення вторинних апотомних прямих."
	  },
	  {
		"id": "X.77",
		"bookNumber": 10,
		"propositionNum": 77,
		"type": "theorem",
		"label_en": "To define major and minor binomials.",
		"label_uk": "Визначення більшої та меншої біноміальної прямої."
	  },
	  {
		"id": "X.78",
		"bookNumber": 10,
		"propositionNum": 78,
		"type": "theorem",
		"label_en": "To define major and minor apotomes.",
		"label_uk": "Визначення більшої та меншої апотомної прямої."
	  },
	  {
		"id": "X.79",
		"bookNumber": 10,
		"propositionNum": 79,
		"type": "theorem",
		"label_en": "A square described on a major binomial is irrational.",
		"label_uk": "Квадрат, описаний на більшій біноміальній прямій — ірраціональний."
	  },
	  {
		"id": "X.80",
		"bookNumber": 10,
		"propositionNum": 80,
		"type": "theorem",
		"label_en": "A square on a minor apotome is irrational.",
		"label_uk": "Квадрат, побудований на меншій апотомній прямій — ірраціональний."
	  },
	  {
		"id": "X.81",
		"bookNumber": 10,
		"propositionNum": 81,
		"type": "theorem",
		"label_en": "A square on a minor binomial is irrational.",
		"label_uk": "Квадрат, побудований на меншій біноміальній прямій — ірраціональний."
	  },
	  {
		"id": "X.82",
		"bookNumber": 10,
		"propositionNum": 82,
		"type": "theorem",
		"label_en": "The product of a binomial and an apotome gives a medial area.",
		"label_uk": "Добуток біноміальної і апотомної прямих — медіальна площа."
	  },
	  {
		"id": "X.83",
		"bookNumber": 10,
		"propositionNum": 83,
		"type": "theorem",
		"label_en": "To construct a line whose square is a given medial area.",
		"label_uk": "Побудувати пряму, квадрат якої дорівнює заданій медіальній площі."
	  },
	  {
		"id": "X.84",
		"bookNumber": 10,
		"propositionNum": 84,
		"type": "theorem",
		"label_en": "To show that a square on a line commensurable in length with a binomial is rational.",
		"label_uk": "Квадрат прямої, співмірної з біноміальною, — раціональний."
	  },
	  {
		"id": "X.85",
		"bookNumber": 10,
		"propositionNum": 85,
		"type": "theorem",
		"label_en": "To show that a square on a line commensurable with an apotome is rational.",
		"label_uk": "Квадрат прямої, співмірної з апотомною, — раціональний."
	  },
	  {
		"id": "X.86",
		"bookNumber": 10,
		"propositionNum": 86,
		"type": "theorem",
		"label_en": "A medial line is incommensurable in length with any rational line.",
		"label_uk": "Медіальна пряма неспівмірна в довжині з будь-якою раціональною."
	  },
	  {
		"id": "X.87",
		"bookNumber": 10,
		"propositionNum": 87,
		"type": "theorem",
		"label_en": "A binomial line is incommensurable in length with its components.",
		"label_uk": "Біноміальна пряма неспівмірна в довжині зі своїми складовими."
	  },
	  {
		"id": "X.88",
		"bookNumber": 10,
		"propositionNum": 88,
		"type": "theorem",
		"label_en": "An apotome line is incommensurable in length with its components.",
		"label_uk": "Апотомна пряма неспівмірна зі своїми частинами."
	  },
	  {
		"id": "X.89",
		"bookNumber": 10,
		"propositionNum": 89,
		"type": "theorem",
		"label_en": "To construct a line that is commensurable only in square with a given line.",
		"label_uk": "Побудувати пряму, співмірну з даною лише в квадраті."
	  },
	  {
		"id": "X.90",
		"bookNumber": 10,
		"propositionNum": 90,
		"type": "theorem",
		"label_en": "To construct a line incommensurable both in length and square with a given rational line.",
		"label_uk": "Побудувати пряму, неспівмірну з раціональною ні в довжині, ні в квадраті."
	  },
	  {
		"id": "X.91",
		"bookNumber": 10,
		"propositionNum": 91,
		"type": "theorem",
		"label_en": "To find a medial line that is incommensurable in length but commensurable in square with a given medial line.",
		"label_uk": "Знайти медіальну пряму, неспівмірну з іншою медіальною в довжині, але співмірну в квадраті."
	  },
	  {
		"id": "X.92",
		"bookNumber": 10,
		"propositionNum": 92,
		"type": "theorem",
		"label_en": "To find a medial line incommensurable in both length and square with another medial.",
		"label_uk": "Знайти медіальну пряму, неспівмірну з іншою медіальною ні в довжині, ні в квадраті."
	  },
	  {
		"id": "X.93",
		"bookNumber": 10,
		"propositionNum": 93,
		"type": "theorem",
		"label_en": "To divide a medial line into two medial parts.",
		"label_uk": "Розділити медіальну пряму на дві медіальні частини."
	  },
	  {
		"id": "X.94",
		"bookNumber": 10,
		"propositionNum": 94,
		"type": "theorem",
		"label_en": "To divide a medial line into a rational and a medial part.",
		"label_uk": "Розділити медіальну пряму на раціональну і медіальну частини."
	  },
	  {
		"id": "X.95",
		"bookNumber": 10,
		"propositionNum": 95,
		"type": "theorem",
		"label_en": "To divide a rational line into a rational and a medial part.",
		"label_uk": "Розділити раціональну пряму на раціональну і медіальну частини."
	  },
	  {
		"id": "X.96",
		"bookNumber": 10,
		"propositionNum": 96,
		"type": "theorem",
		"label_en": "To show that a rational line minus a medial can yield a rational.",
		"label_uk": "Показати, що раціональна мінус медіальна може дати раціональну."
	  },
	  {
		"id": "X.97",
		"bookNumber": 10,
		"propositionNum": 97,
		"type": "theorem",
		"label_en": "To construct a rational line that exceeds a medial by a rational.",
		"label_uk": "Побудувати раціональну пряму, яка перевищує медіальну на раціональну."
	  },
	  {
		"id": "X.98",
		"bookNumber": 10,
		"propositionNum": 98,
		"type": "theorem",
		"label_en": "To find a rational line less than a given medial by a rational.",
		"label_uk": "Знайти раціональну пряму, яка менша за медіальну на раціональну."
	  },
	  {
		"id": "X.99",
		"bookNumber": 10,
		"propositionNum": 99,
		"type": "theorem",
		"label_en": "To find a medial line less than a given medial by a rational.",
		"label_uk": "Знайти медіальну пряму, меншу за задану медіальну на раціональну."
	  },
	  {
		"id": "X.100",
		"bookNumber": 10,
		"propositionNum": 100,
		"type": "theorem",
		"label_en": "To construct a line greater than a given rational by a medial.",
		"label_uk": "Побудувати пряму, більшу за задану раціональну на медіальну."
	  },
	  {
		"id": "X.101",
		"bookNumber": 10,
		"propositionNum": 101,
		"type": "theorem",
		"label_en": "To find a medial line greater than a given rational by a rational.",
		"label_uk": "Знайти медіальну пряму, більшу за задану раціональну на раціональну."
	  },
	  {
		"id": "X.102",
		"bookNumber": 10,
		"propositionNum": 102,
		"type": "theorem",
		"label_en": "To construct a medial line that differs from another by a medial.",
		"label_uk": "Побудувати медіальну пряму, яка відрізняється від іншої на медіальну."
	  },
	  {
		"id": "X.103",
		"bookNumber": 10,
		"propositionNum": 103,
		"type": "theorem",
		"label_en": "To divide a medial into parts in the ratio of a medial to a rational.",
		"label_uk": "Розділити медіальну пряму у відношенні медіальної до раціональної."
	  },
	  {
		"id": "X.104",
		"bookNumber": 10,
		"propositionNum": 104,
		"type": "theorem",
		"label_en": "To construct a line that is commensurable in square only with each of two given lines.",
		"label_uk": "Побудувати пряму, яка співмірна лише в квадраті з двома даними прямими."
	  },
	  {
		"id": "X.105",
		"bookNumber": 10,
		"propositionNum": 105,
		"type": "theorem",
		"label_en": "To find two rational lines commensurable only in square whose sum is medial.",
		"label_uk": "Знайти дві раціональні прямі, співмірні лише в квадраті, сума яких — медіальна."
	  },
	  {
		"id": "X.106",
		"bookNumber": 10,
		"propositionNum": 106,
		"type": "theorem",
		"label_en": "To find two medial lines incommensurable in length whose sum is rational.",
		"label_uk": "Знайти дві медіальні прямі, неспівмірні в довжині, сума яких — раціональна."
	  },
	  {
		"id": "X.107",
		"bookNumber": 10,
		"propositionNum": 107,
		"type": "theorem",
		"label_en": "To find two rational lines commensurable only in square whose rectangle is medial.",
		"label_uk": "Знайти дві раціональні прямі, співмірні лише в квадраті, добуток яких — медіальний."
	  },
	  {
		"id": "X.108",
		"bookNumber": 10,
		"propositionNum": 108,
		"type": "theorem",
		"label_en": "To construct a square equal to the sum of squares on two rational lines commensurable only in square.",
		"label_uk": "Побудувати квадрат, рівний сумі квадратів двох раціональних прямих, співмірних лише в квадраті."
	  },
	  {
		"id": "X.109",
		"bookNumber": 10,
		"propositionNum": 109,
		"type": "theorem",
		"label_en": "To construct a square equal to the difference of squares on two rational lines commensurable only in square.",
		"label_uk": "Побудувати квадрат, рівний різниці квадратів двох раціональних прямих, співмірних лише в квадраті."
	  },
	  {
		"id": "X.110",
		"bookNumber": 10,
		"propositionNum": 110,
		"type": "theorem",
		"label_en": "To show that a line composed of medial and rational parts is irrational.",
		"label_uk": "Показати, що пряма, складена з медіальної та раціональної частин — ірраціональна."
	  },
	  {
		"id": "X.111",
		"bookNumber": 10,
		"propositionNum": 111,
		"type": "theorem",
		"label_en": "A medial area bounded by two rational lines commensurable only in square is irrational.",
		"label_uk": "Медіальна площа, обмежена двома раціональними прямими, співмірними лише в квадраті — ірраціональна."
	  },
	  {
		"id": "X.112",
		"bookNumber": 10,
		"propositionNum": 112,
		"type": "theorem",
		"label_en": "To divide a rational line into two parts that are commensurable only in square.",
		"label_uk": "Розділити раціональну пряму на дві частини, співмірні лише в квадраті."
	  },
	  {
		"id": "X.113",
		"bookNumber": 10,
		"propositionNum": 113,
		"type": "theorem",
		"label_en": "To find the square on a line incommensurable with a given square.",
		"label_uk": "Знайти квадрат прямої, неспівмірної з заданим квадратом."
	  },
	  {
		"id": "X.114",
		"bookNumber": 10,
		"propositionNum": 114,
		"type": "theorem",
		"label_en": "To construct a line commensurable in square only with a given medial.",
		"label_uk": "Побудувати пряму, співмірну лише в квадраті з даною медіальною."
	  },
	  {
		"id": "X.115",
		"bookNumber": 10,
		"propositionNum": 115,
		"type": "theorem",
		"label_en": "To find a line commensurable in square only with a given irrational, and whose square is rational.",
		"label_uk": "Знайти пряму, співмірну лише в квадраті з ірраціональною, квадрат якої — раціональний."
	  },
	  {
		"id": "XI.1",
		"bookNumber": 11,
		"propositionNum": 1,
		"type": "theorem",
		"label_en": "One part of a straight line cannot be in a plane and another part out of the plane.",
		"label_uk": "Жодна частина прямої не може бути в площині, а інша — поза нею."
	  },
	  {
		"id": "XI.2",
		"bookNumber": 11,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "Two straight lines cannot have a common segment unless they coincide.",
		"label_uk": "Дві прямі не можуть мати спільної частини, якщо тільки не збігаються."
	  },
	  {
		"id": "XI.3",
		"bookNumber": 11,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "If two planes cut one another, then their intersection is a straight line.",
		"label_uk": "Якщо дві площини перетинаються, то лінія перетину — пряма."
	  },
	  {
		"id": "XI.4",
		"bookNumber": 11,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "If a straight line stands on a plane and makes right angles with two lines in the plane, it is perpendicular to the plane.",
		"label_uk": "Якщо пряма перпендикулярна до двох прямих у площині, то вона перпендикулярна до всієї площини."
	  },
	  {
		"id": "XI.5",
		"bookNumber": 11,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "If a line is perpendicular to a plane, then it makes right angles with every line in the plane through its foot.",
		"label_uk": "Якщо пряма перпендикулярна до площини, то вона утворює прямі кути з усіма прямими в площині, що проходять через точку перетину."
	  },
	  {
		"id": "XI.6",
		"bookNumber": 11,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "Only one perpendicular can be drawn from a point to a plane.",
		"label_uk": "З будь-якої точки до площини можна провести лише один перпендикуляр."
	  },
	  {
		"id": "XI.7",
		"bookNumber": 11,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "If two straight lines are each perpendicular to the same plane, they are parallel to each other.",
		"label_uk": "Якщо дві прямі перпендикулярні до однієї площини, то вони паралельні між собою."
	  },
	  {
		"id": "XI.8",
		"bookNumber": 11,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "If a plane stands at right angles to another plane, and a straight line is drawn in one perpendicular to the intersection, it is perpendicular to the other plane.",
		"label_uk": "Якщо площина перпендикулярна до іншої, то пряма, перпендикулярна до лінії перетину, перпендикулярна й до другої площини."
	  },
	  {
		"id": "XI.9",
		"bookNumber": 11,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "If two planes are perpendicular and a line is drawn at right angles in one, then it's also perpendicular to the other.",
		"label_uk": "Якщо дві площини перпендикулярні, то будь-яка пряма, перпендикулярна в одній до лінії перетину, перпендикулярна і до іншої площини."
	  },
	  {
		"id": "XI.10",
		"bookNumber": 11,
		"propositionNum": 10,
		"type": "theorem",
		"label_en": "If two lines are parallel and one is perpendicular to a plane, so is the other.",
		"label_uk": "Якщо одна з двох паралельних прямих перпендикулярна до площини, то й інша теж."
	  },
	  {
		"id": "XI.11",
		"bookNumber": 11,
		"propositionNum": 11,
		"type": "theorem",
		"label_en": "If a straight line is perpendicular to each of two straight lines at their intersection, then it is perpendicular to the plane they determine.",
		"label_uk": "Якщо пряма перпендикулярна до двох прямих у точці їх перетину, то вона перпендикулярна до площини, яку вони визначають."
	  },
	  {
		"id": "XI.12",
		"bookNumber": 11,
		"propositionNum": 12,
		"type": "theorem",
		"label_en": "Lines drawn in a plane from the foot of a perpendicular to various points are all less than the oblique lines.",
		"label_uk": "Усі похилі від точки до площини довші за перпендикуляр, а рівні похилі мають рівні проекції."
	  },
	  {
		"id": "XI.13",
		"bookNumber": 11,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "From a point above a plane, equal oblique lines meet the plane at equal distances from the foot of the perpendicular.",
		"label_uk": "Похилі однакової довжини від точки до площини перетинають її на однаковій відстані від основи перпендикуляра."
	  },
	  {
		"id": "XI.14",
		"bookNumber": 11,
		"propositionNum": 14,
		"type": "theorem",
		"label_en": "From a point not in a plane, the shortest line to the plane is perpendicular.",
		"label_uk": "З точки поза площиною найкоротша лінія до площини — перпендикуляр."
	  },
	  {
		"id": "XI.15",
		"bookNumber": 11,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "Two lines not in the same plane and not meeting are called skew lines.",
		"label_uk": "Дві прямі, що не лежать в одній площині й не перетинаються — мимобіжні."
	  },
	  {
		"id": "XI.16",
		"bookNumber": 11,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "Through a given point, only one plane can be drawn parallel to a given plane.",
		"label_uk": "Через задану точку можна провести лише одну площину, паралельну даній."
	  },
	  {
		"id": "XI.17",
		"bookNumber": 11,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "Two planes perpendicular to the same line are parallel.",
		"label_uk": "Дві площини, перпендикулярні до однієї прямої, паралельні між собою."
	  },
	  {
		"id": "XI.18",
		"bookNumber": 11,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "If a straight line is parallel to another line, it lies in a plane parallel to the plane of the other line.",
		"label_uk": "Якщо пряма паралельна до іншої, вона лежить у площині, паралельній площині другої прямої."
	  },
	  {
		"id": "XI.19",
		"bookNumber": 11,
		"propositionNum": 19,
		"type": "theorem",
		"label_en": "If a plane cuts two parallel planes, the lines of intersection are parallel.",
		"label_uk": "Якщо площина перетинає дві паралельні площини, то лінії перетину — паралельні."
	  },
	  {
		"id": "XI.20",
		"bookNumber": 11,
		"propositionNum": 20,
		"type": "theorem",
		"label_en": "Opposite edges of a parallelepiped are equal and parallel.",
		"label_uk": "Протилежні ребра паралелепіпеда рівні та паралельні."
	  },
	  {
		"id": "XI.21",
		"bookNumber": 11,
		"propositionNum": 21,
		"type": "theorem",
		"label_en": "Planes which pass through the same parallel lines are parallel.",
		"label_uk": "Площини, що проходять через одні й ті ж паралельні прямі — паралельні між собою."
	  },
	  {
		"id": "XI.22",
		"bookNumber": 11,
		"propositionNum": 22,
		"type": "theorem",
		"label_en": "If in a parallelepiped, three edges meet at a point, then the opposite faces are equal and parallel.",
		"label_uk": "У паралелепіпеді протилежні грані рівні та паралельні, якщо три ребра сходяться в одній точці."
	  },
	  {
		"id": "XI.23",
		"bookNumber": 11,
		"propositionNum": 23,
		"type": "theorem",
		"label_en": "In any parallelepiped, the opposite planes are equal and parallel.",
		"label_uk": "У будь-якому паралелепіпеді протилежні площини рівні та паралельні."
	  },
	  {
		"id": "XI.24",
		"bookNumber": 11,
		"propositionNum": 24,
		"type": "theorem",
		"label_en": "Parallelepipeds which are on the same base and of the same height and standing between the same parallels are equal in volume.",
		"label_uk": "Паралелепіпеди на одній основі й висоті, між паралельними площинами, мають рівні об'єми."
	  },
	  {
		"id": "XI.25",
		"bookNumber": 11,
		"propositionNum": 25,
		"type": "theorem",
		"label_en": "If a solid is cut by a plane parallel to opposite planes, the sections are equal and similar.",
		"label_uk": "Якщо тіло розсічено площиною, паралельною протилежним граням, то перерізи рівні та подібні."
	  },
	  {
		"id": "XI.26",
		"bookNumber": 11,
		"propositionNum": 26,
		"type": "theorem",
		"label_en": "Parallelepipeds on equal bases and equal heights are equal in volume.",
		"label_uk": "Паралелепіпеди на рівних основах і однакової висоти мають рівні об'єми."
	  },
	  {
		"id": "XI.27",
		"bookNumber": 11,
		"propositionNum": 27,
		"type": "theorem",
		"label_en": "Parallelepipeds on equal bases and equal heights are equal regardless of shape.",
		"label_uk": "Паралелепіпеди на рівних основах і висоті рівні незалежно від форми."
	  },
	  {
		"id": "XI.28",
		"bookNumber": 11,
		"propositionNum": 28,
		"type": "theorem",
		"label_en": "If a parallelepiped is cut by a plane through the diagonals of opposite faces, it is bisected.",
		"label_uk": "Якщо паралелепіпед розсічено площиною через діагоналі протилежних граней, то він поділяється навпіл."
	  },
	  {
		"id": "XI.29",
		"bookNumber": 11,
		"propositionNum": 29,
		"type": "theorem",
		"label_en": "In a parallelepiped, the diagonals bisect each other.",
		"label_uk": "У паралелепіпеді діагоналі перетинаються в середині."
	  },
	  {
		"id": "XI.30",
		"bookNumber": 11,
		"propositionNum": 30,
		"type": "theorem",
		"label_en": "The opposite sides of a cube are equal and parallel.",
		"label_uk": "Протилежні сторони куба рівні та паралельні."
	  },
	  {
		"id": "XI.31",
		"bookNumber": 11,
		"propositionNum": 31,
		"type": "theorem",
		"label_en": "In a cube, all faces are equal squares.",
		"label_uk": "У кубі всі грані — рівні квадрати."
	  },
	  {
		"id": "XI.32",
		"bookNumber": 11,
		"propositionNum": 32,
		"type": "theorem",
		"label_en": "In a cube, all angles between faces are right angles.",
		"label_uk": "У кубі всі кути між гранями — прямі."
	  },
	  {
		"id": "XI.33",
		"bookNumber": 11,
		"propositionNum": 33,
		"type": "theorem",
		"label_en": "The diagonal of a cube is longer than the side and the face diagonal.",
		"label_uk": "Діагональ куба довша за його ребро і діагональ грані."
	  },
	  {
		"id": "XI.34",
		"bookNumber": 11,
		"propositionNum": 34,
		"type": "theorem",
		"label_en": "The ratio of similar solids is equal to the triplicate ratio of corresponding sides.",
		"label_uk": "Співвідношення подібних тіл — як куб співвідношення відповідних сторін."
	  },
	  {
		"id": "XI.35",
		"bookNumber": 11,
		"propositionNum": 35,
		"type": "theorem",
		"label_en": "If solids are similar, their volumes are in the cube of the ratio of corresponding sides.",
		"label_uk": "Об'єми подібних тіл відносяться як куб відношення сторін."
	  },
	  {
		"id": "XI.36",
		"bookNumber": 11,
		"propositionNum": 36,
		"type": "theorem",
		"label_en": "If two cubes have equal volumes, their edges are equal.",
		"label_uk": "Якщо об'єми двох кубів рівні — то рівні й їхні ребра."
	  },
	  {
		"id": "XI.37",
		"bookNumber": 11,
		"propositionNum": 37,
		"type": "theorem",
		"label_en": "To find the common section of two intersecting planes.",
		"label_uk": "Знайти лінію перетину двох площин, що перетинаються."
	  },
	  {
		"id": "XI.38",
		"bookNumber": 11,
		"propositionNum": 38,
		"type": "theorem",
		"label_en": "To draw a plane through a given line perpendicular to a given plane.",
		"label_uk": "Провести площину через дану пряму перпендикулярно до заданої площини."
	  },
	  {
		"id": "XI.39",
		"bookNumber": 11,
		"propositionNum": 39,
		"type": "theorem",
		"label_en": "To draw a line perpendicular to two given lines not in the same plane.",
		"label_uk": "Провести пряму, перпендикулярну до двох заданих, що не лежать в одній площині."
	  },
	  {
		"id": "XI.40",
		"bookNumber": 11,
		"propositionNum": 40,
		"type": "theorem",
		"label_en": "If a line is perpendicular to each of two lines not in the same plane, it is perpendicular to the plane through them.",
		"label_uk": "Якщо пряма перпендикулярна до двох прямих, що не в одній площині — вона перпендикулярна до площини, яку ті утворюють."
	  },
	  {
		"id": "XI.41",
		"bookNumber": 11,
		"propositionNum": 41,
		"type": "theorem",
		"label_en": "To find the angle between two planes.",
		"label_uk": "Знайти кут між двома площинами."
	  },
	  {
		"id": "XI.42",
		"bookNumber": 11,
		"propositionNum": 42,
		"type": "theorem",
		"label_en": "To define the angle between a line and a plane.",
		"label_uk": "Визначити кут між прямою та площиною."
	  },
	  {
		"id": "XI.43",
		"bookNumber": 11,
		"propositionNum": 43,
		"type": "theorem",
		"label_en": "If a line is oblique to a plane, the perpendicular is shorter.",
		"label_uk": "Якщо пряма похила до площини — то перпендикуляр до неї коротший."
	  },
	  {
		"id": "XI.44",
		"bookNumber": 11,
		"propositionNum": 44,
		"type": "theorem",
		"label_en": "If a perpendicular is dropped from the vertex of a triangle in space, it is shorter than obliques.",
		"label_uk": "Перпендикуляр, опущений з вершини просторового трикутника, коротший за похилі."
	  },
	  {
		"id": "XI.45",
		"bookNumber": 11,
		"propositionNum": 45,
		"type": "theorem",
		"label_en": "In any parallelepiped, the solid angle is less than four right angles.",
		"label_uk": "Твердий кут у паралелепіпеді менший за чотири прямі кути."
	  },
	  {
		"id": "XI.46",
		"bookNumber": 11,
		"propositionNum": 46,
		"type": "theorem",
		"label_en": "The sum of the plane angles forming any solid angle is less than four right angles.",
		"label_uk": "Сума площинних кутів, що утворюють твердий кут, менша за чотири прямі кути."
	  },
	  {
		"id": "XI.47",
		"bookNumber": 11,
		"propositionNum": 47,
		"type": "theorem",
		"label_en": "In any solid figure bounded by plane faces, the sum of the angles around each vertex is less than 360°.",
		"label_uk": "У будь-якому тілі, обмеженому площинами, сума кутів при кожній вершині менша за 360°."
	  },
	  {
		"id": "XI.48",
		"bookNumber": 11,
		"propositionNum": 48,
		"type": "theorem",
		"label_en": "If three planes meet at a point and form solid angle, their intersections are straight lines.",
		"label_uk": "Якщо три площини сходяться в точці й утворюють твердий кут, їхні перетини — прямі лінії."
	  },
	  {
		"id": "XI.49",
		"bookNumber": 11,
		"propositionNum": 49,
		"type": "theorem",
		"label_en": "Any solid bounded by six equal squares is a cube.",
		"label_uk": "Тіло, обмежене шістьма рівними квадратами, — куб."
	  },
	  {
		"id": "XI.50",
		"bookNumber": 11,
		"propositionNum": 50,
		"type": "theorem",
		"label_en": "If a parallelepiped is cut by a plane through opposite edges, the section is a parallelogram.",
		"label_uk": "Якщо паралелепіпед перетинається площиною через протилежні ребра — переріз буде паралелограмом."
	  },
	  {
		"id": "XI.51",
		"bookNumber": 11,
		"propositionNum": 51,
		"type": "theorem",
		"label_en": "The diagonals of a rectangular parallelepiped are equal.",
		"label_uk": "Діагоналі прямокутного паралелепіпеда рівні."
	  },
	  {
		"id": "XI.52",
		"bookNumber": 11,
		"propositionNum": 52,
		"type": "theorem",
		"label_en": "If two cubes have equal volumes, their sides are equal.",
		"label_uk": "Якщо об'єми двох кубів рівні, то рівні й їхні сторони."
	  },
	  {
		"id": "XI.53",
		"bookNumber": 11,
		"propositionNum": 53,
		"type": "theorem",
		"label_en": "Any cube has all its diagonals equal.",
		"label_uk": "У будь-якому кубі всі діагоналі рівні."
	  },
	  {
		"id": "XI.54",
		"bookNumber": 11,
		"propositionNum": 54,
		"type": "theorem",
		"label_en": "The volume of a parallelepiped is the product of base and height.",
		"label_uk": "Об’єм паралелепіпеда дорівнює добутку площі основи на висоту."
	  },
	  {
		"id": "XII.1",
		"bookNumber": 12,
		"propositionNum": 1,
		"type": "theorem",
		"label_en": "Similar polygons inscribed in circles are in the duplicate ratio of their sides.",
		"label_uk": "Подібні многокутники, вписані в кола, відносяться як квадрати відповідних сторін."
	  },
	  {
		"id": "XII.2",
		"bookNumber": 12,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "Circles are to one another as the squares on their diameters.",
		"label_uk": "Кола відносяться одне до одного як квадрати їхніх діаметрів."
	  },
	  {
		"id": "XII.3",
		"bookNumber": 12,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "If two cones (or cylinders) have equal heights, they are to one another as the bases.",
		"label_uk": "Якщо два конуси або циліндри мають однакову висоту, то вони відносяться як їхні основи."
	  },
	  {
		"id": "XII.4",
		"bookNumber": 12,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "If two cones (or cylinders) are similar, they are to one another as the cubes of their heights.",
		"label_uk": "Подібні конуси або циліндри відносяться як куби їхніх висот."
	  },
	  {
		"id": "XII.5",
		"bookNumber": 12,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "Pyramids on equal bases and of the same height are equal in volume.",
		"label_uk": "Піраміди з однаковою основою і висотою мають рівні об'єми."
	  },
	  {
		"id": "XII.6",
		"bookNumber": 12,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "Pyramids of the same height are to one another as their bases.",
		"label_uk": "Піраміди однакової висоти відносяться як їхні основи."
	  },
	  {
		"id": "XII.7",
		"bookNumber": 12,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "A cone is a third part of a cylinder on the same base and of equal height.",
		"label_uk": "Конус становить третину циліндра на тій самій основі і висоті."
	  },
	  {
		"id": "XII.8",
		"bookNumber": 12,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "A pyramid is a third part of the prism on the same base and of equal height.",
		"label_uk": "Піраміда становить третину призми з тією ж основою та висотою."
	  },
	  {
		"id": "XII.9",
		"bookNumber": 12,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "Spheres are to one another as the cubes of their diameters.",
		"label_uk": "Сфери відносяться як куби їхніх діаметрів."
	  },
	  {
		"id": "XII.10",
		"bookNumber": 12,
		"propositionNum": 10,
		"type": "theorem",
		"label_en": "Any cone is one-third part of the cylinder on the same base and height.",
		"label_uk": "Кожен конус дорівнює третині відповідного циліндра на тій самій основі й висоті."
	  },
	  {
		"id": "XII.11",
		"bookNumber": 12,
		"propositionNum": 11,
		"type": "theorem",
		"label_en": "A cone is equal to a third of the cylinder having the same base and height.",
		"label_uk": "Конус дорівнює третині циліндра з такою самою основою й висотою."
	  },
	  {
		"id": "XII.12",
		"bookNumber": 12,
		"propositionNum": 12,
		"type": "theorem",
		"label_en": "Similar cones and cylinders are to one another as the cubes of their heights or diameters.",
		"label_uk": "Подібні конуси й циліндри відносяться як куби їхніх висот або діаметрів."
	  },
	  {
		"id": "XII.13",
		"bookNumber": 12,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "A sphere is less than any cylinder that surrounds it.",
		"label_uk": "Куля менша за будь-який циліндр, який її обмежує."
	  },
	  {
		"id": "XII.14",
		"bookNumber": 12,
		"propositionNum": 14,
		"type": "theorem",
		"label_en": "To construct a sphere that fits in a given cylinder.",
		"label_uk": "Побудувати кулю, яка вписується в даний циліндр."
	  },
	  {
		"id": "XII.15",
		"bookNumber": 12,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "The volume of a sphere is two-thirds that of the cylinder that encloses it.",
		"label_uk": "Об'єм кулі дорівнює двом третинам об'єму циліндра, що її описує."
	  },
	  {
		"id": "XII.16",
		"bookNumber": 12,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "To show that a segment of a sphere has a specific ratio to the whole.",
		"label_uk": "Показати, що сферичний сегмент має певне відношення до всієї кулі."
	  },
	  {
		"id": "XII.17",
		"bookNumber": 12,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "The surface of a sphere is equal to four times the greatest circle in it.",
		"label_uk": "Поверхня кулі дорівнює чотирьом площам великого кола в ній."
	  },
	  {
		"id": "XII.18",
		"bookNumber": 12,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "The volume of a sphere is equal to four-thirds the volume of a cone with base equal to the sphere’s great circle and height equal to the radius.",
		"label_uk": "Об’єм кулі дорівнює чотирьом третинам об’єму конуса з основою як велике коло кулі і висотою як її радіус."
	  },
	  {
		"id": "XIII.1",
		"bookNumber": 13,
		"propositionNum": 1,
		"type": "theorem",
		"label_en": "In equilateral triangle, if from one side a segment is cut in extreme and mean ratio, and similar constructions are repeated, then segments have rational and irrational properties.",
		"label_uk": "У рівносторонньому трикутнику, якщо сторону поділити в крайньому й середньому відношенні, то утворені відрізки мають раціональні й ірраціональні властивості."
	  },
	  {
		"id": "XIII.2",
		"bookNumber": 13,
		"propositionNum": 2,
		"type": "theorem",
		"label_en": "If a straight line is divided in extreme and mean ratio, and square is constructed on whole and on greater part, their difference equals square on lesser part.",
		"label_uk": "Якщо пряма поділена в золотому перетині, то різниця квадратів на цілій і більшій частині дорівнює квадрату меншої частини."
	  },
	  {
		"id": "XIII.3",
		"bookNumber": 13,
		"propositionNum": 3,
		"type": "theorem",
		"label_en": "To show that the square on the whole line exceeds the sum of the squares on the parts cut in extreme and mean ratio.",
		"label_uk": "Квадрат цілої прямої, поділеної в золотому перетині, перевищує суму квадратів частин."
	  },
	  {
		"id": "XIII.4",
		"bookNumber": 13,
		"propositionNum": 4,
		"type": "theorem",
		"label_en": "To construct a triangle having its sides in the ratio of extreme and mean ratio.",
		"label_uk": "Побудувати трикутник із сторонами у відношенні крайнього і середнього (золотого перетину)."
	  },
	  {
		"id": "XIII.5",
		"bookNumber": 13,
		"propositionNum": 5,
		"type": "theorem",
		"label_en": "To inscribe a regular pentagon in a given circle.",
		"label_uk": "Вписати правильний п’ятикутник у дане коло."
	  },
	  {
		"id": "XIII.6",
		"bookNumber": 13,
		"propositionNum": 6,
		"type": "theorem",
		"label_en": "To describe a regular pentagon about a given circle.",
		"label_uk": "Описати правильний п’ятикутник навколо даного кола."
	  },
	  {
		"id": "XIII.7",
		"bookNumber": 13,
		"propositionNum": 7,
		"type": "theorem",
		"label_en": "To inscribe a regular decagon in a given circle.",
		"label_uk": "Вписати правильний десятикутник у дане коло."
	  },
	  {
		"id": "XIII.8",
		"bookNumber": 13,
		"propositionNum": 8,
		"type": "theorem",
		"label_en": "To describe a regular decagon about a given circle.",
		"label_uk": "Описати правильний десятикутник навколо даного кола."
	  },
	  {
		"id": "XIII.9",
		"bookNumber": 13,
		"propositionNum": 9,
		"type": "theorem",
		"label_en": "To construct a regular 15-gon in a circle.",
		"label_uk": "Побудувати правильний 15-кутник у колі."
	  },
	  {
		"id": "XIII.10",
		"bookNumber": 13,
		"propositionNum": 10,
		"type": "theorem",
		"label_en": "To construct an isosceles triangle having each of the angles at the base double of the remaining angle.",
		"label_uk": "Побудувати рівнобедрений трикутник, у якому кожен кут при основі удвічі більший за вершиновий."
	  },
	  {
		"id": "XIII.11",
		"bookNumber": 13,
		"propositionNum": 11,
		"type": "theorem",
		"label_en": "To inscribe a regular tetrahedron in a given sphere.",
		"label_uk": "Вписати правильний тетраедр у дану сферу."
	  },
	  {
		"id": "XIII.12",
		"bookNumber": 13,
		"propositionNum": 12,
		"type": "theorem",
		"label_en": "To inscribe a cube in a given sphere.",
		"label_uk": "Вписати куб у задану сферу."
	  },
	  {
		"id": "XIII.13",
		"bookNumber": 13,
		"propositionNum": 13,
		"type": "theorem",
		"label_en": "To inscribe a regular octahedron in a given sphere.",
		"label_uk": "Вписати правильний октаедр у задану сферу."
	  },
	  {
		"id": "XIII.14",
		"bookNumber": 13,
		"propositionNum": 14,
		"type": "theorem",
		"label_en": "To construct a regular icosahedron and inscribe it in a sphere.",
		"label_uk": "Побудувати правильний ікосаедр і вписати його в сферу."
	  },
	  {
		"id": "XIII.15",
		"bookNumber": 13,
		"propositionNum": 15,
		"type": "theorem",
		"label_en": "To construct a regular dodecahedron and inscribe it in a sphere.",
		"label_uk": "Побудувати правильний додекаедр і вписати його в сферу."
	  },
	  {
		"id": "XIII.16",
		"bookNumber": 13,
		"propositionNum": 16,
		"type": "theorem",
		"label_en": "To prove that no other regular solid exists besides the five constructed.",
		"label_uk": "Довести, що не існує інших правильних тіл, окрім п’яти побудованих."
	  },
	  {
		"id": "XIII.17",
		"bookNumber": 13,
		"propositionNum": 17,
		"type": "theorem",
		"label_en": "The edge of the cube has to the edge of the icosahedron a specific ratio.",
		"label_uk": "Ребро куба й ребро ікосаедра мають певне відношення."
	  },
	  {
		"id": "XIII.18",
		"bookNumber": 13,
		"propositionNum": 18,
		"type": "theorem",
		"label_en": "The edge of the dodecahedron has to the edge of the cube a specific ratio.",
		"label_uk": "Ребро додекаедра й ребро куба мають певне відношення."
	  }
  	],
 "edges":[
	
	  { "from": "I.1", "to": "I.2", "type": "uses" },
	  { "from": "I.1", "to": "I.3", "type": "uses" },
	  { "from": "I.2", "to": "I.4", "type": "uses" },
	  { "from": "I.3", "to": "I.4", "type": "uses" },
	  { "from": "I.1", "to": "I.5", "type": "uses" },
	  { "from": "I.4", "to": "I.5", "type": "uses" },
	  
	  { "from": "I.4", "to": "I.6", "type": "uses" },
	  { "from": "I.5", "to": "I.6", "type": "uses" },

	  { "from": "I.3", "to": "I.7", "type": "uses" },
	  { "from": "I.4", "to": "I.7", "type": "uses" },
	  { "from": "I.6", "to": "I.7", "type": "uses" },

	  { "from": "I.4", "to": "I.8", "type": "uses" },
	  { "from": "I.5", "to": "I.8", "type": "uses" },
	  { "from": "I.6", "to": "I.8", "type": "uses" },
	  { "from": "I.7", "to": "I.8", "type": "uses" },

	  { "from": "I.1", "to": "I.9", "type": "uses" },
	  { "from": "I.2", "to": "I.9", "type": "uses" },
	  { "from": "I.4", "to": "I.9", "type": "uses" },

	  { "from": "I.1", "to": "I.10", "type": "uses" },
	  { "from": "I.9", "to": "I.10", "type": "uses" },
	  
	  { "from": "I.4", "to": "I.6", "type": "uses" },
	  { "from": "I.5", "to": "I.6", "type": "uses" },

	  { "from": "I.3", "to": "I.7", "type": "uses" },
	  { "from": "I.4", "to": "I.7", "type": "uses" },
	  { "from": "I.6", "to": "I.7", "type": "uses" },

	  { "from": "I.4", "to": "I.8", "type": "uses" },
	  { "from": "I.5", "to": "I.8", "type": "uses" },
	  { "from": "I.6", "to": "I.8", "type": "uses" },
	  { "from": "I.7", "to": "I.8", "type": "uses" },

	  { "from": "I.1", "to": "I.9", "type": "uses" },
	  { "from": "I.2", "to": "I.9", "type": "uses" },
	  { "from": "I.4", "to": "I.9", "type": "uses" },

	  { "from": "I.1", "to": "I.10", "type": "uses" },
	  { "from": "I.9", "to": "I.10", "type": "uses" },
	  
	  { "from": "I.1", "to": "I.11", "type": "uses" },
	  { "from": "I.4", "to": "I.11", "type": "uses" },
	  { "from": "I.9", "to": "I.11", "type": "uses" },
	  { "from": "I.10", "to": "I.11", "type": "uses" },

	  { "from": "I.1", "to": "I.12", "type": "uses" },
	  { "from": "I.2", "to": "I.12", "type": "uses" },
	  { "from": "I.9", "to": "I.12", "type": "uses" },
	  { "from": "I.11", "to": "I.12", "type": "uses" },

	  { "from": "I.11", "to": "I.13", "type": "uses" },
	  { "from": "I.12", "to": "I.13", "type": "uses" },

	  { "from": "I.5", "to": "I.14", "type": "uses" },
	  { "from": "I.6", "to": "I.14", "type": "uses" },
	  { "from": "I.12", "to": "I.14", "type": "uses" },
	  { "from": "I.13", "to": "I.14", "type": "uses" },

	  { "from": "I.13", "to": "I.15", "type": "uses" },
	  { "from": "I.14", "to": "I.15", "type": "uses" },
	  { "from": "I.4", "to": "I.15", "type": "uses" },
	  
	  { "from": "I.4", "to": "I.16", "type": "uses" },
	  { "from": "I.10", "to": "I.16", "type": "uses" },
	  { "from": "I.11", "to": "I.16", "type": "uses" },
	  { "from": "I.13", "to": "I.16", "type": "uses" },
	  { "from": "I.15", "to": "I.16", "type": "uses" },

	  { "from": "I.5", "to": "I.17", "type": "uses" },
	  { "from": "I.6", "to": "I.17", "type": "uses" },
	  { "from": "I.10", "to": "I.17", "type": "uses" },
	  { "from": "I.16", "to": "I.17", "type": "uses" },

	  { "from": "I.4", "to": "I.18", "type": "uses" },
	  { "from": "I.5", "to": "I.18", "type": "uses" },
	  { "from": "I.6", "to": "I.18", "type": "uses" },
	  { "from": "I.16", "to": "I.18", "type": "uses" },

	  { "from": "I.4", "to": "I.19", "type": "uses" },
	  { "from": "I.5", "to": "I.19", "type": "uses" },
	  { "from": "I.6", "to": "I.19", "type": "uses" },
	  { "from": "I.18", "to": "I.19", "type": "uses" },

	  { "from": "I.5", "to": "I.20", "type": "uses" },
	  { "from": "I.6", "to": "I.20", "type": "uses" },
	  { "from": "I.16", "to": "I.20", "type": "uses" },
	  { "from": "I.17", "to": "I.20", "type": "uses" },
	  { "from": "I.18", "to": "I.20", "type": "uses" },
	  { "from": "I.19", "to": "I.20", "type": "uses" },
	  
	  { "from": "I.13", "to": "I.21", "type": "uses" },
	  { "from": "I.15", "to": "I.21", "type": "uses" },
	  { "from": "I.16", "to": "I.21", "type": "uses" },
	  { "from": "I.18", "to": "I.21", "type": "uses" },
	  { "from": "I.19", "to": "I.21", "type": "uses" },

	  { "from": "I.1", "to": "I.22", "type": "uses" },
	  { "from": "I.2", "to": "I.22", "type": "uses" },
	  { "from": "I.3", "to": "I.22", "type": "uses" },
	  { "from": "I.20", "to": "I.22", "type": "uses" },

	  { "from": "I.1", "to": "I.23", "type": "uses" },
	  { "from": "I.2", "to": "I.23", "type": "uses" },
	  { "from": "I.3", "to": "I.23", "type": "uses" },
	  { "from": "I.4", "to": "I.23", "type": "uses" },

	  { "from": "I.4", "to": "I.24", "type": "uses" },
	  { "from": "I.5", "to": "I.24", "type": "uses" },
	  { "from": "I.6", "to": "I.24", "type": "uses" },
	  { "from": "I.19", "to": "I.24", "type": "uses" },
	  { "from": "I.20", "to": "I.24", "type": "uses" },

	  { "from": "I.5", "to": "I.25", "type": "uses" },
	  { "from": "I.6", "to": "I.25", "type": "uses" },
	  { "from": "I.18", "to": "I.25", "type": "uses" },
	  { "from": "I.19", "to": "I.25", "type": "uses" },
	  { "from": "I.20", "to": "I.25", "type": "uses" },
	  
	  { "from": "I.4", "to": "I.26", "type": "uses" },
	  { "from": "I.13", "to": "I.26", "type": "uses" },
	  { "from": "I.15", "to": "I.26", "type": "uses" },

	  { "from": "I.13", "to": "I.27", "type": "uses" },
	  { "from": "I.15", "to": "I.27", "type": "uses" },
	  { "from": "I.26", "to": "I.27", "type": "uses" },

	  { "from": "I.13", "to": "I.28", "type": "uses" },
	  { "from": "I.15", "to": "I.28", "type": "uses" },
	  { "from": "I.26", "to": "I.28", "type": "uses" },
	  { "from": "I.27", "to": "I.28", "type": "uses" },

	  { "from": "I.13", "to": "I.29", "type": "uses" },
	  { "from": "I.27", "to": "I.29", "type": "uses" },
	  { "from": "I.28", "to": "I.29", "type": "uses" },

	  { "from": "I.13", "to": "I.30", "type": "uses" },
	  { "from": "I.15", "to": "I.30", "type": "uses" },
	  { "from": "I.27", "to": "I.30", "type": "uses" },
	  { "from": "I.28", "to": "I.30", "type": "uses" },
	  { "from": "I.29", "to": "I.30", "type": "uses" },
	  
	  { "from": "I.23", "to": "I.31", "type": "uses" },
	  { "from": "I.26", "to": "I.31", "type": "uses" },
	  { "from": "I.27", "to": "I.31", "type": "uses" },
	  { "from": "I.28", "to": "I.31", "type": "uses" },
	  { "from": "I.29", "to": "I.31", "type": "uses" },

	  { "from": "I.13", "to": "I.32", "type": "uses" },
	  { "from": "I.15", "to": "I.32", "type": "uses" },
	  { "from": "I.29", "to": "I.32", "type": "uses" },
	  { "from": "I.31", "to": "I.32", "type": "uses" },

	  { "from": "I.4", "to": "I.33", "type": "uses" },
	  { "from": "I.26", "to": "I.33", "type": "uses" },
	  { "from": "I.31", "to": "I.33", "type": "uses" },
	  { "from": "I.32", "to": "I.33", "type": "uses" },

	  { "from": "I.4", "to": "I.34", "type": "uses" },
	  { "from": "I.15", "to": "I.34", "type": "uses" },
	  { "from": "I.26", "to": "I.34", "type": "uses" },
	  { "from": "I.33", "to": "I.34", "type": "uses" },

	  { "from": "I.4", "to": "I.35", "type": "uses" },
	  { "from": "I.26", "to": "I.35", "type": "uses" },
	  { "from": "I.29", "to": "I.35", "type": "uses" },
	  { "from": "I.32", "to": "I.35", "type": "uses" },
	  { "from": "I.33", "to": "I.35", "type": "uses" },
	  { "from": "I.34", "to": "I.35", "type": "uses" },
	  
	  { "from": "I.29", "to": "I.36", "type": "uses" },
	  { "from": "I.33", "to": "I.36", "type": "uses" },
	  { "from": "I.34", "to": "I.36", "type": "uses" },
	  { "from": "I.35", "to": "I.36", "type": "uses" },

	  { "from": "I.4", "to": "I.37", "type": "uses" },
	  { "from": "I.26", "to": "I.37", "type": "uses" },
	  { "from": "I.29", "to": "I.37", "type": "uses" },
	  { "from": "I.33", "to": "I.37", "type": "uses" },
	  { "from": "I.35", "to": "I.37", "type": "uses" },

	  { "from": "I.4", "to": "I.38", "type": "uses" },
	  { "from": "I.26", "to": "I.38", "type": "uses" },
	  { "from": "I.29", "to": "I.38", "type": "uses" },
	  { "from": "I.32", "to": "I.38", "type": "uses" },
	  { "from": "I.37", "to": "I.38", "type": "uses" },

	  { "from": "I.13", "to": "I.39", "type": "uses" },
	  { "from": "I.29", "to": "I.39", "type": "uses" },
	  { "from": "I.32", "to": "I.39", "type": "uses" },
	  { "from": "I.37", "to": "I.39", "type": "uses" },

	  { "from": "I.13", "to": "I.40", "type": "uses" },
	  { "from": "I.29", "to": "I.40", "type": "uses" },
	  { "from": "I.32", "to": "I.40", "type": "uses" },
	  { "from": "I.38", "to": "I.40", "type": "uses" },
	  { "from": "I.39", "to": "I.40", "type": "uses" },
	  
	  { "from": "I.29", "to": "I.41", "type": "uses" },
	  { "from": "I.33", "to": "I.41", "type": "uses" },
	  { "from": "I.35", "to": "I.41", "type": "uses" },
	  { "from": "I.36", "to": "I.41", "type": "uses" },

	  { "from": "I.9", "to": "I.42", "type": "uses" },
	  { "from": "I.10", "to": "I.42", "type": "uses" },
	  { "from": "I.11", "to": "I.42", "type": "uses" },
	  { "from": "I.26", "to": "I.42", "type": "uses" },
	  { "from": "I.33", "to": "I.42", "type": "uses" },
	  { "from": "I.35", "to": "I.42", "type": "uses" },
	  { "from": "I.36", "to": "I.42", "type": "uses" },
	  { "from": "I.41", "to": "I.42", "type": "uses" },

	  { "from": "I.4", "to": "I.43", "type": "uses" },
	  { "from": "I.26", "to": "I.43", "type": "uses" },
	  { "from": "I.29", "to": "I.43", "type": "uses" },
	  { "from": "I.33", "to": "I.43", "type": "uses" },
	  { "from": "I.34", "to": "I.43", "type": "uses" },
	  { "from": "I.41", "to": "I.43", "type": "uses" },

	  { "from": "I.23", "to": "I.44", "type": "uses" },
	  { "from": "I.26", "to": "I.44", "type": "uses" },
	  { "from": "I.33", "to": "I.44", "type": "uses" },
	  { "from": "I.35", "to": "I.44", "type": "uses" },
	  { "from": "I.36", "to": "I.44", "type": "uses" },
	  { "from": "I.42", "to": "I.44", "type": "uses" },

	  { "from": "I.1", "to": "I.45", "type": "uses" },
	  { "from": "I.9", "to": "I.45", "type": "uses" },
	  { "from": "I.10", "to": "I.45", "type": "uses" },
	  { "from": "I.35", "to": "I.45", "type": "uses" },
	  { "from": "I.36", "to": "I.45", "type": "uses" },
	  { "from": "I.42", "to": "I.45", "type": "uses" },
	  { "from": "I.44", "to": "I.45", "type": "uses" },
	  
	  { "from": "I.3", "to": "I.46", "type": "uses" },
	  { "from": "I.10", "to": "I.46", "type": "uses" },
	  { "from": "I.11", "to": "I.46", "type": "uses" },
	  { "from": "I.14", "to": "I.46", "type": "uses" },
	  { "from": "I.29", "to": "I.46", "type": "uses" },
	  { "from": "I.31", "to": "I.46", "type": "uses" },
	  { "from": "I.33", "to": "I.46", "type": "uses" },
	  { "from": "I.34", "to": "I.46", "type": "uses" },
	  { "from": "I.41", "to": "I.46", "type": "uses" },

	  { "from": "I.4", "to": "I.47", "type": "uses" },
	  { "from": "I.10", "to": "I.47", "type": "uses" },
	  { "from": "I.29", "to": "I.47", "type": "uses" },
	  { "from": "I.41", "to": "I.47", "type": "uses" },
	  { "from": "I.46", "to": "I.47", "type": "uses" },

	  { "from": "I.10", "to": "I.48", "type": "uses" },
	  { "from": "I.41", "to": "I.48", "type": "uses" },
	  { "from": "I.46", "to": "I.48", "type": "uses" },
	  { "from": "I.47", "to": "I.48", "type": "uses" },
	  
	  { "from": "I.9", "to": "II.1", "type": "uses" },
	  { "from": "I.10", "to": "II.1", "type": "uses" },
	  { "from": "I.41", "to": "II.1", "type": "uses" },
	  { "from": "I.42", "to": "II.1", "type": "uses" },
	  { "from": "I.43", "to": "II.1", "type": "uses" },
	  { "from": "I.45", "to": "II.1", "type": "uses" },

	  { "from": "I.9", "to": "II.2", "type": "uses" },
	  { "from": "I.10", "to": "II.2", "type": "uses" },
	  { "from": "I.45", "to": "II.2", "type": "uses" },
	  { "from": "II.1", "to": "II.2", "type": "uses" },

	  { "from": "I.9", "to": "II.3", "type": "uses" },
	  { "from": "I.10", "to": "II.3", "type": "uses" },
	  { "from": "I.45", "to": "II.3", "type": "uses" },
	  { "from": "II.1", "to": "II.3", "type": "uses" },
	  { "from": "II.2", "to": "II.3", "type": "uses" },

	  { "from": "I.10", "to": "II.4", "type": "uses" },
	  { "from": "I.45", "to": "II.4", "type": "uses" },
	  { "from": "II.3", "to": "II.4", "type": "uses" },

	  { "from": "I.4", "to": "II.5", "type": "uses" },
	  { "from": "I.41", "to": "II.5", "type": "uses" },
	  { "from": "I.42", "to": "II.5", "type": "uses" },
	  { "from": "I.47", "to": "II.5", "type": "uses" },
	  
	  { "from": "I.10", "to": "II.6", "type": "uses" },
	  { "from": "I.45", "to": "II.6", "type": "uses" },
	  { "from": "II.3", "to": "II.6", "type": "uses" },
	  { "from": "II.4", "to": "II.6", "type": "uses" },

	  { "from": "I.35", "to": "II.7", "type": "uses" },
	  { "from": "I.41", "to": "II.7", "type": "uses" },
	  { "from": "I.45", "to": "II.7", "type": "uses" },
	  { "from": "II.1", "to": "II.7", "type": "uses" },
	  { "from": "II.3", "to": "II.7", "type": "uses" },

	  { "from": "I.35", "to": "II.8", "type": "uses" },
	  { "from": "I.41", "to": "II.8", "type": "uses" },
	  { "from": "I.45", "to": "II.8", "type": "uses" },
	  { "from": "II.3", "to": "II.8", "type": "uses" },
	  { "from": "II.4", "to": "II.8", "type": "uses" },

	  { "from": "I.10", "to": "II.9", "type": "uses" },
	  { "from": "I.45", "to": "II.9", "type": "uses" },
	  { "from": "II.3", "to": "II.9", "type": "uses" },
	  { "from": "II.4", "to": "II.9", "type": "uses" },
	  { "from": "II.7", "to": "II.9", "type": "uses" },
	  { "from": "II.8", "to": "II.9", "type": "uses" },

	  { "from": "I.9", "to": "II.10", "type": "uses" },
	  { "from": "I.10", "to": "II.10", "type": "uses" },
	  { "from": "I.45", "to": "II.10", "type": "uses" },
	  { "from": "II.1", "to": "II.10", "type": "uses" },
	  { "from": "II.3", "to": "II.10", "type": "uses" },
	  { "from": "II.6", "to": "II.10", "type": "uses" },
	  
	  { "from": "I.47", "to": "II.11", "type": "uses" },
	  { "from": "I.48", "to": "II.11", "type": "uses" },
	  { "from": "II.5", "to": "II.11", "type": "uses" },
	  { "from": "II.6", "to": "II.11", "type": "uses" },
	  { "from": "V.5", "to": "II.11", "type": "uses" },

	  { "from": "I.43", "to": "II.12", "type": "uses" },
	  { "from": "II.4", "to": "II.12", "type": "uses" },
	  { "from": "II.7", "to": "II.12", "type": "uses" },
	  { "from": "II.11", "to": "II.12", "type": "uses" },

	  { "from": "I.47", "to": "II.13", "type": "uses" },
	  { "from": "II.12", "to": "II.13", "type": "uses" },

	  { "from": "I.42", "to": "II.14", "type": "uses" },
	  { "from": "II.5", "to": "II.14", "type": "uses" },
	  { "from": "II.7", "to": "II.14", "type": "uses" }
	  
	  { "from": "I.4", "to": "III.1", "type": "uses" },
	  { "from": "I.5", "to": "III.1", "type": "uses" },
	  { "from": "I.10", "to": "III.1", "type": "uses" },
	  { "from": "I.15", "to": "III.1", "type": "uses" },
	  { "from": "I.20", "to": "III.1", "type": "uses" },

	  { "from": "I.1", "to": "III.2", "type": "uses" },
	  { "from": "I.4", "to": "III.2", "type": "uses" },
	  { "from": "I.5", "to": "III.2", "type": "uses" },
	  { "from": "I.6", "to": "III.2", "type": "uses" },
	  { "from": "III.1", "to": "III.2", "type": "uses" },

	  { "from": "I.4", "to": "III.3", "type": "uses" },
	  { "from": "I.5", "to": "III.3", "type": "uses" },
	  { "from": "I.6", "to": "III.3", "type": "uses" },
	  { "from": "I.10", "to": "III.3", "type": "uses" },
	  { "from": "III.2", "to": "III.3", "type": "uses" },

	  { "from": "I.5", "to": "III.4", "type": "uses" },
	  { "from": "I.6", "to": "III.4", "type": "uses" },
	  { "from": "I.18", "to": "III.4", "type": "uses" },
	  { "from": "I.19", "to": "III.4", "type": "uses" },
	  { "from": "III.3", "to": "III.4", "type": "uses" },

	  { "from": "I.4", "to": "III.5", "type": "uses" },
	  { "from": "I.6", "to": "III.5", "type": "uses" },
	  { "from": "I.10", "to": "III.5", "type": "uses" },
	  { "from": "I.11", "to": "III.5", "type": "uses" },
	  { "from": "I.15", "to": "III.5", "type": "uses" },
	  { "from": "III.3", "to": "III.5", "type": "uses" },
	  { "from": "III.4", "to": "III.5", "type": "uses" },
	  
	  { "from": "I.4", "to": "III.6", "type": "uses" },
	  { "from": "I.10", "to": "III.6", "type": "uses" },
	  { "from": "I.11", "to": "III.6", "type": "uses" },
	  { "from": "I.15", "to": "III.6", "type": "uses" },
	  { "from": "III.3", "to": "III.6", "type": "uses" },
	  { "from": "III.5", "to": "III.6", "type": "uses" },

	  { "from": "I.4", "to": "III.7", "type": "uses" },
	  { "from": "I.6", "to": "III.7", "type": "uses" },
	  { "from": "I.10", "to": "III.7", "type": "uses" },
	  { "from": "I.11", "to": "III.7", "type": "uses" },
	  { "from": "I.15", "to": "III.7", "type": "uses" },
	  { "from": "III.3", "to": "III.7", "type": "uses" },
	  { "from": "III.5", "to": "III.7", "type": "uses" },
	  { "from": "III.6", "to": "III.7", "type": "uses" },

	  { "from": "I.5", "to": "III.8", "type": "uses" },
	  { "from": "I.6", "to": "III.8", "type": "uses" },
	  { "from": "I.18", "to": "III.8", "type": "uses" },
	  { "from": "I.19", "to": "III.8", "type": "uses" },
	  { "from": "III.3", "to": "III.8", "type": "uses" },
	  { "from": "III.4", "to": "III.8", "type": "uses" },
	  { "from": "III.6", "to": "III.8", "type": "uses" },

	  { "from": "I.1", "to": "III.9", "type": "uses" },
	  { "from": "I.10", "to": "III.9", "type": "uses" },
	  { "from": "I.11", "to": "III.9", "type": "uses" },
	  { "from": "I.12", "to": "III.9", "type": "uses" },
	  { "from": "I.26", "to": "III.9", "type": "uses" },
	  { "from": "III.6", "to": "III.9", "type": "uses" },
	  { "from": "III.7", "to": "III.9", "type": "uses" },

	  { "from": "I.4", "to": "III.10", "type": "uses" },
	  { "from": "I.26", "to": "III.10", "type": "uses" },
	  { "from": "III.3", "to": "III.10", "type": "uses" },
	  { "from": "III.6", "to": "III.10", "type": "uses" },
	  { "from": "III.8", "to": "III.10", "type": "uses" },

	  { "from": "I.16", "to": "III.11", "type": "uses" },
	  { "from": "I.17", "to": "III.11", "type": "uses" },
	  { "from": "I.19", "to": "III.11", "type": "uses" },
	  { "from": "I.20", "to": "III.11", "type": "uses" },
	  { "from": "III.1", "to": "III.11", "type": "uses" },
	  { "from": "III.5", "to": "III.11", "type": "uses" },
	  { "from": "III.9", "to": "III.11", "type": "uses" },
	  
	  { "from": "I.16", "to": "III.12", "type": "uses" },
	  { "from": "I.19", "to": "III.12", "type": "uses" },
	  { "from": "I.20", "to": "III.12", "type": "uses" },
	  { "from": "III.5", "to": "III.12", "type": "uses" },
	  { "from": "III.11", "to": "III.12", "type": "uses" },

	  { "from": "I.10", "to": "III.13", "type": "uses" },
	  { "from": "I.11", "to": "III.13", "type": "uses" },
	  { "from": "I.15", "to": "III.13", "type": "uses" },
	  { "from": "III.5", "to": "III.13", "type": "uses" },
	  { "from": "III.11", "to": "III.13", "type": "uses" },
	  { "from": "III.12", "to": "III.13", "type": "uses" },

	  { "from": "I.4", "to": "III.14", "type": "uses" },
	  { "from": "I.16", "to": "III.14", "type": "uses" },
	  { "from": "I.17", "to": "III.14", "type": "uses" },
	  { "from": "I.19", "to": "III.14", "type": "uses" },
	  { "from": "III.5", "to": "III.14", "type": "uses" },
	  { "from": "III.11", "to": "III.14", "type": "uses" },
	  { "from": "III.13", "to": "III.14", "type": "uses" },

	  { "from": "I.16", "to": "III.15", "type": "uses" },
	  { "from": "I.20", "to": "III.15", "type": "uses" },
	  { "from": "III.11", "to": "III.15", "type": "uses" },
	  { "from": "III.12", "to": "III.15", "type": "uses" },
	  { "from": "III.13", "to": "III.15", "type": "uses" },
	  { "from": "III.14", "to": "III.15", "type": "uses" },

	  { "from": "I.16", "to": "III.16", "type": "uses" },
	  { "from": "I.19", "to": "III.16", "type": "uses" },
	  { "from": "III.11", "to": "III.16", "type": "uses" },
	  { "from": "III.12", "to": "III.16", "type": "uses" },
	  { "from": "III.15", "to": "III.16", "type": "uses" },

	  { "from": "I.20", "to": "III.17", "type": "uses" },
	  { "from": "I.26", "to": "III.17", "type": "uses" },
	  { "from": "I.29", "to": "III.17", "type": "uses" },
	  { "from": "III.12", "to": "III.17", "type": "uses" },
	  { "from": "III.13", "to": "III.17", "type": "uses" },
	  { "from": "III.14", "to": "III.17", "type": "uses" },
	  { "from": "III.15", "to": "III.17", "type": "uses" },
	  { "from": "III.16", "to": "III.17", "type": "uses" },
	  
		{ "from": "I.4", "to": "III.18", "type": "uses" },
	  { "from": "I.29", "to": "III.18", "type": "uses" },
	  { "from": "I.32", "to": "III.18", "type": "uses" },
	  { "from": "III.13", "to": "III.18", "type": "uses" },
	  { "from": "III.14", "to": "III.18", "type": "uses" },
	  { "from": "III.17", "to": "III.18", "type": "uses" },

	  { "from": "I.5", "to": "III.19", "type": "uses" },
	  { "from": "I.6", "to": "III.19", "type": "uses" },
	  { "from": "I.13", "to": "III.19", "type": "uses" },
	  { "from": "I.15", "to": "III.19", "type": "uses" },
	  { "from": "I.32", "to": "III.19", "type": "uses" },
	  { "from": "III.18", "to": "III.19", "type": "uses" },

	  { "from": "I.16", "to": "III.20", "type": "uses" },
	  { "from": "I.18", "to": "III.20", "type": "uses" },
	  { "from": "I.20", "to": "III.20", "type": "uses" },
	  { "from": "III.18", "to": "III.20", "type": "uses" },
	  { "from": "III.19", "to": "III.20", "type": "uses" },

	  { "from": "I.4", "to": "III.21", "type": "uses" },
	  { "from": "I.26", "to": "III.21", "type": "uses" },
	  { "from": "III.10", "to": "III.21", "type": "uses" },
	  { "from": "III.19", "to": "III.21", "type": "uses" },
	  { "from": "III.20", "to": "III.21", "type": "uses" },

	  { "from": "I.26", "to": "III.22", "type": "uses" },
	  { "from": "I.32", "to": "III.22", "type": "uses" },
	  { "from": "III.19", "to": "III.22", "type": "uses" },
	  { "from": "III.21", "to": "III.22", "type": "uses" },

	  { "from": "I.26", "to": "III.23", "type": "uses" },
	  { "from": "III.10", "to": "III.23", "type": "uses" },
	  { "from": "III.21", "to": "III.23", "type": "uses" },
	  { "from": "III.22", "to": "III.23", "type": "uses" },

	  { "from": "I.10", "to": "III.24", "type": "uses" },
	  { "from": "I.20", "to": "III.24", "type": "uses" },
	  { "from": "III.1", "to": "III.24", "type": "uses" },
	  { "from": "III.6", "to": "III.24", "type": "uses" },
	  { "from": "III.10", "to": "III.24", "type": "uses" },
	  
	  { "from": "I.16", "to": "III.25", "type": "uses" },
	  { "from": "I.20", "to": "III.25", "type": "uses" },
	  { "from": "I.32", "to": "III.25", "type": "uses" },
	  { "from": "III.18", "to": "III.25", "type": "uses" },
	  { "from": "III.19", "to": "III.25", "type": "uses" },
	  { "from": "III.20", "to": "III.25", "type": "uses" },

	  { "from": "I.18", "to": "III.26", "type": "uses" },
	  { "from": "I.20", "to": "III.26", "type": "uses" },
	  { "from": "III.10", "to": "III.26", "type": "uses" },
	  { "from": "III.19", "to": "III.26", "type": "uses" },
	  { "from": "III.20", "to": "III.26", "type": "uses" },
	  { "from": "III.25", "to": "III.26", "type": "uses" },

	  { "from": "I.4", "to": "III.27", "type": "uses" },
	  { "from": "I.26", "to": "III.27", "type": "uses" },
	  { "from": "III.10", "to": "III.27", "type": "uses" },
	  { "from": "III.21", "to": "III.27", "type": "uses" },
	  { "from": "III.22", "to": "III.27", "type": "uses" },

	  { "from": "I.20", "to": "III.28", "type": "uses" },
	  { "from": "I.26", "to": "III.28", "type": "uses" },
	  { "from": "III.14", "to": "III.28", "type": "uses" },
	  { "from": "III.16", "to": "III.28", "type": "uses" },
	  { "from": "III.17", "to": "III.28", "type": "uses" },

	  { "from": "I.4", "to": "III.29", "type": "uses" },
	  { "from": "I.20", "to": "III.29", "type": "uses" },
	  { "from": "I.26", "to": "III.29", "type": "uses" },
	  { "from": "III.14", "to": "III.29", "type": "uses" },
	  { "from": "III.17", "to": "III.29", "type": "uses" },
	  { "from": "III.28", "to": "III.29", "type": "uses" },

	  { "from": "I.29", "to": "III.30", "type": "uses" },
	  { "from": "I.32", "to": "III.30", "type": "uses" },
	  { "from": "III.19", "to": "III.30", "type": "uses" },
	  { "from": "III.20", "to": "III.30", "type": "uses" },
	  { "from": "III.22", "to": "III.30", "type": "uses" },
	  { "from": "III.23", "to": "III.30", "type": "uses" },
	  
	  { "from": "I.32", "to": "III.31", "type": "uses" },
	  { "from": "III.16", "to": "III.31", "type": "uses" },
	  { "from": "III.20", "to": "III.31", "type": "uses" },
	  { "from": "III.21", "to": "III.31", "type": "uses" },
	  { "from": "III.29", "to": "III.31", "type": "uses" },
	  { "from": "III.30", "to": "III.31", "type": "uses" },

	  { "from": "III.29", "to": "III.32", "type": "uses" },
	  { "from": "III.30", "to": "III.32", "type": "uses" },
	  { "from": "III.31", "to": "III.32", "type": "uses" },

	  { "from": "I.5", "to": "III.33", "type": "uses" },
	  { "from": "I.23", "to": "III.33", "type": "uses" },
	  { "from": "I.26", "to": "III.33", "type": "uses" },
	  { "from": "I.30", "to": "III.33", "type": "uses" },
	  { "from": "III.1", "to": "III.33", "type": "uses" },

	  { "from": "I.1", "to": "III.34", "type": "uses" },
	  { "from": "I.10", "to": "III.34", "type": "uses" },
	  { "from": "I.11", "to": "III.34", "type": "uses" },
	  { "from": "III.1", "to": "III.34", "type": "uses" },
	  { "from": "III.16", "to": "III.34", "type": "uses" },

	  { "from": "I.46", "to": "III.35", "type": "uses" },
	  { "from": "III.1", "to": "III.35", "type": "uses" },
	  { "from": "III.16", "to": "III.35", "type": "uses" },
	  { "from": "III.34", "to": "III.35", "type": "uses" },

	  { "from": "I.10", "to": "III.36", "type": "uses" },
	  { "from": "I.19", "to": "III.36", "type": "uses" },
	  { "from": "III.1", "to": "III.36", "type": "uses" },
	  { "from": "III.11", "to": "III.36", "type": "uses" },
	  { "from": "III.14", "to": "III.36", "type": "uses" },

	  { "from": "I.10", "to": "III.37", "type": "uses" },
	  { "from": "I.19", "to": "III.37", "type": "uses" },
	  { "from": "III.1", "to": "III.37", "type": "uses" },
	  { "from": "III.11", "to": "III.37", "type": "uses" },
	  { "from": "III.14", "to": "III.37", "type": "uses" },
	  
	  { "from": "I.1", "to": "IV.1", "type": "uses" },
	  { "from": "I.9", "to": "IV.1", "type": "uses" },
	  { "from": "I.10", "to": "IV.1", "type": "uses" },
	  { "from": "III.9", "to": "IV.1", "type": "uses" },
	  { "from": "III.19", "to": "IV.1", "type": "uses" },
	  { "from": "III.22", "to": "IV.1", "type": "uses" },

	  { "from": "I.10", "to": "IV.2", "type": "uses" },
	  { "from": "I.11", "to": "IV.2", "type": "uses" },
	  { "from": "I.46", "to": "IV.2", "type": "uses" },
	  { "from": "I.47", "to": "IV.2", "type": "uses" },
	  { "from": "III.19", "to": "IV.2", "type": "uses" },
	  { "from": "III.30", "to": "IV.2", "type": "uses" },

	  { "from": "I.12", "to": "IV.3", "type": "uses" },
	  { "from": "I.13", "to": "IV.3", "type": "uses" },
	  { "from": "I.32", "to": "IV.3", "type": "uses" },
	  { "from": "III.11", "to": "IV.3", "type": "uses" },
	  { "from": "III.13", "to": "IV.3", "type": "uses" },
	  { "from": "III.14", "to": "IV.3", "type": "uses" },
	  { "from": "III.15", "to": "IV.3", "type": "uses" },

	  { "from": "I.12", "to": "IV.4", "type": "uses" },
	  { "from": "I.32", "to": "IV.4", "type": "uses" },
	  { "from": "III.13", "to": "IV.4", "type": "uses" },
	  { "from": "III.14", "to": "IV.4", "type": "uses" },
	  { "from": "III.15", "to": "IV.4", "type": "uses" },

	  { "from": "I.1", "to": "IV.5", "type": "uses" },
	  { "from": "I.10", "to": "IV.5", "type": "uses" },
	  { "from": "I.26", "to": "IV.5", "type": "uses" },
	  { "from": "III.13", "to": "IV.5", "type": "uses" },
	  { "from": "III.14", "to": "IV.5", "type": "uses" },
	  { "from": "III.15", "to": "IV.5", "type": "uses" },
	  { "from": "IV.1", "to": "IV.5", "type": "uses" },
	  
	  { "from": "I.10", "to": "IV.6", "type": "uses" },
	  { "from": "I.36", "to": "IV.6", "type": "uses" },
	  { "from": "I.43", "to": "IV.6", "type": "uses" },
	  { "from": "I.45", "to": "IV.6", "type": "uses" },
	  { "from": "I.47", "to": "IV.6", "type": "uses" },
	  { "from": "II.11", "to": "IV.6", "type": "uses" },
	  { "from": "II.14", "to": "IV.6", "type": "uses" },

	  { "from": "I.10", "to": "IV.7", "type": "uses" },
	  { "from": "I.15", "to": "IV.7", "type": "uses" },
	  { "from": "I.26", "to": "IV.7", "type": "uses" },
	  { "from": "III.9", "to": "IV.7", "type": "uses" },
	  { "from": "III.22", "to": "IV.7", "type": "uses" },
	  { "from": "IV.1", "to": "IV.7", "type": "uses" },
	  { "from": "IV.6", "to": "IV.7", "type": "uses" },

	  { "from": "I.10", "to": "IV.8", "type": "uses" },
	  { "from": "I.15", "to": "IV.8", "type": "uses" },
	  { "from": "III.19", "to": "IV.8", "type": "uses" },
	  { "from": "III.22", "to": "IV.8", "type": "uses" },
	  { "from": "IV.6", "to": "IV.8", "type": "uses" },
	  { "from": "IV.7", "to": "IV.8", "type": "uses" },

	  { "from": "I.10", "to": "IV.9", "type": "uses" },
	  { "from": "I.13", "to": "IV.9", "type": "uses" },
	  { "from": "I.32", "to": "IV.9", "type": "uses" },
	  { "from": "III.13", "to": "IV.9", "type": "uses" },
	  { "from": "III.14", "to": "IV.9", "type": "uses" },
	  { "from": "III.15", "to": "IV.9", "type": "uses" },
	  { "from": "IV.6", "to": "IV.9", "type": "uses" },
	  { "from": "IV.7", "to": "IV.9", "type": "uses" },

	  { "from": "I.10", "to": "IV.10", "type": "uses" },
	  { "from": "I.26", "to": "IV.10", "type": "uses" },
	  { "from": "III.9", "to": "IV.10", "type": "uses" },
	  { "from": "III.22", "to": "IV.10", "type": "uses" },
	  { "from": "IV.6", "to": "IV.10", "type": "uses" },
	  { "from": "IV.7", "to": "IV.10", "type": "uses" },
	  
	  { "from": "I.1", "to": "IV.11", "type": "uses" },
	  { "from": "I.15", "to": "IV.11", "type": "uses" },
	  { "from": "III.9", "to": "IV.11", "type": "uses" },
	  { "from": "III.19", "to": "IV.11", "type": "uses" },
	  { "from": "III.22", "to": "IV.11", "type": "uses" },
	  { "from": "IV.1", "to": "IV.11", "type": "uses" },

	  { "from": "I.9", "to": "IV.12", "type": "uses" },
	  { "from": "I.15", "to": "IV.12", "type": "uses" },
	  { "from": "I.30", "to": "IV.12", "type": "uses" },
	  { "from": "III.9", "to": "IV.12", "type": "uses" },
	  { "from": "III.22", "to": "IV.12", "type": "uses" },
	  { "from": "IV.1", "to": "IV.12", "type": "uses" },
	  { "from": "IV.7", "to": "IV.12", "type": "uses" },

	  { "from": "I.1", "to": "IV.13", "type": "uses" },
	  { "from": "I.26", "to": "IV.13", "type": "uses" },
	  { "from": "III.13", "to": "IV.13", "type": "uses" },
	  { "from": "III.15", "to": "IV.13", "type": "uses" },
	  { "from": "IV.3", "to": "IV.13", "type": "uses" },
	  { "from": "IV.5", "to": "IV.13", "type": "uses" },

	  { "from": "I.10", "to": "IV.14", "type": "uses" },
	  { "from": "III.9", "to": "IV.14", "type": "uses" },
	  { "from": "III.10", "to": "IV.14", "type": "uses" },
	  { "from": "III.22", "to": "IV.14", "type": "uses" },
	  { "from": "III.24", "to": "IV.14", "type": "uses" },

	  { "from": "I.23", "to": "IV.15", "type": "uses" },
	  { "from": "I.32", "to": "IV.15", "type": "uses" },
	  { "from": "III.13", "to": "IV.15", "type": "uses" },
	  { "from": "III.14", "to": "IV.15", "type": "uses" },
	  { "from": "III.15", "to": "IV.15", "type": "uses" },

	  { "from": "I.1", "to": "IV.16", "type": "uses" },
	  { "from": "I.10", "to": "IV.16", "type": "uses" },
	  { "from": "III.1", "to": "IV.16", "type": "uses" },
	  { "from": "III.6", "to": "IV.16", "type": "uses" },
	  
	  { "from": "I.4", "to": "V.1", "type": "uses" },
	  { "from": "I.5", "to": "V.1", "type": "uses" },
	  { "from": "I.20", "to": "V.1", "type": "uses" },

	  { "from": "V.1", "to": "V.2", "type": "uses" },

	  { "from": "V.2", "to": "V.3", "type": "uses" },

	  { "from": "I.5", "to": "V.4", "type": "uses" },
	  { "from": "I.7", "to": "V.4", "type": "uses" },

	  { "from": "V.1", "to": "V.5", "type": "uses" },
	  { "from": "V.2", "to": "V.5", "type": "uses" },
	  { "from": "V.3", "to": "V.5", "type": "uses" },
	  { "from": "V.4", "to": "V.5", "type": "uses" },
	  
	  { "from": "I.5", "to": "V.6", "type": "uses" },
	  { "from": "I.7", "to": "V.6", "type": "uses" },
	  { "from": "V.2", "to": "V.6", "type": "uses" },

	  { "from": "I.18", "to": "V.7", "type": "uses" },
	  { "from": "I.19", "to": "V.7", "type": "uses" },
	  { "from": "V.1", "to": "V.7", "type": "uses" },
	  { "from": "V.2", "to": "V.7", "type": "uses" },
	  { "from": "V.6", "to": "V.7", "type": "uses" },

	  { "from": "V.1", "to": "V.8", "type": "uses" },
	  { "from": "V.2", "to": "V.8", "type": "uses" },
	  { "from": "V.6", "to": "V.8", "type": "uses" },
	  { "from": "V.7", "to": "V.8", "type": "uses" },

	  { "from": "I.2", "to": "V.9", "type": "uses" },
	  { "from": "I.20", "to": "V.9", "type": "uses" },
	  { "from": "I.22", "to": "V.9", "type": "uses" },
	  { "from": "V.5", "to": "V.9", "type": "uses" },
	  { "from": "V.6", "to": "V.9", "type": "uses" },
	  { "from": "V.7", "to": "V.9", "type": "uses" },
	  { "from": "V.8", "to": "V.9", "type": "uses" },

	  { "from": "I.14", "to": "V.10", "type": "uses" },
	  { "from": "I.19", "to": "V.10", "type": "uses" },
	  { "from": "I.44", "to": "V.10", "type": "uses" },
	  { "from": "V.5", "to": "V.10", "type": "uses" },
	  { "from": "V.9", "to": "V.10", "type": "uses" },
	  
	  { "from": "V.3", "to": "V.11", "type": "uses" },
	  { "from": "V.5", "to": "V.11", "type": "uses" },
	  { "from": "V.6", "to": "V.11", "type": "uses" },

	  { "from": "V.5", "to": "V.12", "type": "uses" },
	  { "from": "V.6", "to": "V.12", "type": "uses" },
	  { "from": "V.9", "to": "V.12", "type": "uses" },

	  { "from": "V.5", "to": "V.13", "type": "uses" },
	  { "from": "V.6", "to": "V.13", "type": "uses" },
	  { "from": "V.10", "to": "V.13", "type": "uses" },

	  { "from": "V.9", "to": "V.14", "type": "uses" },
	  { "from": "V.10", "to": "V.14", "type": "uses" },
	  { "from": "V.12", "to": "V.14", "type": "uses" },
	  { "from": "V.13", "to": "V.14", "type": "uses" },

	  { "from": "V.5", "to": "V.15", "type": "uses" },
	  { "from": "V.12", "to": "V.15", "type": "uses" },
	  
	  { "from": "V.5", "to": "V.16", "type": "uses" },
	  { "from": "V.6", "to": "V.16", "type": "uses" },
	  { "from": "V.9", "to": "V.16", "type": "uses" },
	  { "from": "V.12", "to": "V.16", "type": "uses" },

	  { "from": "V.5", "to": "V.17", "type": "uses" },
	  { "from": "V.11", "to": "V.17", "type": "uses" },
	  { "from": "V.12", "to": "V.17", "type": "uses" },

	  { "from": "V.5", "to": "V.18", "type": "uses" },
	  { "from": "V.15", "to": "V.18", "type": "uses" },

	  { "from": "V.5", "to": "V.19", "type": "uses" },
	  { "from": "V.11", "to": "V.19", "type": "uses" },
	  { "from": "V.17", "to": "V.19", "type": "uses" },

	  { "from": "V.5", "to": "V.20", "type": "uses" },
	  { "from": "V.6", "to": "V.20", "type": "uses" },
	  { "from": "V.9", "to": "V.20", "type": "uses" },
	  { "from": "V.16", "to": "V.20", "type": "uses" },
	  
	  { "from": "V.5", "to": "V.21", "type": "uses" },
	  { "from": "V.15", "to": "V.21", "type": "uses" },
	  { "from": "V.18", "to": "V.21", "type": "uses" },

	  { "from": "V.10", "to": "V.22", "type": "uses" },
	  { "from": "V.13", "to": "V.22", "type": "uses" },
	  { "from": "V.16", "to": "V.22", "type": "uses" },
	  { "from": "V.20", "to": "V.22", "type": "uses" },

	  { "from": "V.5", "to": "V.23", "type": "uses" },
	  { "from": "V.7", "to": "V.23", "type": "uses" },
	  { "from": "V.8", "to": "V.23", "type": "uses" },

	  { "from": "V.1", "to": "V.24", "type": "uses" },
	  { "from": "V.5", "to": "V.24", "type": "uses" },
	  { "from": "V.7", "to": "V.24", "type": "uses" },
	  { "from": "V.8", "to": "V.24", "type": "uses" },

	  { "from": "V.1", "to": "V.25", "type": "uses" },
	  { "from": "V.5", "to": "V.25", "type": "uses" },
	  { "from": "V.7", "to": "V.25", "type": "uses" },
	  { "from": "V.8", "to": "V.25", "type": "uses" },
	  { "from": "V.24", "to": "V.25", "type": "uses" },
	  
		{ "from": "I.38", "to": "VI.1", "type": "uses" },
	  { "from": "I.41", "to": "VI.1", "type": "uses" },
	  { "from": "V.5", "to": "VI.1", "type": "uses" },
	  { "from": "V.7", "to": "VI.1", "type": "uses" },
	  { "from": "V.8", "to": "VI.1", "type": "uses" },

	  { "from": "I.4", "to": "VI.2", "type": "uses" },
	  { "from": "I.26", "to": "VI.2", "type": "uses" },
	  { "from": "I.32", "to": "VI.2", "type": "uses" },
	  { "from": "V.5", "to": "VI.2", "type": "uses" },
	  { "from": "V.6", "to": "VI.2", "type": "uses" },
	  { "from": "V.9", "to": "VI.2", "type": "uses" },

	  { "from": "V.5", "to": "VI.3", "type": "uses" },
	  { "from": "V.12", "to": "VI.3", "type": "uses" },
	  { "from": "VI.2", "to": "VI.3", "type": "uses" },

	  { "from": "V.5", "to": "VI.4", "type": "uses" },
	  { "from": "V.15", "to": "VI.4", "type": "uses" },
	  { "from": "VI.2", "to": "VI.4", "type": "uses" },

	  { "from": "V.5", "to": "VI.5", "type": "uses" },
	  { "from": "V.12", "to": "VI.5", "type": "uses" },
	  { "from": "VI.2", "to": "VI.5", "type": "uses" },
	  { "from": "VI.3", "to": "VI.5", "type": "uses" },
	  { "from": "VI.4", "to": "VI.5", "type": "uses" },
	  
	  { "from": "I.29", "to": "VI.6", "type": "uses" },
	  { "from": "V.5", "to": "VI.6", "type": "uses" },
	  { "from": "V.9", "to": "VI.6", "type": "uses" },
	  { "from": "VI.1", "to": "VI.6", "type": "uses" },

	  { "from": "I.27", "to": "VI.7", "type": "uses" },
	  { "from": "I.29", "to": "VI.7", "type": "uses" },
	  { "from": "VI.6", "to": "VI.7", "type": "uses" },

	  { "from": "V.5", "to": "VI.8", "type": "uses" },
	  { "from": "V.6", "to": "VI.8", "type": "uses" },
	  { "from": "V.12", "to": "VI.8", "type": "uses" },
	  { "from": "VI.2", "to": "VI.8", "type": "uses" },
	  { "from": "VI.3", "to": "VI.8", "type": "uses" },
	  { "from": "VI.4", "to": "VI.8", "type": "uses" },
	  { "from": "VI.5", "to": "VI.8", "type": "uses" },

	  { "from": "I.10", "to": "VI.9", "type": "uses" },
	  { "from": "I.11", "to": "VI.9", "type": "uses" },
	  { "from": "V.5", "to": "VI.9", "type": "uses" },
	  { "from": "V.9", "to": "VI.9", "type": "uses" },
	  { "from": "VI.6", "to": "VI.9", "type": "uses" },

	  { "from": "I.10", "to": "VI.10", "type": "uses" },
	  { "from": "I.11", "to": "VI.10", "type": "uses" },
	  { "from": "V.5", "to": "VI.10", "type": "uses" },
	  { "from": "VI.6", "to": "VI.10", "type": "uses" },
	  { "from": "VI.9", "to": "VI.10", "type": "uses" },
	  
	  { "from": "I.29", "to": "VI.11", "type": "uses" },
	  { "from": "I.31", "to": "VI.11", "type": "uses" },
	  { "from": "VI.6", "to": "VI.11", "type": "uses" },

	  { "from": "I.29", "to": "VI.12", "type": "uses" },
	  { "from": "V.5", "to": "VI.12", "type": "uses" },
	  { "from": "VI.6", "to": "VI.12", "type": "uses" },
	  { "from": "VI.11", "to": "VI.12", "type": "uses" },

	  { "from": "VI.6", "to": "VI.13", "type": "uses" },
	  { "from": "VI.9", "to": "VI.13", "type": "uses" },
	  { "from": "VI.10", "to": "VI.13", "type": "uses" },
	  { "from": "I.31", "to": "VI.13", "type": "uses" },

	  { "from": "V.5", "to": "VI.14", "type": "uses" },
	  { "from": "V.12", "to": "VI.14", "type": "uses" },
	  { "from": "VI.2", "to": "VI.14", "type": "uses" },
	  { "from": "VI.3", "to": "VI.14", "type": "uses" },
	  { "from": "VI.4", "to": "VI.14", "type": "uses" },
	  { "from": "VI.5", "to": "VI.14", "type": "uses" },

	  { "from": "I.22", "to": "VI.15", "type": "uses" },
	  { "from": "I.23", "to": "VI.15", "type": "uses" },
	  { "from": "V.5", "to": "VI.15", "type": "uses" },
	  { "from": "VI.2", "to": "VI.15", "type": "uses" },
	  { "from": "VI.9", "to": "VI.15", "type": "uses" },
	  
	  { "from": "V.5", "to": "VI.16", "type": "uses" },
	  { "from": "VI.2", "to": "VI.16", "type": "uses" },
	  { "from": "VI.3", "to": "VI.16", "type": "uses" },
	  { "from": "VI.4", "to": "VI.16", "type": "uses" },

	  { "from": "I.35", "to": "VI.17", "type": "uses" },
	  { "from": "I.43", "to": "VI.17", "type": "uses" },
	  { "from": "V.5", "to": "VI.17", "type": "uses" },
	  { "from": "VI.1", "to": "VI.17", "type": "uses" },
	  { "from": "VI.9", "to": "VI.17", "type": "uses" },

	  { "from": "I.41", "to": "VI.18", "type": "uses" },
	  { "from": "V.5", "to": "VI.18", "type": "uses" },
	  { "from": "VI.1", "to": "VI.18", "type": "uses" },
	  { "from": "VI.17", "to": "VI.18", "type": "uses" },

	  { "from": "I.42", "to": "VI.19", "type": "uses" },
	  { "from": "V.5", "to": "VI.19", "type": "uses" },
	  { "from": "V.9", "to": "VI.19", "type": "uses" },
	  { "from": "VI.1", "to": "VI.19", "type": "uses" },
	  { "from": "VI.17", "to": "VI.19", "type": "uses" },

	  { "from": "I.42", "to": "VI.20", "type": "uses" },
	  { "from": "II.14", "to": "VI.20", "type": "uses" },
	  { "from": "V.5", "to": "VI.20", "type": "uses" },
	  { "from": "VI.17", "to": "VI.20", "type": "uses" },
	  { "from": "VI.19", "to": "VI.20", "type": "uses" },
	  
	  { "from": "V.5", "to": "VI.21", "type": "uses" },
	  { "from": "VI.1", "to": "VI.21", "type": "uses" },
	  { "from": "VI.17", "to": "VI.21", "type": "uses" },
	  { "from": "VI.18", "to": "VI.21", "type": "uses" },

	  { "from": "I.42", "to": "VI.22", "type": "uses" },
	  { "from": "V.5", "to": "VI.22", "type": "uses" },
	  { "from": "VI.9", "to": "VI.22", "type": "uses" },
	  { "from": "VI.17", "to": "VI.22", "type": "uses" },
	  { "from": "VI.19", "to": "VI.22", "type": "uses" },

	  { "from": "V.5", "to": "VI.23", "type": "uses" },
	  { "from": "V.12", "to": "VI.23", "type": "uses" },
	  { "from": "VI.1", "to": "VI.23", "type": "uses" },
	  { "from": "VI.17", "to": "VI.23", "type": "uses" },
	  { "from": "VI.21", "to": "VI.23", "type": "uses" },

	  { "from": "II.14", "to": "VI.24", "type": "uses" },
	  { "from": "V.5", "to": "VI.24", "type": "uses" },
	  { "from": "VI.17", "to": "VI.24", "type": "uses" },
	  { "from": "VI.20", "to": "VI.24", "type": "uses" },

	  { "from": "I.42", "to": "VI.25", "type": "uses" },
	  { "from": "V.5", "to": "VI.25", "type": "uses" },
	  { "from": "VI.17", "to": "VI.25", "type": "uses" },
	  { "from": "VI.18", "to": "VI.25", "type": "uses" },
	  { "from": "VI.19", "to": "VI.25", "type": "uses" },
	  
	  { "from": "V.5", "to": "VI.26", "type": "uses" },
	  { "from": "VI.17", "to": "VI.26", "type": "uses" },
	  { "from": "VI.21", "to": "VI.26", "type": "uses" },
	  { "from": "VI.23", "to": "VI.26", "type": "uses" },

	  { "from": "V.5", "to": "VI.27", "type": "uses" },
	  { "from": "V.11", "to": "VI.27", "type": "uses" },
	  { "from": "V.12", "to": "VI.27", "type": "uses" },
	  { "from": "VI.17", "to": "VI.27", "type": "uses" },

	  { "from": "V.5", "to": "VI.28", "type": "uses" },
	  { "from": "VI.1", "to": "VI.28", "type": "uses" },
	  { "from": "VI.17", "to": "VI.28", "type": "uses" },

	  { "from": "II.14", "to": "VI.29", "type": "uses" },
	  { "from": "V.5", "to": "VI.29", "type": "uses" },
	  { "from": "VI.20", "to": "VI.29", "type": "uses" },
	  { "from": "VI.24", "to": "VI.29", "type": "uses" },

	  { "from": "I.47", "to": "VI.30", "type": "uses" },
	  { "from": "V.5", "to": "VI.30", "type": "uses" },
	  { "from": "VI.8", "to": "VI.30", "type": "uses" },
	  { "from": "VI.29", "to": "VI.30", "type": "uses" },
	  
	  { "from": "I.4", "to": "VI.31", "type": "uses" },
	  { "from": "I.32", "to": "VI.31", "type": "uses" },
	  { "from": "I.47", "to": "VI.31", "type": "uses" },
	  { "from": "VI.8", "to": "VI.31", "type": "uses" },

	  { "from": "I.47", "to": "VI.32", "type": "uses" },
	  { "from": "VI.8", "to": "VI.32", "type": "uses" },
	  { "from": "VI.29", "to": "VI.32", "type": "uses" },
	  { "from": "VI.30", "to": "VI.32", "type": "uses" },

	  { "from": "VI.8", "to": "VI.33", "type": "uses" },
	  { "from": "VI.29", "to": "VI.33", "type": "uses" },
	  { "from": "VI.30", "to": "VI.33", "type": "uses" },
	  { "from": "VI.32", "to": "VI.33", "type": "uses" },
	  
	  { "from": "VII.2", "to": "VII.3", "type": "uses" },
	  { "from": "VII.1", "to": "VII.2", "type": "uses" },
	  { "from": "VII.1", "to": "VII.3", "type": "uses" },

	  { "from": "VII.2", "to": "VII.4", "type": "uses" },
	  { "from": "VII.3", "to": "VII.4", "type": "uses" },

	  { "from": "VII.3", "to": "VII.5", "type": "uses" },
	  { "from": "VII.4", "to": "VII.5", "type": "uses" },
	  
	  { "from": "VII.1", "to": "VII.6", "type": "uses" },
	  { "from": "VII.2", "to": "VII.6", "type": "uses" },
	  { "from": "VII.3", "to": "VII.6", "type": "uses" },
	  { "from": "VII.4", "to": "VII.6", "type": "uses" },
	  { "from": "VII.5", "to": "VII.6", "type": "uses" },

	  { "from": "VII.1", "to": "VII.7", "type": "uses" },
	  { "from": "VII.2", "to": "VII.7", "type": "uses" },
	  { "from": "VII.3", "to": "VII.7", "type": "uses" },
	  { "from": "VII.5", "to": "VII.7", "type": "uses" },

	  { "from": "VII.1", "to": "VII.8", "type": "uses" },
	  { "from": "VII.3", "to": "VII.8", "type": "uses" },
	  { "from": "VII.4", "to": "VII.8", "type": "uses" },
	  { "from": "VII.6", "to": "VII.8", "type": "uses" },

	  { "from": "VII.2", "to": "VII.9", "type": "uses" },
	  { "from": "VII.5", "to": "VII.9", "type": "uses" },
	  { "from": "VII.6", "to": "VII.9", "type": "uses" },
	  { "from": "VII.7", "to": "VII.9", "type": "uses" },

	  { "from": "VII.3", "to": "VII.10", "type": "uses" },
	  { "from": "VII.5", "to": "VII.10", "type": "uses" },
	  { "from": "VII.6", "to": "VII.10", "type": "uses" },
	  { "from": "VII.9", "to": "VII.10", "type": "uses" },
	  
	  { "from": "VII.1", "to": "VII.11", "type": "uses" },
	  { "from": "VII.2", "to": "VII.11", "type": "uses" },
	  { "from": "VII.6", "to": "VII.11", "type": "uses" },
	  { "from": "VII.7", "to": "VII.11", "type": "uses" },

	  { "from": "VII.6", "to": "VII.12", "type": "uses" },
	  { "from": "VII.9", "to": "VII.12", "type": "uses" },
	  { "from": "VII.11", "to": "VII.12", "type": "uses" },

	  { "from": "VII.4", "to": "VII.13", "type": "uses" },
	  { "from": "VII.8", "to": "VII.13", "type": "uses" },
	  { "from": "VII.12", "to": "VII.13", "type": "uses" },

	  { "from": "VII.4", "to": "VII.14", "type": "uses" },
	  { "from": "VII.6", "to": "VII.14", "type": "uses" },
	  { "from": "VII.13", "to": "VII.14", "type": "uses" },

	  { "from": "VII.12", "to": "VII.15", "type": "uses" },
	  { "from": "VII.13", "to": "VII.15", "type": "uses" },
	  { "from": "VII.14", "to": "VII.15", "type": "uses" },
	  
	  { "from": "VII.13", "to": "VII.16", "type": "uses" },
	  { "from": "VII.14", "to": "VII.16", "type": "uses" },
	  { "from": "VII.15", "to": "VII.16", "type": "uses" },

	  { "from": "VII.13", "to": "VII.17", "type": "uses" },
	  { "from": "VII.15", "to": "VII.17", "type": "uses" },
	  { "from": "VII.16", "to": "VII.17", "type": "uses" },

	  { "from": "VII.13", "to": "VII.18", "type": "uses" },
	  { "from": "VII.14", "to": "VII.18", "type": "uses" },
	  { "from": "VII.17", "to": "VII.18", "type": "uses" },

	  { "from": "VII.13", "to": "VII.19", "type": "uses" },
	  { "from": "VII.14", "to": "VII.19", "type": "uses" },
	  { "from": "VII.16", "to": "VII.19", "type": "uses" },

	  { "from": "VII.13", "to": "VII.20", "type": "uses" },
	  { "from": "VII.14", "to": "VII.20", "type": "uses" },
	  { "from": "VII.19", "to": "VII.20", "type": "uses" },
	  
	  { "from": "VII.5", "to": "VII.21", "type": "uses" },
	  { "from": "VII.10", "to": "VII.21", "type": "uses" },
	  { "from": "VII.17", "to": "VII.21", "type": "uses" },

	  { "from": "VII.13", "to": "VII.22", "type": "uses" },
	  { "from": "VII.14", "to": "VII.22", "type": "uses" },
	  { "from": "VII.15", "to": "VII.22", "type": "uses" },
	  { "from": "VII.20", "to": "VII.22", "type": "uses" },

	  { "from": "VII.12", "to": "VII.23", "type": "uses" },
	  { "from": "VII.17", "to": "VII.23", "type": "uses" },
	  { "from": "VII.22", "to": "VII.23", "type": "uses" },

	  { "from": "VII.13", "to": "VII.24", "type": "uses" },
	  { "from": "VII.14", "to": "VII.24", "type": "uses" },
	  { "from": "VII.19", "to": "VII.24", "type": "uses" },

	  { "from": "VII.1", "to": "VII.25", "type": "uses" },
	  { "from": "VII.14", "to": "VII.25", "type": "uses" },
	  { "from": "VII.24", "to": "VII.25", "type": "uses" },
	  
	  { "from": "VII.1", "to": "VII.26", "type": "uses" },
	  { "from": "VII.25", "to": "VII.26", "type": "uses" },

	  { "from": "VII.13", "to": "VII.27", "type": "uses" },
	  { "from": "VII.19", "to": "VII.27", "type": "uses" },
	  { "from": "VII.20", "to": "VII.27", "type": "uses" },

	  { "from": "VII.14", "to": "VII.28", "type": "uses" },
	  { "from": "VII.24", "to": "VII.28", "type": "uses" },
	  { "from": "VII.27", "to": "VII.28", "type": "uses" },

	  { "from": "VII.6", "to": "VII.29", "type": "uses" },
	  { "from": "VII.8", "to": "VII.29", "type": "uses" },
	  { "from": "VII.25", "to": "VII.29", "type": "uses" },

	  { "from": "VII.29", "to": "VII.30", "type": "uses" },
	  
	  { "from": "VII.29", "to": "VII.31", "type": "uses" },
	  { "from": "VII.30", "to": "VII.31", "type": "uses" },

	  { "from": "VII.5", "to": "VII.32", "type": "uses" },
	  { "from": "VII.6", "to": "VII.32", "type": "uses" },
	  { "from": "VII.9", "to": "VII.32", "type": "uses" },
	  { "from": "VII.10", "to": "VII.32", "type": "uses" },

	  { "from": "VII.20", "to": "VII.33", "type": "uses" },
	  { "from": "VII.27", "to": "VII.33", "type": "uses" },
	  { "from": "VII.28", "to": "VII.33", "type": "uses" },

	  { "from": "VII.13", "to": "VII.34", "type": "uses" },
	  { "from": "VII.27", "to": "VII.34", "type": "uses" },
	  { "from": "VII.33", "to": "VII.34", "type": "uses" },

	  { "from": "VII.20", "to": "VII.35", "type": "uses" },
	  { "from": "VII.34", "to": "VII.35", "type": "uses" },
	  
	   { "from": "VII.13", "to": "VII.36", "type": "uses" },
	  { "from": "VII.14", "to": "VII.36", "type": "uses" },
	  { "from": "VII.24", "to": "VII.36", "type": "uses" },

	  { "from": "VII.15", "to": "VII.37", "type": "uses" },
	  { "from": "VII.16", "to": "VII.37", "type": "uses" },
	  { "from": "VII.33", "to": "VII.37", "type": "uses" },

	  { "from": "VII.13", "to": "VII.38", "type": "uses" },
	  { "from": "VII.14", "to": "VII.38", "type": "uses" },
	  { "from": "VII.28", "to": "VII.38", "type": "uses" },

	  { "from": "VII.15", "to": "VII.39", "type": "uses" },
	  { "from": "VII.33", "to": "VII.39", "type": "uses" },
	  { "from": "VII.37", "to": "VII.39", "type": "uses" },
	  
	  { "from": "VII.13", "to": "VIII.1", "type": "uses" },
	  { "from": "VII.14", "to": "VIII.1", "type": "uses" },
	  { "from": "VII.22", "to": "VIII.1", "type": "uses" },

	  { "from": "VII.13", "to": "VIII.2", "type": "uses" },
	  { "from": "VII.14", "to": "VIII.2", "type": "uses" },
	  { "from": "VII.38", "to": "VIII.2", "type": "uses" },

	  { "from": "I.46", "to": "VIII.3", "type": "uses" },
	  { "from": "VII.13", "to": "VIII.3", "type": "uses" },
	  { "from": "VII.35", "to": "VIII.3", "type": "uses" },

	  { "from": "VIII.3", "to": "VIII.4", "type": "uses" },
	  { "from": "VII.20", "to": "VIII.4", "type": "uses" },
	  { "from": "VII.28", "to": "VIII.4", "type": "uses" },
	  { "from": "VII.36", "to": "VIII.4", "type": "uses" },

	  { "from": "VIII.3", "to": "VIII.5", "type": "uses" },
	  { "from": "VIII.4", "to": "VIII.5", "type": "uses" },
	  { "from": "VII.13", "to": "VIII.5", "type": "uses" },
	  { "from": "VII.14", "to": "VIII.5", "type": "uses" },
	  
	  { "from": "VII.13", "to": "VIII.6", "type": "uses" },
	  { "from": "VII.14", "to": "VIII.6", "type": "uses" },
	  { "from": "VIII.2", "to": "VIII.6", "type": "uses" },

	  { "from": "VIII.6", "to": "VIII.7", "type": "uses" },
	  { "from": "VII.28", "to": "VIII.7", "type": "uses" },
	  { "from": "VII.14", "to": "VIII.7", "type": "uses" },

	  { "from": "VIII.3", "to": "VIII.8", "type": "uses" },
	  { "from": "VII.13", "to": "VIII.8", "type": "uses" },

	  { "from": "VIII.8", "to": "VIII.9", "type": "uses" },
	  { "from": "VIII.4", "to": "VIII.9", "type": "uses" },
	  { "from": "VII.13", "to": "VIII.9", "type": "uses" },
	  { "from": "VII.36", "to": "VIII.9", "type": "uses" },

	  { "from": "VIII.8", "to": "VIII.10", "type": "uses" },
	  { "from": "VIII.9", "to": "VIII.10", "type": "uses" },
	  { "from": "VII.13", "to": "VIII.10", "type": "uses" },
	  { "from": "VII.14", "to": "VIII.10", "type": "uses" },
	  
		{ "from": "VII.20", "to": "VIII.11", "type": "uses" },
	  { "from": "VII.27", "to": "VIII.11", "type": "uses" },
	  { "from": "VII.35", "to": "VIII.11", "type": "uses" },

	  { "from": "VII.13", "to": "VIII.12", "type": "uses" },
	  { "from": "VII.14", "to": "VIII.12", "type": "uses" },
	  { "from": "VIII.6", "to": "VIII.12", "type": "uses" },

	  { "from": "VIII.11", "to": "VIII.13", "type": "uses" },
	  { "from": "VII.20", "to": "VIII.13", "type": "uses" },
	  { "from": "VII.27", "to": "VIII.13", "type": "uses" },
	  { "from": "VII.35", "to": "VIII.13", "type": "uses" },

	  { "from": "VIII.11", "to": "VIII.14", "type": "uses" },
	  { "from": "VIII.13", "to": "VIII.14", "type": "uses" },
	  { "from": "VIII.8", "to": "VIII.14", "type": "uses" },

	  { "from": "VIII.13", "to": "VIII.15", "type": "uses" },
	  { "from": "VIII.14", "to": "VIII.15", "type": "uses" },
	  { "from": "VII.20", "to": "VIII.15", "type": "uses" },
	  
		{ "from": "VII.13", "to": "VIII.16", "type": "uses" },
	  { "from": "VII.14", "to": "VIII.16", "type": "uses" },
	  { "from": "VII.36", "to": "VIII.16", "type": "uses" },

	  { "from": "VIII.6", "to": "VIII.17", "type": "uses" },
	  { "from": "VIII.12", "to": "VIII.17", "type": "uses" },
	  { "from": "VII.14", "to": "VIII.17", "type": "uses" },

	  { "from": "VIII.11", "to": "VIII.18", "type": "uses" },
	  { "from": "VIII.13", "to": "VIII.18", "type": "uses" },
	  { "from": "VII.35", "to": "VIII.18", "type": "uses" },

	  { "from": "VIII.13", "to": "VIII.19", "type": "uses" },
	  { "from": "VIII.18", "to": "VIII.19", "type": "uses" },

	  { "from": "VIII.13", "to": "VIII.20", "type": "uses" },
	  { "from": "VIII.18", "to": "VIII.20", "type": "uses" },
	  { "from": "VIII.19", "to": "VIII.20", "type": "uses" },
	  
	  { "from": "VII.25", "to": "VIII.21", "type": "uses" },
	  { "from": "VII.36", "to": "VIII.21", "type": "uses" },
	  { "from": "VIII.16", "to": "VIII.21", "type": "uses" },

	  { "from": "VIII.11", "to": "VIII.22", "type": "uses" },
	  { "from": "VIII.13", "to": "VIII.22", "type": "uses" },
	  { "from": "VII.35", "to": "VIII.22", "type": "uses" },

	  { "from": "VII.20", "to": "VIII.23", "type": "uses" },
	  { "from": "VIII.11", "to": "VIII.23", "type": "uses" },
	  { "from": "VIII.13", "to": "VIII.23", "type": "uses" },

	  { "from": "VIII.8", "to": "VIII.24", "type": "uses" },
	  { "from": "VIII.9", "to": "VIII.24", "type": "uses" },
	  { "from": "VIII.14", "to": "VIII.24", "type": "uses" },

	  { "from": "VIII.3", "to": "VIII.25", "type": "uses" },
	  { "from": "VIII.8", "to": "VIII.25", "type": "uses" },
	  { "from": "VIII.22", "to": "VIII.25", "type": "uses" },

	  { "from": "VIII.11", "to": "VIII.26", "type": "uses" },
	  { "from": "VIII.13", "to": "VIII.26", "type": "uses" },
	  { "from": "VIII.15", "to": "VIII.26", "type": "uses" },

	  { "from": "VIII.11", "to": "VIII.27", "type": "uses" },
	  { "from": "VIII.23", "to": "VIII.27", "type": "uses" },
	  { "from": "VII.20", "to": "VIII.27", "type": "uses" },
	  
	  { "from": "VII.1", "to": "IX.1", "type": "uses" },
	  { "from": "VII.11", "to": "IX.1", "type": "uses" },

	  { "from": "IX.1", "to": "IX.2", "type": "uses" },
	  { "from": "VII.1", "to": "IX.2", "type": "uses" },
	  { "from": "VII.11", "to": "IX.2", "type": "uses" },

	  { "from": "VII.10", "to": "IX.3", "type": "uses" },
	  { "from": "VII.21", "to": "IX.3", "type": "uses" },

	  { "from": "VII.6", "to": "IX.4", "type": "uses" },
	  { "from": "VII.7", "to": "IX.4", "type": "uses" },
	  { "from": "VII.25", "to": "IX.4", "type": "uses" },

	  { "from": "VII.13", "to": "IX.5", "type": "uses" },
	  { "from": "VII.25", "to": "IX.5", "type": "uses" },
	  { "from": "VIII.3", "to": "IX.5", "type": "uses" },
	  
	  { "from": "VII.13", "to": "IX.6", "type": "uses" },
	  { "from": "VIII.3", "to": "IX.6", "type": "uses" },
	  { "from": "VIII.4", "to": "IX.6", "type": "uses" },

	  { "from": "VIII.5", "to": "IX.7", "type": "uses" },
	  { "from": "IX.6", "to": "IX.7", "type": "uses" },

	  { "from": "VIII.3", "to": "IX.8", "type": "uses" },
	  { "from": "VII.25", "to": "IX.8", "type": "uses" },

	  { "from": "VII.29", "to": "IX.9", "type": "uses" },
	  { "from": "VIII.3", "to": "IX.9", "type": "uses" },
	  { "from": "IX.8", "to": "IX.9", "type": "uses" },

	  { "from": "VIII.15", "to": "IX.10", "type": "uses" },
	  { "from": "VIII.13", "to": "IX.10", "type": "uses" },
	  { "from": "IX.6", "to": "IX.10", "type": "uses" },
	  
	  { "from": "IX.1", "to": "IX.11", "type": "uses" },
	  { "from": "VII.11", "to": "IX.11", "type": "uses" },

	  { "from": "IX.11", "to": "IX.12", "type": "uses" },
	  { "from": "IX.10", "to": "IX.12", "type": "uses" },
	  { "from": "VII.1", "to": "IX.12", "type": "uses" },

	  { "from": "VII.13", "to": "IX.13", "type": "uses" },
	  { "from": "VII.14", "to": "IX.13", "type": "uses" },
	  { "from": "VII.17", "to": "IX.13", "type": "uses" },

	  { "from": "IX.13", "to": "IX.14", "type": "uses" },
	  { "from": "VII.25", "to": "IX.14", "type": "uses" },

	  { "from": "IX.13", "to": "IX.15", "type": "uses" },
	  { "from": "IX.14", "to": "IX.15", "type": "uses" },
	  { "from": "VII.15", "to": "IX.15", "type": "uses" },
	  
	  { "from": "VIII.13", "to": "IX.16", "type": "uses" },
	  { "from": "VIII.15", "to": "IX.16", "type": "uses" },
	  { "from": "VII.20", "to": "IX.16", "type": "uses" },

	  { "from": "IX.16", "to": "IX.17", "type": "uses" },
	  { "from": "VII.6", "to": "IX.17", "type": "uses" },
	  { "from": "VII.8", "to": "IX.17", "type": "uses" },

	  { "from": "VII.13", "to": "IX.18", "type": "uses" },
	  { "from": "VII.14", "to": "IX.18", "type": "uses" },
	  { "from": "IX.17", "to": "IX.18", "type": "uses" },

	  { "from": "VII.30", "to": "IX.19", "type": "uses" },
	  { "from": "VII.5", "to": "IX.19", "type": "uses" },

	  { "from": "IX.19", "to": "IX.20", "type": "uses" },
	  { "from": "VII.30", "to": "IX.20", "type": "uses" },
	  { "from": "VII.6", "to": "IX.20", "type": "uses" },
	  
	  { "from": "VII.5", "to": "IX.21", "type": "uses" },
	  { "from": "VII.6", "to": "IX.21", "type": "uses" },
	  { "from": "IX.19", "to": "IX.21", "type": "uses" },

	  { "from": "VII.30", "to": "IX.22", "type": "uses" },
	  { "from": "IX.20", "to": "IX.22", "type": "uses" },

	  { "from": "IX.22", "to": "IX.23", "type": "uses" },
	  { "from": "IX.21", "to": "IX.23", "type": "uses" },
	  { "from": "VII.5", "to": "IX.23", "type": "uses" },

	  { "from": "IX.22", "to": "IX.24", "type": "uses" },
	  { "from": "VII.30", "to": "IX.24", "type": "uses" },
	  { "from": "IX.21", "to": "IX.24", "type": "uses" },

	  { "from": "IX.22", "to": "IX.25", "type": "uses" },
	  { "from": "IX.24", "to": "IX.25", "type": "uses" },
	  { "from": "VII.30", "to": "IX.25", "type": "uses" },
	  
	  { "from": "VIII.11", "to": "IX.26", "type": "uses" },
	  { "from": "VIII.13", "to": "IX.26", "type": "uses" },
	  { "from": "IX.16", "to": "IX.26", "type": "uses" },

	  { "from": "IX.26", "to": "IX.27", "type": "uses" },
	  { "from": "VIII.15", "to": "IX.27", "type": "uses" },
	  { "from": "VII.20", "to": "IX.27", "type": "uses" },

	  { "from": "IX.27", "to": "IX.28", "type": "uses" },
	  { "from": "VIII.15", "to": "IX.28", "type": "uses" },
	  { "from": "VIII.13", "to": "IX.28", "type": "uses" },

	  { "from": "IX.27", "to": "IX.29", "type": "uses" },
	  { "from": "VIII.15", "to": "IX.29", "type": "uses" },
	  { "from": "VIII.14", "to": "IX.29", "type": "uses" },

	  { "from": "VII.1", "to": "IX.30", "type": "uses" },
	  { "from": "VII.11", "to": "IX.30", "type": "uses" },
	  { "from": "VIII.1", "to": "IX.30", "type": "uses" },
	  
	  { "from": "VIII.1", "to": "IX.31", "type": "uses" },
	  { "from": "VII.11", "to": "IX.31", "type": "uses" },

	  { "from": "IX.30", "to": "IX.32", "type": "uses" },
	  { "from": "IX.31", "to": "IX.32", "type": "uses" },
	  { "from": "VII.1", "to": "IX.32", "type": "uses" },

	  { "from": "IX.30", "to": "IX.33", "type": "uses" },
	  { "from": "IX.32", "to": "IX.33", "type": "uses" },
	  { "from": "VII.11", "to": "IX.33", "type": "uses" },

	  { "from": "IX.33", "to": "IX.34", "type": "uses" },
	  { "from": "IX.30", "to": "IX.34", "type": "uses" },

	  { "from": "IX.33", "to": "IX.35", "type": "uses" },
	  { "from": "VII.30", "to": "IX.35", "type": "uses" },
	  { "from": "IX.25", "to": "IX.35", "type": "uses" },

	  { "from": "IX.35", "to": "IX.36", "type": "uses" },
	  { "from": "VII.30", "to": "IX.36", "type": "uses" },
	  
	  { "from": "X.1", "to": "X.2", "type": "uses" },

	  { "from": "X.1", "to": "X.3", "type": "uses" },
	  { "from": "VII.1", "to": "X.3", "type": "uses" },
	  { "from": "VII.2", "to": "X.3", "type": "uses" },

	  { "from": "X.1", "to": "X.4", "type": "uses" },
	  { "from": "X.3", "to": "X.4", "type": "uses" },

	  { "from": "X.2", "to": "X.5", "type": "uses" },
	  { "from": "VII.1", "to": "X.5", "type": "uses" },
	  { "from": "VII.2", "to": "X.5", "type": "uses" },
	  { "from": "IX.1", "to": "X.5", "type": "uses" },
	  
	  { "from": "X.3", "to": "X.6", "type": "uses" },
	  { "from": "VII.2", "to": "X.6", "type": "uses" },
	  { "from": "IX.1", "to": "X.6", "type": "uses" },

	  { "from": "X.6", "to": "X.7", "type": "uses" },
	  { "from": "X.2", "to": "X.7", "type": "uses" },
	  { "from": "VII.1", "to": "X.7", "type": "uses" },

	  { "from": "X.6", "to": "X.8", "type": "uses" },
	  { "from": "X.3", "to": "X.8", "type": "uses" },
	  { "from": "VII.2", "to": "X.8", "type": "uses" },

	  { "from": "X.5", "to": "X.9", "type": "uses" },
	  { "from": "X.7", "to": "X.9", "type": "uses" },
	  { "from": "VII.1", "to": "X.9", "type": "uses" },

	  { "from": "X.3", "to": "X.10", "type": "uses" },
	  { "from": "VII.20", "to": "X.10", "type": "uses" },
	  { "from": "VII.21", "to": "X.10", "type": "uses" },
	  
	  { "from": "X.3", "to": "X.11", "type": "uses" },
	  { "from": "I.46", "to": "X.11", "type": "uses" },
	  { "from": "II.14", "to": "X.11", "type": "uses" },

	  { "from": "X.11", "to": "X.12", "type": "uses" },
	  { "from": "VII.20", "to": "X.12", "type": "uses" },
	  { "from": "VIII.4", "to": "X.12", "type": "uses" },

	  { "from": "X.3", "to": "X.13", "type": "uses" },
	  { "from": "VII.20", "to": "X.13", "type": "uses" },
	  { "from": "VII.5", "to": "X.13", "type": "uses" },

	  { "from": "X.2", "to": "X.14", "type": "uses" },
	  { "from": "X.11", "to": "X.14", "type": "uses" },
	  { "from": "X.12", "to": "X.14", "type": "uses" },

	  { "from": "X.14", "to": "X.15", "type": "uses" },
	  { "from": "VIII.5", "to": "X.15", "type": "uses" },
	  { "from": "VII.25", "to": "X.15", "type": "uses" },
	  
	  { "from": "X.3", "to": "X.16", "type": "uses" },
	  { "from": "I.46", "to": "X.16", "type": "uses" },

	  { "from": "X.2", "to": "X.17", "type": "uses" },
	  { "from": "X.14", "to": "X.17", "type": "uses" },
	  { "from": "X.16", "to": "X.17", "type": "uses" },

	  { "from": "X.3", "to": "X.18", "type": "uses" },
	  { "from": "X.4", "to": "X.18", "type": "uses" },
	  { "from": "X.14", "to": "X.18", "type": "uses" },
	  { "from": "X.17", "to": "X.18", "type": "uses" },

	  { "from": "X.2", "to": "X.19", "type": "uses" },
	  { "from": "X.4", "to": "X.19", "type": "uses" },
	  { "from": "X.17", "to": "X.19", "type": "uses" },
	  { "from": "X.18", "to": "X.19", "type": "uses" },

	  { "from": "II.6", "to": "X.20", "type": "uses" },
	  { "from": "I.46", "to": "X.20", "type": "uses" },
	  { "from": "X.16", "to": "X.20", "type": "uses" },
	  
	  { "from": "X.17", "to": "X.21", "type": "uses" },
	  { "from": "II.5", "to": "X.21", "type": "uses" },
	  { "from": "II.9", "to": "X.21", "type": "uses" },
	  { "from": "I.47", "to": "X.21", "type": "uses" },

	  { "from": "X.17", "to": "X.22", "type": "uses" },
	  { "from": "X.2", "to": "X.22", "type": "uses" },
	  { "from": "X.21", "to": "X.22", "type": "uses" },

	  { "from": "II.9", "to": "X.23", "type": "uses" },
	  { "from": "X.21", "to": "X.23", "type": "uses" },
	  { "from": "I.47", "to": "X.23", "type": "uses" },

	  { "from": "X.23", "to": "X.24", "type": "uses" },
	  { "from": "II.5", "to": "X.24", "type": "uses" },
	  { "from": "X.16", "to": "X.24", "type": "uses" },

	  { "from": "X.24", "to": "X.25", "type": "uses" },
	  { "from": "II.4", "to": "X.25", "type": "uses" },
	  { "from": "X.20", "to": "X.25", "type": "uses" },
	  
	  { "from": "X.25", "to": "X.26", "type": "uses" },
	  { "from": "X.20", "to": "X.26", "type": "uses" },

	  { "from": "X.21", "to": "X.27", "type": "uses" },
	  { "from": "X.17", "to": "X.27", "type": "uses" },
	  { "from": "II.5", "to": "X.27", "type": "uses" },

	  { "from": "X.17", "to": "X.28", "type": "uses" },
	  { "from": "II.4", "to": "X.28", "type": "uses" },
	  { "from": "X.24", "to": "X.28", "type": "uses" },

	  { "from": "X.11", "to": "X.29", "type": "uses" },
	  { "from": "X.17", "to": "X.29", "type": "uses" },
	  { "from": "X.24", "to": "X.29", "type": "uses" },
	  { "from": "I.47", "to": "X.29", "type": "uses" },

	  { "from": "X.17", "to": "X.30", "type": "uses" },
	  { "from": "X.11", "to": "X.30", "type": "uses" },
	  { "from": "VI.13", "to": "X.30", "type": "uses" },
	  { "from": "X.3", "to": "X.30", "type": "uses" },
	  { "from": "VII.13", "to": "X.30", "type": "uses" },
	  
	  { "from": "X.17", "to": "X.31", "type": "uses" },
	  { "from": "II.5", "to": "X.31", "type": "uses" },
	  { "from": "X.14", "to": "X.31", "type": "uses" },

	  { "from": "X.31", "to": "X.32", "type": "uses" },
	  { "from": "X.12", "to": "X.32", "type": "uses" },
	  { "from": "VII.25", "to": "X.32", "type": "uses" },

	  { "from": "X.32", "to": "X.33", "type": "uses" },
	  { "from": "X.14", "to": "X.33", "type": "uses" },
	  { "from": "X.17", "to": "X.33", "type": "uses" },

	  { "from": "X.12", "to": "X.34", "type": "uses" },
	  { "from": "X.11", "to": "X.34", "type": "uses" },
	  { "from": "VII.20", "to": "X.34", "type": "uses" },

	  { "from": "X.34", "to": "X.35", "type": "uses" },
	  { "from": "X.3", "to": "X.35", "type": "uses" },
	  { "from": "X.12", "to": "X.35", "type": "uses" },
	  
	  { "from": "X.3", "to": "X.36", "type": "uses" },
	  { "from": "VII.20", "to": "X.36", "type": "uses" },

	  { "from": "X.17", "to": "X.37", "type": "uses" },
	  { "from": "X.2", "to": "X.37", "type": "uses" },
	  { "from": "X.21", "to": "X.37", "type": "uses" },

	  { "from": "X.31", "to": "X.38", "type": "uses" },
	  { "from": "X.32", "to": "X.38", "type": "uses" },
	  { "from": "X.14", "to": "X.38", "type": "uses" },

	  { "from": "X.14", "to": "X.39", "type": "uses" },
	  { "from": "X.33", "to": "X.39", "type": "uses" },
	  { "from": "II.4", "to": "X.39", "type": "uses" },

	  { "from": "X.38", "to": "X.40", "type": "uses" },
	  { "from": "X.32", "to": "X.40", "type": "uses" },
	  { "from": "X.35", "to": "X.40", "type": "uses" },
	  
	  { "from": "X.17", "to": "X.41", "type": "uses" },
	  { "from": "X.30", "to": "X.41", "type": "uses" },
	  { "from": "VI.13", "to": "X.41", "type": "uses" },

	  { "from": "X.11", "to": "X.42", "type": "uses" },
	  { "from": "X.14", "to": "X.42", "type": "uses" },
	  { "from": "X.17", "to": "X.42", "type": "uses" },

	  { "from": "X.42", "to": "X.43", "type": "uses" },
	  { "from": "X.33", "to": "X.43", "type": "uses" },
	  { "from": "X.11", "to": "X.43", "type": "uses" },

	  { "from": "X.11", "to": "X.44", "type": "uses" },
	  { "from": "X.30", "to": "X.44", "type": "uses" },
	  { "from": "VII.13", "to": "X.44", "type": "uses" },

	  { "from": "X.30", "to": "X.45", "type": "uses" },
	  { "from": "VII.13", "to": "X.45", "type": "uses" },
	  { "from": "X.3", "to": "X.45", "type": "uses" },
	  
	  { "from": "X.17", "to": "X.46", "type": "uses" },
	  { "from": "X.14", "to": "X.46", "type": "uses" },
	  { "from": "X.11", "to": "X.46", "type": "uses" },
	  { "from": "X.12", "to": "X.46", "type": "uses" },

	  { "from": "X.30", "to": "X.47", "type": "uses" },
	  { "from": "X.44", "to": "X.47", "type": "uses" },
	  { "from": "X.45", "to": "X.47", "type": "uses" },
	  { "from": "VI.13", "to": "X.47", "type": "uses" },

	  { "from": "II.4", "to": "X.48", "type": "uses" },
	  { "from": "X.33", "to": "X.48", "type": "uses" },
	  { "from": "X.39", "to": "X.48", "type": "uses" },

	  { "from": "X.11", "to": "X.49", "type": "uses" },
	  { "from": "X.42", "to": "X.49", "type": "uses" },
	  { "from": "X.43", "to": "X.49", "type": "uses" },

	  { "from": "X.48", "to": "X.50", "type": "uses" },
	  { "from": "X.49", "to": "X.50", "type": "uses" },
	  { "from": "X.32", "to": "X.50", "type": "uses" },
	  
	  { "from": "X.17", "to": "X.51", "type": "uses" },
	  { "from": "X.37", "to": "X.51", "type": "uses" },
	  { "from": "X.20", "to": "X.51", "type": "uses" },

	  { "from": "X.51", "to": "X.52", "type": "uses" },
	  { "from": "II.4", "to": "X.52", "type": "uses" },
	  { "from": "X.30", "to": "X.52", "type": "uses" },
	  { "from": "X.46", "to": "X.52", "type": "uses" },

	  { "from": "X.52", "to": "X.53", "type": "uses" },
	  { "from": "II.9", "to": "X.53", "type": "uses" },
	  { "from": "X.30", "to": "X.53", "type": "uses" },

	  { "from": "X.33", "to": "X.54", "type": "uses" },
	  { "from": "X.30", "to": "X.54", "type": "uses" },
	  { "from": "X.51", "to": "X.54", "type": "uses" },

	  { "from": "X.54", "to": "X.55", "type": "uses" },
	  { "from": "II.4", "to": "X.55", "type": "uses" },
	  { "from": "X.17", "to": "X.55", "type": "uses" },
	  
	  { "from": "X.30", "to": "X.56", "type": "uses" },
	  { "from": "VI.13", "to": "X.56", "type": "uses" },
	  { "from": "X.44", "to": "X.56", "type": "uses" },

	  { "from": "X.56", "to": "X.57", "type": "uses" },
	  { "from": "X.11", "to": "X.57", "type": "uses" },
	  { "from": "X.33", "to": "X.57", "type": "uses" },

	  { "from": "X.43", "to": "X.58", "type": "uses" },
	  { "from": "X.33", "to": "X.58", "type": "uses" },
	  { "from": "X.12", "to": "X.58", "type": "uses" },

	  { "from": "X.58", "to": "X.59", "type": "uses" },
	  { "from": "X.42", "to": "X.59", "type": "uses" },
	  { "from": "X.30", "to": "X.59", "type": "uses" },
	  { "from": "VI.13", "to": "X.59", "type": "uses" },

	  { "from": "X.58", "to": "X.60", "type": "uses" },
	  { "from": "X.59", "to": "X.60", "type": "uses" },
	  { "from": "X.42", "to": "X.60", "type": "uses" },
	  { "from": "X.14", "to": "X.60", "type": "uses" },
	  
	  { "from": "X.60", "to": "X.61", "type": "uses" },
	  { "from": "X.58", "to": "X.61", "type": "uses" },
	  { "from": "X.42", "to": "X.61", "type": "uses" },

	  { "from": "X.51", "to": "X.62", "type": "uses" },
	  { "from": "II.4", "to": "X.62", "type": "uses" },
	  { "from": "X.30", "to": "X.62", "type": "uses" },

	  { "from": "X.58", "to": "X.63", "type": "uses" },
	  { "from": "X.42", "to": "X.63", "type": "uses" },
	  { "from": "X.60", "to": "X.63", "type": "uses" },

	  { "from": "X.62", "to": "X.64", "type": "uses" },
	  { "from": "II.9", "to": "X.64", "type": "uses" },
	  { "from": "X.33", "to": "X.64", "type": "uses" },

	  { "from": "X.63", "to": "X.65", "type": "uses" },
	  { "from": "X.60", "to": "X.65", "type": "uses" },
	  { "from": "X.43", "to": "X.65", "type": "uses" },
	  
	  { "from": "X.63", "to": "X.66", "type": "uses" },
	  { "from": "X.42", "to": "X.66", "type": "uses" },
	  { "from": "II.4", "to": "X.66", "type": "uses" },
	  { "from": "X.60", "to": "X.66", "type": "uses" },

	  { "from": "X.63", "to": "X.67", "type": "uses" },
	  { "from": "X.65", "to": "X.67", "type": "uses" },
	  { "from": "X.60", "to": "X.67", "type": "uses" },

	  { "from": "X.62", "to": "X.68", "type": "uses" },
	  { "from": "X.52", "to": "X.68", "type": "uses" },
	  { "from": "X.46", "to": "X.68", "type": "uses" },

	  { "from": "X.64", "to": "X.69", "type": "uses" },
	  { "from": "II.9", "to": "X.69", "type": "uses" },
	  { "from": "X.33", "to": "X.69", "type": "uses" },

	  { "from": "X.63", "to": "X.70", "type": "uses" },
	  { "from": "X.60", "to": "X.70", "type": "uses" },
	  { "from": "X.66", "to": "X.70", "type": "uses" },
	  
	  { "from": "X.58", "to": "X.71", "type": "uses" },
	  { "from": "X.59", "to": "X.71", "type": "uses" },
	  { "from": "VI.13", "to": "X.71", "type": "uses" },

	  { "from": "X.60", "to": "X.72", "type": "uses" },
	  { "from": "X.67", "to": "X.72", "type": "uses" },
	  { "from": "X.42", "to": "X.72", "type": "uses" },

	  { "from": "X.71", "to": "X.73", "type": "uses" },
	  { "from": "X.59", "to": "X.73", "type": "uses" },
	  { "from": "X.30", "to": "X.73", "type": "uses" },

	  { "from": "X.73", "to": "X.74", "type": "uses" },
	  { "from": "X.72", "to": "X.74", "type": "uses" },
	  { "from": "X.60", "to": "X.74", "type": "uses" },

	  { "from": "X.30", "to": "X.75", "type": "uses" },
	  { "from": "X.44", "to": "X.75", "type": "uses" },
	  { "from": "X.56", "to": "X.75", "type": "uses" },
	  
	  { "from": "X.30", "to": "X.76", "type": "uses" },
	  { "from": "X.44", "to": "X.76", "type": "uses" },
	  { "from": "X.56", "to": "X.76", "type": "uses" },
	  { "from": "VI.13", "to": "X.76", "type": "uses" },

	  { "from": "X.42", "to": "X.77", "type": "uses" },
	  { "from": "X.30", "to": "X.77", "type": "uses" },
	  { "from": "VI.13", "to": "X.77", "type": "uses" },
	  { "from": "X.60", "to": "X.77", "type": "uses" },

	  { "from": "X.44", "to": "X.78", "type": "uses" },
	  { "from": "X.60", "to": "X.78", "type": "uses" },
	  { "from": "X.76", "to": "X.78", "type": "uses" },

	  { "from": "X.30", "to": "X.79", "type": "uses" },
	  { "from": "X.76", "to": "X.79", "type": "uses" },
	  { "from": "X.78", "to": "X.79", "type": "uses" },
	  { "from": "VII.20", "to": "X.79", "type": "uses" },

	  { "from": "X.79", "to": "X.80", "type": "uses" },
	  { "from": "X.76", "to": "X.80", "type": "uses" },
	  { "from": "X.60", "to": "X.80", "type": "uses" },
	  { "from": "X.44", "to": "X.80", "type": "uses" },
	  
	  { "from": "X.76", "to": "X.81", "type": "uses" },
	  { "from": "X.60", "to": "X.81", "type": "uses" },
	  { "from": "VI.13", "to": "X.81", "type": "uses" },
	  { "from": "X.44", "to": "X.81", "type": "uses" },

	  { "from": "X.81", "to": "X.82", "type": "uses" },
	  { "from": "X.60", "to": "X.82", "type": "uses" },
	  { "from": "X.11", "to": "X.82", "type": "uses" },

	  { "from": "X.76", "to": "X.83", "type": "uses" },
	  { "from": "X.33", "to": "X.83", "type": "uses" },
	  { "from": "X.44", "to": "X.83", "type": "uses" },

	  { "from": "X.83", "to": "X.84", "type": "uses" },
	  { "from": "VI.13", "to": "X.84", "type": "uses" },
	  { "from": "X.81", "to": "X.84", "type": "uses" },

	  { "from": "X.81", "to": "X.85", "type": "uses" },
	  { "from": "X.44", "to": "X.85", "type": "uses" },
	  { "from": "X.60", "to": "X.85", "type": "uses" },
	  { "from": "II.4", "to": "X.85", "type": "uses" },
	  
	  { "from": "X.58", "to": "X.86", "type": "uses" },
	  { "from": "X.60", "to": "X.86", "type": "uses" },
	  { "from": "X.73", "to": "X.86", "type": "uses" },

	  { "from": "X.30", "to": "X.87", "type": "uses" },
	  { "from": "X.33", "to": "X.87", "type": "uses" },
	  { "from": "X.76", "to": "X.87", "type": "uses" },

	  { "from": "X.81", "to": "X.88", "type": "uses" },
	  { "from": "X.30", "to": "X.88", "type": "uses" },
	  { "from": "VI.13", "to": "X.88", "type": "uses" },

	  { "from": "X.88", "to": "X.89", "type": "uses" },
	  { "from": "X.81", "to": "X.89", "type": "uses" },
	  { "from": "VI.13", "to": "X.89", "type": "uses" },

	  { "from": "X.76", "to": "X.90", "type": "uses" },
	  { "from": "X.60", "to": "X.90", "type": "uses" },
	  { "from": "X.58", "to": "X.90", "type": "uses" },
	  
	  { "from": "X.63", "to": "X.91", "type": "uses" },
	  { "from": "X.60", "to": "X.91", "type": "uses" },
	  { "from": "X.67", "to": "X.91", "type": "uses" },

	  { "from": "X.66", "to": "X.92", "type": "uses" },
	  { "from": "X.60", "to": "X.92", "type": "uses" },
	  { "from": "X.86", "to": "X.92", "type": "uses" },

	  { "from": "X.76", "to": "X.93", "type": "uses" },
	  { "from": "X.60", "to": "X.93", "type": "uses" },
	  { "from": "X.81", "to": "X.93", "type": "uses" },

	  { "from": "X.60", "to": "X.94", "type": "uses" },
	  { "from": "X.66", "to": "X.94", "type": "uses" },
	  { "from": "X.91", "to": "X.94", "type": "uses" },
	  { "from": "X.67", "to": "X.94", "type": "uses" },

	  { "from": "X.76", "to": "X.95", "type": "uses" },
	  { "from": "X.44", "to": "X.95", "type": "uses" },
	  { "from": "X.81", "to": "X.95", "type": "uses" },
	  { "from": "VI.13", "to": "X.95", "type": "uses" },
	  
	  { "from": "X.76", "to": "X.96", "type": "uses" },
	  { "from": "X.44", "to": "X.96", "type": "uses" },
	  { "from": "X.79", "to": "X.96", "type": "uses" },

	  { "from": "X.60", "to": "X.97", "type": "uses" },
	  { "from": "X.58", "to": "X.97", "type": "uses" },
	  { "from": "X.96", "to": "X.97", "type": "uses" },

	  { "from": "X.60", "to": "X.98", "type": "uses" },
	  { "from": "X.44", "to": "X.98", "type": "uses" },
	  { "from": "X.81", "to": "X.98", "type": "uses" },

	  { "from": "X.81", "to": "X.99", "type": "uses" },
	  { "from": "X.56", "to": "X.99", "type": "uses" },
	  { "from": "X.60", "to": "X.99", "type": "uses" },

	  { "from": "X.60", "to": "X.100", "type": "uses" },
	  { "from": "X.76", "to": "X.100", "type": "uses" },
	  { "from": "X.81", "to": "X.100", "type": "uses" },
	  
	  { "from": "X.95", "to": "X.101", "type": "uses" },
	  { "from": "X.60", "to": "X.101", "type": "uses" },
	  { "from": "VI.13", "to": "X.101", "type": "uses" },

	  { "from": "X.97", "to": "X.102", "type": "uses" },
	  { "from": "X.60", "to": "X.102", "type": "uses" },
	  { "from": "X.81", "to": "X.102", "type": "uses" },

	  { "from": "X.44", "to": "X.103", "type": "uses" },
	  { "from": "X.76", "to": "X.103", "type": "uses" },
	  { "from": "X.60", "to": "X.103", "type": "uses" },

	  { "from": "X.30", "to": "X.104", "type": "uses" },
	  { "from": "X.79", "to": "X.104", "type": "uses" },
	  { "from": "X.76", "to": "X.104", "type": "uses" },

	  { "from": "X.76", "to": "X.105", "type": "uses" },
	  { "from": "X.60", "to": "X.105", "type": "uses" },
	  { "from": "X.100", "to": "X.105", "type": "uses" },
	  
	  { "from": "X.97", "to": "X.106", "type": "uses" },
	  { "from": "X.100", "to": "X.106", "type": "uses" },
	  { "from": "X.105", "to": "X.106", "type": "uses" },

	  { "from": "X.71", "to": "X.107", "type": "uses" },
	  { "from": "X.81", "to": "X.107", "type": "uses" },
	  { "from": "X.106", "to": "X.107", "type": "uses" },

	  { "from": "X.81", "to": "X.108", "type": "uses" },
	  { "from": "X.88", "to": "X.108", "type": "uses" },
	  { "from": "X.89", "to": "X.108", "type": "uses" },

	  { "from": "X.96", "to": "X.109", "type": "uses" },
	  { "from": "X.102", "to": "X.109", "type": "uses" },
	  { "from": "X.103", "to": "X.109", "type": "uses" },

	  { "from": "X.89", "to": "X.110", "type": "uses" },
	  { "from": "X.95", "to": "X.110", "type": "uses" },
	  { "from": "X.100", "to": "X.110", "type": "uses" },

	  { "from": "X.109", "to": "X.111", "type": "uses" },
	  { "from": "X.96", "to": "X.111", "type": "uses" },
	  { "from": "X.100", "to": "X.111", "type": "uses" },

	  { "from": "X.111", "to": "X.112", "type": "uses" },
	  { "from": "X.106", "to": "X.112", "type": "uses" },
	  { "from": "X.100", "to": "X.112", "type": "uses" },

	  { "from": "X.112", "to": "X.113", "type": "uses" },
	  { "from": "X.97", "to": "X.113", "type": "uses" },
	  { "from": "X.105", "to": "X.113", "type": "uses" },

	  { "from": "X.110", "to": "X.114", "type": "uses" },
	  { "from": "X.95", "to": "X.114", "type": "uses" },
	  { "from": "X.81", "to": "X.114", "type": "uses" },

	  { "from": "X.114", "to": "X.115", "type": "uses" },
	  { "from": "X.95", "to": "X.115", "type": "uses" },
	  { "from": "X.108", "to": "X.115", "type": "uses" },

	  { "from": "I.4", "to": "XI.1", "type": "uses" },

	  { "from": "XI.1", "to": "XI.2", "type": "uses" },
	  { "from": "I.8", "to": "XI.2", "type": "uses" },

	  { "from": "XI.1", "to": "XI.3", "type": "uses" },
	  { "from": "XI.2", "to": "XI.3", "type": "uses" },

	  { "from": "I.1", "to": "XI.4", "type": "uses" },
	  { "from": "XI.2", "to": "XI.4", "type": "uses" },

	  { "from": "XI.1", "to": "XI.5", "type": "uses" },
	  { "from": "XI.4", "to": "XI.5", "type": "uses" },
	  
	  { "from": "XI.4", "to": "XI.6", "type": "uses" },
	  { "from": "XI.2", "to": "XI.6", "type": "uses" },

	  { "from": "I.27", "to": "XI.7", "type": "uses" },
	  { "from": "XI.6", "to": "XI.7", "type": "uses" },

	  { "from": "XI.6", "to": "XI.8", "type": "uses" },
	  { "from": "XI.7", "to": "XI.8", "type": "uses" },

	  { "from": "XI.6", "to": "XI.9", "type": "uses" },
	  { "from": "XI.8", "to": "XI.9", "type": "uses" },

	  { "from": "XI.5", "to": "XI.10", "type": "uses" },
	  { "from": "XI.6", "to": "XI.10", "type": "uses" },
	  { "from": "XI.8", "to": "XI.10", "type": "uses" },
	  
	  { "from": "XI.6", "to": "XI.11", "type": "uses" },
	  { "from": "XI.7", "to": "XI.11", "type": "uses" },

	  { "from": "I.27", "to": "XI.12", "type": "uses" },
	  { "from": "I.29", "to": "XI.12", "type": "uses" },
	  { "from": "XI.2", "to": "XI.12", "type": "uses" },

	  { "from": "XI.10", "to": "XI.13", "type": "uses" },
	  { "from": "I.29", "to": "XI.13", "type": "uses" },
	  { "from": "XI.12", "to": "XI.13", "type": "uses" },

	  { "from": "XI.6", "to": "XI.14", "type": "uses" },
	  { "from": "XI.8", "to": "XI.14", "type": "uses" },
	  { "from": "I.33", "to": "XI.14", "type": "uses" },

	  { "from": "XI.14", "to": "XI.15", "type": "uses" },
	  { "from": "I.34", "to": "XI.15", "type": "uses" },
	  
	   { "from": "XI.14", "to": "XI.16", "type": "uses" },
	  { "from": "I.36", "to": "XI.16", "type": "uses" },
	  { "from": "I.34", "to": "XI.16", "type": "uses" },

	  { "from": "I.35", "to": "XI.17", "type": "uses" },
	  { "from": "XI.14", "to": "XI.17", "type": "uses" },
	  { "from": "XI.6", "to": "XI.17", "type": "uses" },

	  { "from": "XI.14", "to": "XI.18", "type": "uses" },
	  { "from": "XI.17", "to": "XI.18", "type": "uses" },
	  { "from": "XI.8", "to": "XI.18", "type": "uses" },

	  { "from": "XI.16", "to": "XI.19", "type": "uses" },
	  { "from": "XI.18", "to": "XI.19", "type": "uses" },
	  { "from": "I.36", "to": "XI.19", "type": "uses" },

	  { "from": "XI.17", "to": "XI.20", "type": "uses" },
	  { "from": "XI.18", "to": "XI.20", "type": "uses" },
	  { "from": "XI.6", "to": "XI.20", "type": "uses" },
	  
	  { "from": "XI.1", "to": "XI.21", "type": "uses" },
	  { "from": "XI.5", "to": "XI.21", "type": "uses" },
	  { "from": "I.11", "to": "XI.21", "type": "uses" },

	  { "from": "XI.1", "to": "XI.22", "type": "uses" },
	  { "from": "XI.3", "to": "XI.22", "type": "uses" },
	  { "from": "I.4", "to": "XI.22", "type": "uses" },

	  { "from": "XI.22", "to": "XI.23", "type": "uses" },
	  { "from": "I.16", "to": "XI.23", "type": "uses" },

	  { "from": "XI.5", "to": "XI.24", "type": "uses" },
	  { "from": "XI.12", "to": "XI.24", "type": "uses" },
	  { "from": "I.29", "to": "XI.24", "type": "uses" },

	  { "from": "XI.24", "to": "XI.25", "type": "uses" },
	  { "from": "XI.21", "to": "XI.25", "type": "uses" },
	  { "from": "XI.5", "to": "XI.25", "type": "uses" },
	  
	  { "from": "XI.5", "to": "XI.26", "type": "uses" },
	  { "from": "XI.1", "to": "XI.26", "type": "uses" },

	  { "from": "XI.24", "to": "XI.27", "type": "uses" },
	  { "from": "XI.3", "to": "XI.27", "type": "uses" },
	  { "from": "I.8", "to": "XI.27", "type": "uses" },

	  { "from": "XI.22", "to": "XI.28", "type": "uses" },
	  { "from": "I.26", "to": "XI.28", "type": "uses" },

	  { "from": "XI.17", "to": "XI.29", "type": "uses" },
	  { "from": "XI.6", "to": "XI.29", "type": "uses" },
	  { "from": "I.35", "to": "XI.29", "type": "uses" },

	  { "from": "XI.29", "to": "XI.30", "type": "uses" },
	  { "from": "XI.16", "to": "XI.30", "type": "uses" },
	  { "from": "I.36", "to": "XI.30", "type": "uses" },
	  
	  { "from": "XI.29", "to": "XI.31", "type": "uses" },
	  { "from": "I.35", "to": "XI.31", "type": "uses" },
	  { "from": "XI.6", "to": "XI.31", "type": "uses" },

	  { "from": "XI.17", "to": "XI.32", "type": "uses" },
	  { "from": "XI.5", "to": "XI.32", "type": "uses" },
	  { "from": "XI.6", "to": "XI.32", "type": "uses" },

	  { "from": "XI.18", "to": "XI.33", "type": "uses" },
	  { "from": "XI.32", "to": "XI.33", "type": "uses" },
	  { "from": "XI.14", "to": "XI.33", "type": "uses" },

	  { "from": "XI.33", "to": "XI.34", "type": "uses" },
	  { "from": "XI.17", "to": "XI.34", "type": "uses" },
	  { "from": "XI.6", "to": "XI.34", "type": "uses" },

	  { "from": "XI.34", "to": "XI.35", "type": "uses" },
	  { "from": "XI.20", "to": "XI.35", "type": "uses" },
	  { "from": "XI.31", "to": "XI.35", "type": "uses" },
	  
	  { "from": "XI.35", "to": "XI.36", "type": "uses" },
	  { "from": "XI.6", "to": "XI.36", "type": "uses" },
	  { "from": "XI.17", "to": "XI.36", "type": "uses" },

	  { "from": "XI.19", "to": "XI.37", "type": "uses" },
	  { "from": "XI.34", "to": "XI.37", "type": "uses" },
	  { "from": "XI.6", "to": "XI.37", "type": "uses" },

	  { "from": "XI.35", "to": "XI.38", "type": "uses" },
	  { "from": "XI.34", "to": "XI.38", "type": "uses" },
	  { "from": "XI.20", "to": "XI.38", "type": "uses" },

	  { "from": "XI.38", "to": "XI.39", "type": "uses" },
	  { "from": "XI.36", "to": "XI.39", "type": "uses" },
	  { "from": "XI.20", "to": "XI.39", "type": "uses" },

	  { "from": "XI.37", "to": "XI.40", "type": "uses" },
	  { "from": "XI.36", "to": "XI.40", "type": "uses" },
	  { "from": "XI.6", "to": "XI.40", "type": "uses" },
	  
	  { "from": "XI.37", "to": "XI.41", "type": "uses" },
	  { "from": "XI.6", "to": "XI.41", "type": "uses" },
	  { "from": "XI.16", "to": "XI.41", "type": "uses" },

	  { "from": "XI.41", "to": "XI.42", "type": "uses" },
	  { "from": "XI.35", "to": "XI.42", "type": "uses" },
	  { "from": "XI.18", "to": "XI.42", "type": "uses" },

	  { "from": "XI.24", "to": "XI.43", "type": "uses" },
	  { "from": "XI.25", "to": "XI.43", "type": "uses" },
	  { "from": "I.29", "to": "XI.43", "type": "uses" },

	  { "from": "XI.12", "to": "XI.44", "type": "uses" },
	  { "from": "XI.24", "to": "XI.44", "type": "uses" },
	  { "from": "XI.5", "to": "XI.44", "type": "uses" },

	  { "from": "XI.5", "to": "XI.45", "type": "uses" },
	  { "from": "XI.6", "to": "XI.45", "type": "uses" },
	  { "from": "XI.1", "to": "XI.45", "type": "uses" },
	  
	  { "from": "XI.41", "to": "XI.46", "type": "uses" },
	  { "from": "XI.6", "to": "XI.46", "type": "uses" },
	  { "from": "XI.16", "to": "XI.46", "type": "uses" },

	  { "from": "XI.35", "to": "XI.47", "type": "uses" },
	  { "from": "XI.46", "to": "XI.47", "type": "uses" },
	  { "from": "XI.31", "to": "XI.47", "type": "uses" },

	  { "from": "XI.30", "to": "XI.48", "type": "uses" },
	  { "from": "XI.35", "to": "XI.48", "type": "uses" },
	  { "from": "XI.16", "to": "XI.48", "type": "uses" },

	  { "from": "XI.48", "to": "XI.49", "type": "uses" },
	  { "from": "XI.20", "to": "XI.49", "type": "uses" },
	  { "from": "XI.33", "to": "XI.49", "type": "uses" },

	  { "from": "XI.33", "to": "XI.50", "type": "uses" },
	  { "from": "XI.34", "to": "XI.50", "type": "uses" },
	  { "from": "XI.6", "to": "XI.50", "type": "uses" },
	  
	  { "from": "XI.24", "to": "XI.51", "type": "uses" },
	  { "from": "XI.43", "to": "XI.51", "type": "uses" },
	  { "from": "XI.25", "to": "XI.51", "type": "uses" },

	  { "from": "XI.51", "to": "XI.52", "type": "uses" },
	  { "from": "XI.44", "to": "XI.52", "type": "uses" },
	  { "from": "I.27", "to": "XI.52", "type": "uses" },

	  { "from": "XI.52", "to": "XI.53", "type": "uses" },
	  { "from": "XI.44", "to": "XI.53", "type": "uses" },
	  { "from": "XI.25", "to": "XI.53", "type": "uses" },

	  { "from": "XI.45", "to": "XI.54", "type": "uses" },
	  { "from": "XI.5", "to": "XI.54", "type": "uses" },
	  { "from": "I.29", "to": "XI.54", "type": "uses" },
	  
	  { "from": "V.22", "to": "XII.1", "type": "uses" },
	  { "from": "V.23", "to": "XII.1", "type": "uses" },
	  { "from": "V.24", "to": "XII.1", "type": "uses" },

	  { "from": "V.14", "to": "XII.2", "type": "uses" },
	  { "from": "V.19", "to": "XII.2", "type": "uses" },
	  { "from": "XII.1", "to": "XII.2", "type": "uses" },

	  { "from": "XII.1", "to": "XII.3", "type": "uses" },
	  { "from": "XII.2", "to": "XII.3", "type": "uses" },
	  { "from": "V.22", "to": "XII.3", "type": "uses" },

	  { "from": "I.20", "to": "XII.4", "type": "uses" },
	  { "from": "III.1", "to": "XII.4", "type": "uses" },
	  { "from": "X.1", "to": "XII.4", "type": "uses" },

	  { "from": "VI.19", "to": "XII.5", "type": "uses" },
	  { "from": "XII.4", "to": "XII.5", "type": "uses" },
	  { "from": "V.11", "to": "XII.5", "type": "uses" },
	  
	  { "from": "XII.5", "to": "XII.6", "type": "uses" },
	  { "from": "V.18", "to": "XII.6", "type": "uses" },
	  { "from": "VI.19", "to": "XII.6", "type": "uses" },

	  { "from": "XI.42", "to": "XII.7", "type": "uses" },
	  { "from": "XII.5", "to": "XII.7", "type": "uses" },
	  { "from": "XI.35", "to": "XII.7", "type": "uses" },

	  { "from": "XII.7", "to": "XII.8", "type": "uses" },
	  { "from": "XI.20", "to": "XII.8", "type": "uses" },
	  { "from": "XI.47", "to": "XII.8", "type": "uses" },

	  { "from": "XI.20", "to": "XII.9", "type": "uses" },
	  { "from": "XI.35", "to": "XII.9", "type": "uses" },
	  { "from": "XII.8", "to": "XII.9", "type": "uses" },

	  { "from": "XII.4", "to": "XII.10", "type": "uses" },
	  { "from": "XII.9", "to": "XII.10", "type": "uses" },
	  { "from": "XI.20", "to": "XII.10", "type": "uses" },
	  
	  { "from": "XII.8", "to": "XII.11", "type": "uses" },
	  { "from": "XII.5", "to": "XII.11", "type": "uses" },
	  { "from": "XI.20", "to": "XII.11", "type": "uses" },

	  { "from": "XII.10", "to": "XII.12", "type": "uses" },
	  { "from": "XII.9", "to": "XII.12", "type": "uses" },
	  { "from": "XI.35", "to": "XII.12", "type": "uses" },

	  { "from": "XII.11", "to": "XII.13", "type": "uses" },
	  { "from": "XII.12", "to": "XII.13", "type": "uses" },

	  { "from": "XII.5", "to": "XII.14", "type": "uses" },
	  { "from": "XII.4", "to": "XII.14", "type": "uses" },
	  { "from": "V.7", "to": "XII.14", "type": "uses" },

	  { "from": "XII.14", "to": "XII.15", "type": "uses" },
	  { "from": "XII.13", "to": "XII.15", "type": "uses" },
	  { "from": "XII.12", "to": "XII.15", "type": "uses" },
	  
	  { "from": "XII.4", "to": "XII.16", "type": "uses" },
	  { "from": "XII.14", "to": "XII.16", "type": "uses" },
	  { "from": "XII.5", "to": "XII.16", "type": "uses" },

	  { "from": "XII.5", "to": "XII.17", "type": "uses" },
	  { "from": "XI.20", "to": "XII.17", "type": "uses" },
	  { "from": "XII.9", "to": "XII.17", "type": "uses" },

	  { "from": "XII.15", "to": "XII.18", "type": "uses" },
	  { "from": "XII.16", "to": "XII.18", "type": "uses" },
	  { "from": "XII.17", "to": "XII.18", "type": "uses" },
	  
	  { "from": "VI.30", "to": "XIII.1", "type": "uses" },
	  { "from": "II.11", "to": "XIII.1", "type": "uses" },
	  { "from": "X.1", "to": "XIII.1", "type": "uses" },

	  { "from": "VI.28", "to": "XIII.2", "type": "uses" },
	  { "from": "I.47", "to": "XIII.2", "type": "uses" },
	  { "from": "II.14", "to": "XIII.2", "type": "uses" },

	  { "from": "XIII.2", "to": "XIII.3", "type": "uses" },
	  { "from": "I.22", "to": "XIII.3", "type": "uses" },
	  { "from": "I.47", "to": "XIII.3", "type": "uses" },

	  { "from": "I.47", "to": "XIII.4", "type": "uses" },
	  { "from": "VI.19", "to": "XIII.4", "type": "uses" },
	  { "from": "X.1", "to": "XIII.4", "type": "uses" },

	  { "from": "XIII.1", "to": "XIII.5", "type": "uses" },
	  { "from": "X.6", "to": "XIII.5", "type": "uses" },
	  { "from": "VI.30", "to": "XIII.5", "type": "uses" },
	  
	  { "from": "XIII.4", "to": "XIII.6", "type": "uses" },
	  { "from": "XII.18", "to": "XIII.6", "type": "uses" },
	  { "from": "XI.13", "to": "XIII.6", "type": "uses" },

	  { "from": "I.46", "to": "XIII.7", "type": "uses" },
	  { "from": "XI.14", "to": "XIII.7", "type": "uses" },
	  { "from": "XII.18", "to": "XIII.7", "type": "uses" },

	  { "from": "XIII.6", "to": "XIII.8", "type": "uses" },
	  { "from": "XIII.7", "to": "XIII.8", "type": "uses" },
	  { "from": "XI.34", "to": "XIII.8", "type": "uses" },

	  { "from": "XIII.6", "to": "XIII.9", "type": "uses" },
	  { "from": "XIII.7", "to": "XIII.9", "type": "uses" },
	  { "from": "XIII.8", "to": "XIII.9", "type": "uses" },
	  { "from": "V.10", "to": "XIII.9", "type": "uses" },

	  { "from": "XIII.1", "to": "XIII.10", "type": "uses" },
	  { "from": "XIII.5", "to": "XIII.10", "type": "uses" },
	  { "from": "XIII.6", "to": "XIII.10", "type": "uses" },
	  { "from": "XII.18", "to": "XIII.10", "type": "uses" },
	  
	  { "from": "XIII.10", "to": "XIII.11", "type": "uses" },
	  { "from": "XI.20", "to": "XIII.11", "type": "uses" },
	  { "from": "XI.13", "to": "XIII.11", "type": "uses" },

	  { "from": "XIII.11", "to": "XIII.12", "type": "uses" },
	  { "from": "XII.18", "to": "XIII.12", "type": "uses" },
	  { "from": "XIII.6", "to": "XIII.12", "type": "uses" },

	  { "from": "XIII.1", "to": "XIII.13", "type": "uses" },
	  { "from": "XIII.5", "to": "XIII.13", "type": "uses" },
	  { "from": "I.10", "to": "XIII.13", "type": "uses" },

	  { "from": "XIII.13", "to": "XIII.14", "type": "uses" },
	  { "from": "XIII.1", "to": "XIII.14", "type": "uses" },
	  { "from": "XI.34", "to": "XIII.14", "type": "uses" },

	  { "from": "XIII.14", "to": "XIII.15", "type": "uses" },
	  { "from": "XII.18", "to": "XIII.15", "type": "uses" },
	  { "from": "XIII.6", "to": "XIII.15", "type": "uses" },
	  
	  { "from": "XIII.12", "to": "XIII.16", "type": "uses" },
	  { "from": "XIII.10", "to": "XIII.16", "type": "uses" },
	  { "from": "XII.4", "to": "XIII.16", "type": "uses" },

	  { "from": "XIII.15", "to": "XIII.17", "type": "uses" },
	  { "from": "XIII.14", "to": "XIII.17", "type": "uses" },
	  { "from": "XII.4", "to": "XIII.17", "type": "uses" },

	  { "from": "XIII.6", "to": "XIII.18", "type": "uses" },
	  { "from": "XIII.7", "to": "XIII.18", "type": "uses" },
	  { "from": "XIII.8", "to": "XIII.18", "type": "uses" },
	  { "from": "XIII.12", "to": "XIII.18", "type": "uses" },
	  { "from": "XIII.15", "to": "XIII.18", "type": "uses" },
	  { "from": "V.10", "to": "XIII.18", "type": "uses" }
 ] 
}